studentsData = [
  {
    "name": "Виктор Венелинов Кожухаров",
    "grade": 7,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 24.3,
      "Пролетно 2025": 27.5,
      "Есенно 2024": 20.0
    },
    "competition_grades": {
      "Олимпиада 2025": 1.0,
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Виктор Кристин Добриков",
    "grade": 7,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 14.0,
      "Пролетно 2025": 28.0,
      "Есенно 2024": 27.5
    },
    "competition_grades": {
      "Олимпиада 2025": 1.0,
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Николай Светославов Величков",
    "grade": 7,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 15.1,
      "Пролетно 2025": 22.5,
      "Есенно 2024": 23.0
    },
    "competition_grades": {
      "Олимпиада 2025": 1.0,
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Мартин Венциславов Хитов",
    "grade": 7,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Олимпиада 2025": 14.0,
      "Пролетно 2025": 27.5,
      "Есенно 2024": 15.0
    },
    "competition_grades": {
      "Олимпиада 2025": 1.0,
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Иван Миладинов Достумски",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 15.2,
      "Пролетно 2025": 24.0,
      "Есенно 2024": 16.5
    },
    "competition_grades": {
      "Олимпиада 2025": 1.0,
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Георгия Георгиева Михалева",
    "grade": 7,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2025": 14.3,
      "Пролетно 2025": 27.0,
      "Есенно 2024": 14.0
    },
    "competition_grades": {
      "Олимпиада 2025": 1.0,
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Ника Димитрова Атанасова",
    "grade": 7,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 29.0,
      "Есенно 2024": 24.0
    },
    "competition_grades": {
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Виктор Станимиров Стоянов",
    "grade": 7,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Олимпиада 2025": 10.0,
      "Пролетно 2025": 21.5,
      "Есенно 2024": 13.5
    },
    "competition_grades": {
      "Олимпиада 2025": 1.0,
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Александра Сашева Тодорова",
    "grade": 7,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 29.5,
      "Есенно 2024": 17.5
    },
    "competition_grades": {
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Виктор Теодор Атанасов",
    "grade": 7,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 30.0,
      "Есенно 2024": 15.0
    },
    "competition_grades": {
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Панайот Панайотов Панайотов",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 19.5,
      "Есенно 2024": 28.0
    },
    "competition_grades": {
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Михаил Евгениев Станчев",
    "grade": 7,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 27.0,
      "Есенно 2024": 14.0
    },
    "competition_grades": {
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Преслав Калоянов Пенев",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 26.0,
      "Есенно 2024": 12.5
    },
    "competition_grades": {
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Даниел Дамянов Колев",
    "grade": 7,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2025": 26.5,
      "Есенно 2024": 8.5
    },
    "competition_grades": {
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Никола Бисеров Петров",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 19.0,
      "Есенно 2024": 16.0
    },
    "competition_grades": {
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Венцислав Маринов Георгиев",
    "grade": 7,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Пролетно 2025": 18.0,
      "Есенно 2024": 16.0
    },
    "competition_grades": {
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Алексей Андреевич Карташев",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 16.5,
      "Есенно 2024": 10.0
    },
    "competition_grades": {
      "Олимпиада 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Йоан Деянов Иванов",
    "grade": 7,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 22.0
    },
    "competition_grades": {
      "Олимпиада 2025": 1.0
    }
  },
  {
    "name": "Иванета Николова Николова",
    "grade": 7,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 28.5
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "Калоян Стефанов Стефанов",
    "grade": 7,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 19.0,
      "Есенно 2024": 12.5
    },
    "competition_grades": {
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Добрил Иванов Иванов",
    "grade": 7,
    "school": "125 СУ \"Боян Пенев\"",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 28.0
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "Никола Недялков Василев",
    "grade": 7,
    "school": "125 СУ \"Боян Пенев\"",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 28.0
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "Борис Георгиев Иванов",
    "grade": 7,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 27.5
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "Габриел Кирилов Гавазки",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 27.5
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "София Живкова Пампорова",
    "grade": 7,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2025": 19.5,
      "Есенно 2024": 9.5
    },
    "competition_grades": {
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Гергана Тихомирова Тотева",
    "grade": 7,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 26.5
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "Божидар Атанасов Тодоров",
    "grade": 7,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2025": 22.5,
      "Есенно 2024": 4.5
    },
    "competition_grades": {
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Николай Йорданов Цветанов",
    "grade": 7,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетно 2025": 21.5,
      "Есенно 2024": 5.0
    },
    "competition_grades": {
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Александра Белчева Ботева",
    "grade": 7,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2025": 16.0,
      "Есенно 2024": 12.0
    },
    "competition_grades": {
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Деян Динков Пейков",
    "grade": 7,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 24.5
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "Кирил Веселинов Киров",
    "grade": 7,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 24.5
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "Борис Стефанов Диков",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 18.3
    },
    "competition_grades": {
      "Олимпиада 2025": 1.0
    }
  },
  {
    "name": "Боян Георгиев Гогов",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 24.0
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "Лилия Нейчева Дамгалиева",
    "grade": 7,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 13.0
    },
    "competition_grades": {
      "Олимпиада 2025": 1.0
    }
  },
  {
    "name": "Георги Стоянов Димов",
    "grade": 7,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 6.0,
      "Есенно 2024": 15.0
    },
    "competition_grades": {
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Борис Бориславов Ангелов",
    "grade": 7,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетно 2025": 17.0
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "Камен Иванов Пехливанов",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 12.5
    },
    "competition_grades": {
      "Олимпиада 2025": 1.0
    }
  },
  {
    "name": "Шиджа Донг",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 16.5
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "Димитър Станиславов Пасков",
    "grade": 7,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенно 2024": 21.5
    },
    "competition_grades": {
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Николай Павлов Тахрилов",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 16.0
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "Христо Йорданов Ботев",
    "grade": 7,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 16.0
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "Лазар Ивов Георгиев",
    "grade": 7,
    "school": "7 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 11.8
    },
    "competition_grades": {
      "Олимпиада 2025": 1.0
    }
  },
  {
    "name": "Денис Кукса",
    "grade": 7,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Пролетно 2025": 15.0
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "Полина Павловна Курчакова",
    "grade": 7,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2025": 14.5
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "Никола Драгомиров Найденов",
    "grade": 7,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетно 2025": 9.0,
      "Есенно 2024": 6.0
    },
    "competition_grades": {
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Даниел Кирилов Кръстев",
    "grade": 7,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2025": 12.5
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "Михаил Станиславов Георгиев",
    "grade": 7,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 9.3
    },
    "competition_grades": {
      "Олимпиада 2025": 1.0
    }
  },
  {
    "name": "Ема Александрова Сиди",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенно 2024": 16.5
    },
    "competition_grades": {
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Теодора Георгиева Георгиева",
    "grade": 7,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 4.0,
      "Есенно 2024": 11.0
    },
    "competition_grades": {
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Александър Любомиров Стайков",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 12.0
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "Боян Александров Стоев",
    "grade": 7,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2025": 11.5
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "Елена Костадинова Купенова",
    "grade": 7,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 11.5
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "Александър Любомиров Тотев",
    "grade": 7,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 8.5
    },
    "competition_grades": {
      "Олимпиада 2025": 1.0
    }
  },
  {
    "name": "Елена Иванова Илкова",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенно 2024": 15.0
    },
    "competition_grades": {
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Филип Юриев Джалев",
    "grade": 7,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенно 2024": 14.5
    },
    "competition_grades": {
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Савина Иванова Василева",
    "grade": 7,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 8.0
    },
    "competition_grades": {
      "Олимпиада 2025": 1.0
    }
  },
  {
    "name": "Драгомир Владиславов Матеев",
    "grade": 7,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетно 2025": 7.0,
      "Есенно 2024": 4.0
    },
    "competition_grades": {
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Ния Николаева Миронова",
    "grade": 7,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 9.5
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "Кристиан Рази Ханна",
    "grade": 7,
    "school": "104 ОУ",
    "city": "София",
    "competitions": {
      "Есенно 2024": 12.5
    },
    "competition_grades": {
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Христо Димитров Суванджиев",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенно 2024": 11.0
    },
    "competition_grades": {
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Костадин Тихомиров Костадинов",
    "grade": 7,
    "school": "ППМГ",
    "city": "Ловеч",
    "competitions": {
      "Пролетно 2025": 7.5
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "Светослава Драгомирова Колева",
    "grade": 7,
    "school": "ППМГ \"Никола Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Есенно 2024": 9.0
    },
    "competition_grades": {
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "София Вергил Кънчева",
    "grade": 7,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетно 2025": 6.5
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "Росислав Росенов Войков",
    "grade": 7,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетно 2025": 0.5,
      "Есенно 2024": 6.0
    },
    "competition_grades": {
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Цветомир Владимиров Александров",
    "grade": 7,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 4.0
    },
    "competition_grades": {
      "Пролетно 2025": 1.0,
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Стоян Георгиев Смилков",
    "grade": 7,
    "school": "ПМГ \"Акад. Сергей Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Олимпиада 2025": 3.5
    },
    "competition_grades": {
      "Олимпиада 2025": 1.0
    }
  },
  {
    "name": "Далия Тодорова Нейкова",
    "grade": 7,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 4.5
    },
    "competition_grades": {
      "Пролетно 2025": 1.0
    }
  },
  {
    "name": "Денис Кукса Григорйе",
    "grade": 7,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Есенно 2024": 6.0
    },
    "competition_grades": {
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Ивайла Младенова Пашовска",
    "grade": 7,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Есенно 2024": 5.0
    },
    "competition_grades": {
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Берк Исмаил Хазим",
    "grade": 7,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Есенно 2024": 4.0
    },
    "competition_grades": {
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Анелия Станимирова Стефанова",
    "grade": 7,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Есенно 2024": 3.0
    },
    "competition_grades": {
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Никита Гумашев",
    "grade": 7,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Есенно 2024": 2.5
    },
    "competition_grades": {
      "Есенно 2024": 1.0
    }
  },
  {
    "name": "Петър Петров Петров",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 26.5,
      "Пролетно 2025": 28.5,
      "Есенно 2024": 28.4,
      "Олимпиада 2024": 19.0,
      "Пролетно 2024": 24.0,
      "Есенно 2023": 28.0
    },
    "competition_grades": {
      "Олимпиада 2025": 2.0,
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Олимпиада 2024": 1.0,
      "Пролетно 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Бижо Бижев Бижев",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 26.0,
      "Пролетно 2025": 24.5,
      "Есенно 2024": 23.7,
      "Олимпиада 2024": 14.0,
      "Пролетно 2024": 27.25,
      "Есенно 2023": 29.0
    },
    "competition_grades": {
      "Олимпиада 2025": 2.0,
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Олимпиада 2024": 1.0,
      "Пролетно 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Борислава Иванова Бачовска",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 25.5,
      "Пролетно 2025": 16.0,
      "Есенно 2024": 28.6,
      "Олимпиада 2024": 23.0,
      "Пролетно 2024": 26.75,
      "Есенно 2023": 28.5
    },
    "competition_grades": {
      "Олимпиада 2025": 2.0,
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Олимпиада 2024": 1.0,
      "Пролетно 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Виктор Анев Анев",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 22.5,
      "Пролетно 2025": 26.5,
      "Есенно 2024": 27.1,
      "Пролетно 2024": 25.25,
      "Есенно 2023": 29.5
    },
    "competition_grades": {
      "Олимпиада 2025": 2.0,
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Пролетно 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Никола Станимиров Костов",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 23.5,
      "Пролетно 2025": 29.5,
      "Есенно 2024": 28.1,
      "Пролетно 2024": 22.3
    },
    "competition_grades": {
      "Олимпиада 2025": 2.0,
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Пролетно 2024": 1.0
    }
  },
  {
    "name": "Борислав Росен Бъчваров",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 24.0,
      "Пролетно 2025": 27.0,
      "Есенно 2024": 25.8,
      "Олимпиада 2024": 16.0
    },
    "competition_grades": {
      "Олимпиада 2025": 2.0,
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Олимпиада 2024": 1.0
    }
  },
  {
    "name": "Мартин Стефанов Чавдаров",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 22.0,
      "Пролетно 2025": 23.5,
      "Есенно 2024": 21.4,
      "Олимпиада 2024": 26.0
    },
    "competition_grades": {
      "Олимпиада 2025": 2.0,
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Олимпиада 2024": 1.0
    }
  },
  {
    "name": "Борис Илиев Пулев",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 15.5,
      "Пролетно 2025": 27.5,
      "Есенно 2024": 25.9,
      "Олимпиада 2024": 22.5
    },
    "competition_grades": {
      "Олимпиада 2025": 2.0,
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Олимпиада 2024": 1.0
    }
  },
  {
    "name": "Невена Георгиева Ралева",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 18.0,
      "Пролетно 2025": 20.5,
      "Есенно 2024": 23.8,
      "Пролетно 2024": 19.5,
      "Есенно 2023": 25.75
    },
    "competition_grades": {
      "Олимпиада 2025": 2.0,
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Пролетно 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Петър Атанасов Григоров",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 18.0,
      "Пролетно 2025": 26.5,
      "Есенно 2024": 23.8,
      "Пролетно 2024": 20.75
    },
    "competition_grades": {
      "Олимпиада 2025": 2.0,
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Пролетно 2024": 1.0
    }
  },
  {
    "name": "Виктор Мартинов Георгиев",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 22.5,
      "Есенно 2024": 27.1,
      "Олимпиада 2024": 15.0,
      "Есенно 2023": 28.0
    },
    "competition_grades": {
      "Олимпиада 2025": 2.0,
      "Есенно 2024": 2.0,
      "Олимпиада 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Огнян Добрев Добрев",
    "grade": 8,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 21.5,
      "Есенно 2024": 26.5,
      "Пролетно 2024": 25.5,
      "Есенно 2023": 26.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Пролетно 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Мария Живкова Желязкова",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 17.0,
      "Есенно 2024": 23.5,
      "Олимпиада 2024": 12.5,
      "Пролетно 2024": 20.25,
      "Есенно 2023": 27.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Олимпиада 2024": 1.0,
      "Пролетно 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Янилия Теодор Терпо",
    "grade": 8,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2025": 27.0,
      "Есенно 2024": 23.1,
      "Олимпиада 2024": 21.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Олимпиада 2024": 1.0
    }
  },
  {
    "name": "Даниел Христов Тодоров",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 22.5,
      "Есенно 2024": 25.0,
      "Олимпиада 2024": 21.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Олимпиада 2024": 1.0
    }
  },
  {
    "name": "Емил Александров Кожухаров",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 14.5,
      "Пролетно 2025": 11.5,
      "Есенно 2024": 27.5
    },
    "competition_grades": {
      "Олимпиада 2025": 2.0,
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0
    }
  },
  {
    "name": "Теа Валентинова Тодорова",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 20.5,
      "Есенно 2024": 25.8,
      "Пролетно 2024": 22.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Пролетно 2024": 1.0
    }
  },
  {
    "name": "Виктор Георгиев Сланчев",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 14.5,
      "Пролетно 2025": 17.0,
      "Есенно 2024": 16.7
    },
    "competition_grades": {
      "Олимпиада 2025": 2.0,
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0
    }
  },
  {
    "name": "Никола Доцов Доцов",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 23.0,
      "Есенно 2024": 21.5,
      "Олимпиада 2024": 16.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Олимпиада 2024": 1.0
    }
  },
  {
    "name": "Лев Юриевич Беленкий",
    "grade": 8,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 13.0,
      "Есенно 2024": 19.5,
      "Пролетно 2024": 26.25,
      "Есенно 2023": 27.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Пролетно 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Делян-Слав Атанасов Мирев",
    "grade": 8,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 17.0,
      "Есенно 2024": 26.5,
      "Пролетно 2024": 21.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Пролетно 2024": 1.0
    }
  },
  {
    "name": "Деян Кръстев Гигов",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 14.5,
      "Есенно 2024": 21.9,
      "Пролетно 2024": 16.25,
      "Есенно 2023": 23.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Пролетно 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Яни Мишев Мишев",
    "grade": 8,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2025": 17.5,
      "Есенно 2024": 24.7,
      "Олимпиада 2024": 14.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Олимпиада 2024": 1.0
    }
  },
  {
    "name": "Георги Миленов Проданов",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 18.0,
      "Пролетно 2025": 19.0
    },
    "competition_grades": {
      "Олимпиада 2025": 2.0,
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Велина Валентинова Тодорова",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 13.0,
      "Есенно 2024": 26.2,
      "Пролетно 2024": 18.75
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Пролетно 2024": 1.0
    }
  },
  {
    "name": "Дорян Димитров Добрев",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 9.5,
      "Есенно 2024": 14.5,
      "Пролетно 2024": 23.65,
      "Есенно 2023": 21.5
    },
    "competition_grades": {
      "Олимпиада 2025": 2.0,
      "Есенно 2024": 2.0,
      "Пролетно 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Виктор Евгениев Кукурешков",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 14.5,
      "Есенно 2024": 20.8,
      "Есенно 2023": 27.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Марина Димитрова Маринова 0",
    "grade": 8,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенно 2024": 23.4,
      "Олимпиада 2024": 19.0,
      "Пролетно 2024": 24.25
    },
    "competition_grades": {
      "Есенно 2024": 2.0,
      "Олимпиада 2024": 1.0,
      "Пролетно 2024": 1.0
    }
  },
  {
    "name": "Александър Викторов Иванов",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 19.0,
      "Пролетно 2025": 12.0
    },
    "competition_grades": {
      "Олимпиада 2025": 2.0,
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Тодор Николаев Кюлафлийски",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 19.5,
      "Есенно 2024": 22.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0
    }
  },
  {
    "name": "Матей Павлов Маринов",
    "grade": 8,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2025": 15.5,
      "Есенно 2024": 23.2
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0
    }
  },
  {
    "name": "Теодор Стойков Стойков",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 18.0,
      "Есенно 2024": 17.1
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0
    }
  },
  {
    "name": "Борис Николов Георгиев",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 16.0,
      "Есенно 2024": 19.3
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0
    }
  },
  {
    "name": "Антони Валентинов Стоев",
    "grade": 8,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2025": 13.0,
      "Есенно 2024": 21.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0
    }
  },
  {
    "name": "Борис Валентинов Захариев",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 18.0,
      "Есенно 2024": 14.4
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0
    }
  },
  {
    "name": "Павел Великов Казаков",
    "grade": 8,
    "school": "ППМГ \"Гео Милев\"",
    "city": "Стара Загора",
    "competitions": {
      "Есенно 2024": 17.8,
      "Пролетно 2024": 21.0,
      "Есенно 2023": 18.0
    },
    "competition_grades": {
      "Есенно 2024": 2.0,
      "Пролетно 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Борис Антонов Матеев",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 15.0,
      "Есенно 2024": 17.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0
    }
  },
  {
    "name": "Николай Тихомиров Цветков",
    "grade": 8,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 6.0,
      "Есенно 2024": 17.6,
      "Есенно 2023": 25.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Калина Симеонова Симеонова",
    "grade": 8,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2025": 9.5,
      "Есенно 2024": 23.2
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0
    }
  },
  {
    "name": "Александър Георгиев Гендов",
    "grade": 8,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2025": 15.5,
      "Есенно 2024": 14.7
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0
    }
  },
  {
    "name": "Камен Атанасов Бангачев",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенно 2024": 24.7,
      "Есенно 2023": 25.0
    },
    "competition_grades": {
      "Есенно 2024": 2.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Виктория Николаева Митева",
    "grade": 8,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 1.5,
      "Есенно 2024": 20.7,
      "Пролетно 2024": 13.0,
      "Есенно 2023": 11.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Пролетно 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Мартин Владимиров Висулчев",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 19.0
    },
    "competition_grades": {
      "Олимпиада 2025": 2.0
    }
  },
  {
    "name": "Огняна Мариянова Петкова",
    "grade": 8,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 6.5,
      "Пролетно 2024": 19.0,
      "Есенно 2023": 23.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Пролетно 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Михаил Миленов Иванов",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 25.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Анна Стоянова Кръстева",
    "grade": 8,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 11.0,
      "Пролетно 2024": 18.75,
      "Есенно 2023": 19.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Пролетно 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Алпай Ариф Халил",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 18.0
    },
    "competition_grades": {
      "Олимпиада 2025": 2.0
    }
  },
  {
    "name": "Димитър Галинов Хайдутов",
    "grade": 8,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2025": 15.0,
      "Есенно 2024": 11.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0
    }
  },
  {
    "name": "Виктор Диан Спасов",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенно 2024": 17.0,
      "Олимпиада 2024": 18.5
    },
    "competition_grades": {
      "Есенно 2024": 2.0,
      "Олимпиада 2024": 1.0
    }
  },
  {
    "name": "Илля Андрийович Ивановский",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 23.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Никола Христов Цветков",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 18.5,
      "Пролетно 2024": 6.75
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Пролетно 2024": 1.0
    }
  },
  {
    "name": "Даниел Красимиров Парушев",
    "grade": 8,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 4.5,
      "Есенно 2024": 14.0,
      "Пролетно 2024": 15.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0,
      "Пролетно 2024": 1.0
    }
  },
  {
    "name": "Ивайло Христинов Димитров",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 21.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Ивайло Огнянов Андонов",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 20.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Агнеса Петрова Галанова",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 7.5,
      "Есенно 2024": 16.6
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0
    }
  },
  {
    "name": "Емили Бохос Бохосян",
    "grade": 8,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2025": 8.5,
      "Есенно 2024": 14.8
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0
    }
  },
  {
    "name": "Данаил Данаилов Дацев",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 19.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Кристиян Кирилов Апостолов",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 6.0,
      "Есенно 2024": 17.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0
    }
  },
  {
    "name": "Стефан Иванов Лесичков",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 14.0
    },
    "competition_grades": {
      "Олимпиада 2025": 2.0
    }
  },
  {
    "name": "Мая Владимирова Милойкова",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 9.0,
      "Пролетно 2024": 21.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Пролетно 2024": 1.0
    }
  },
  {
    "name": "Едоард Едоардов Байов",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 8.5,
      "Есенно 2024": 11.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0
    }
  },
  {
    "name": "Георги Петров Георгиев",
    "grade": 8,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетно 2024": 18.0,
      "Есенно 2023": 28.0
    },
    "competition_grades": {
      "Пролетно 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Стоян Николаев Костадинов",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2024": 19.25,
      "Есенно 2023": 23.0
    },
    "competition_grades": {
      "Пролетно 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Велин Ивайлов Пенчев",
    "grade": 8,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетно 2024": 17.75,
      "Есенно 2023": 23.5
    },
    "competition_grades": {
      "Пролетно 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Теодор Колев Колев",
    "grade": 8,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетно 2024": 18.0,
      "Есенно 2023": 17.25
    },
    "competition_grades": {
      "Пролетно 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Ангелина Петрова Попова",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 4.0,
      "Есенно 2024": 12.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2024": 2.0
    }
  },
  {
    "name": "Северин Юриев Кавлаков",
    "grade": 8,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетно 2024": 17.0,
      "Есенно 2023": 17.5
    },
    "competition_grades": {
      "Пролетно 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Никола Станиславов Мановски",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 12.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Виктор Венциславов Хаджибеев",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 11.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Захари Константинов Тотев",
    "grade": 8,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетно 2024": 13.25,
      "Есенно 2023": 17.0
    },
    "competition_grades": {
      "Пролетно 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Николай Валериев Кавалски",
    "grade": 8,
    "school": "91. НЕГ \"Проф. К. Гълъбов\"",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 8.0,
      "Есенно 2023": 7.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Никола Христов Колев",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2024": 23.25
    },
    "competition_grades": {
      "Пролетно 2024": 1.0
    }
  },
  {
    "name": "Виктория Бранимирова Начева",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 9.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Даника Станиславова Райкова",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 9.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Петър Николаев Ненов",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 15.5
    },
    "competition_grades": {
      "Олимпиада 2024": 1.0
    }
  },
  {
    "name": "Александър Ивайлов Русев",
    "grade": 8,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетно 2024": 15.5,
      "Есенно 2023": 6.0
    },
    "competition_grades": {
      "Пролетно 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Денислав Филипов Филипов",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенно 2023": 24.5
    },
    "competition_grades": {
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Марина Василева Георгиева",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенно 2023": 23.0
    },
    "competition_grades": {
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Михаил Стоянов Чолаков",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Есенно 2023": 22.25
    },
    "competition_grades": {
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Любомир Кирилов Харачеров",
    "grade": 8,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Пролетно 2024": 6.0,
      "Есенно 2023": 14.0
    },
    "competition_grades": {
      "Пролетно 2024": 1.0,
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Мартин Петров Петров",
    "grade": 8,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенно 2023": 21.5
    },
    "competition_grades": {
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Тея Яворова Спирова",
    "grade": 8,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенно 2023": 21.5
    },
    "competition_grades": {
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Тодор Любенов Добрев",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенно 2023": 21.5
    },
    "competition_grades": {
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Селена Емилова Бухова",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2024": 16.05
    },
    "competition_grades": {
      "Пролетно 2024": 1.0
    }
  },
  {
    "name": "Пламен Николаев Големанов",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенно 2023": 20.5
    },
    "competition_grades": {
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Мартина Красимирова Илиева",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2024": 14.4
    },
    "competition_grades": {
      "Пролетно 2024": 1.0
    }
  },
  {
    "name": "Виктория Венциславова Димкина",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Есенно 2023": 18.5
    },
    "competition_grades": {
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Емре Нехат Назиф",
    "grade": 8,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Есенно 2024": 6.4
    },
    "competition_grades": {
      "Есенно 2024": 2.0
    }
  },
  {
    "name": "Антоний Диан Лалев",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 4.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Теодор Пенев Господинов",
    "grade": 8,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенно 2023": 13.5
    },
    "competition_grades": {
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Бояна Николаева Цаневска",
    "grade": 8,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 4.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Виктория Ангелова Атанасова",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 4.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Дария Златкова Златева",
    "grade": 8,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търниво",
    "competitions": {
      "Пролетно 2025": 3.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Иван Томов Тончев",
    "grade": 8,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Пролетно 2024": 6.0
    },
    "competition_grades": {
      "Пролетно 2024": 1.0
    }
  },
  {
    "name": "Антон Иванов Голев",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 2.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Михаил Нестор Несторов",
    "grade": 8,
    "school": "ТУЕС",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 2.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Никола Дончев Николов",
    "grade": 8,
    "school": "НПГПТО \"М. В. Ломоносов\"",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 2.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Полина Петкова Здравкова",
    "grade": 8,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2025": 2.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Петър Мирославов Петров",
    "grade": 8,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенно 2023": 7.0
    },
    "competition_grades": {
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Боян Ивайлов Дочев",
    "grade": 8,
    "school": "НПГПТО \"М. В. Ломоносов\"",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 2.0
    },
    "competition_grades": {
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Велизара Васиева Иванова",
    "grade": 8,
    "school": "НПГПТО \"М. В. Ломоносов\"",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 1.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Даниел Георгиев Димитров",
    "grade": 8,
    "school": "СУ \"Йордан Йовков\"",
    "city": "Кърджали",
    "competitions": {
      "Пролетно 2024": 3.0
    },
    "competition_grades": {
      "Пролетно 2024": 1.0
    }
  },
  {
    "name": "Йоана Георгиева Христова",
    "grade": 8,
    "school": "СУ \"Йордан Йовков\"",
    "city": "Кърджали",
    "competitions": {
      "Пролетно 2024": 2.0
    },
    "competition_grades": {
      "Пролетно 2024": 1.0
    }
  },
  {
    "name": "Никола Елиас Хенди",
    "grade": 8,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Есенно 2023": 2.5
    },
    "competition_grades": {
      "Есенно 2023": 1.0
    }
  },
  {
    "name": "Хелин Бирсен Мехмедали",
    "grade": 8,
    "school": "СУ \"Йордан Йовков\"",
    "city": "Кърджали",
    "competitions": {
      "Пролетно 2024": 1.5
    },
    "competition_grades": {
      "Пролетно 2024": 1.0
    }
  },
  {
    "name": "Веселина Валентинова Витанова",
    "grade": 8,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търниво",
    "competitions": {
      "Пролетно 2025": 0.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Силвия Михаилова Кирилова",
    "grade": 8,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2025": 0.5
    },
    "competition_grades": {
      "Пролетно 2025": 2.0
    }
  },
  {
    "name": "Нурай Нурджан Юсеин",
    "grade": 8,
    "school": "СУ \"Йордан Йовков\"",
    "city": "Кърджали",
    "competitions": {
      "Пролетно 2024": 1.0
    },
    "competition_grades": {
      "Пролетно 2024": 1.0
    }
  },
  {
    "name": "Светослав Дариел Арабов",
    "grade": 9,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Олимпиада 2025": 83.3,
      "Пролетно 2025": 26.5,
      "Есенно 2024": 13.0,
      "Олимпиада 2024": 19.5,
      "Пролетно 2024": 29.75,
      "Есенно 2023": 25.9,
      "Пролетно 2023": 25.0,
      "Есенно 2022": 18.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Олимпиада 2024": 2.0,
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0,
      "Пролетно 2023": 1.0,
      "Есенно 2022": 1.0
    }
  },
  {
    "name": "Йордан Мариянов Петков",
    "grade": 9,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 72.15,
      "Пролетно 2025": 16.0,
      "Есенно 2024": 22.0,
      "Олимпиада 2024": 19.5,
      "Пролетно 2024": 28.5,
      "Есенно 2023": 27.8,
      "Олимпиада 2023": 12.0,
      "Пролетно 2023": 29.0,
      "Есенно 2022": 25.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Олимпиада 2024": 2.0,
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0,
      "Олимпиада 2023": 1.0,
      "Пролетно 2023": 1.0,
      "Есенно 2022": 1.0
    }
  },
  {
    "name": "Мирослав Методиев Драганов",
    "grade": 9,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2025": 61.1,
      "Пролетно 2025": 17.0,
      "Есенно 2024": 21.0,
      "Олимпиада 2024": 24.0,
      "Пролетно 2024": 30.0,
      "Есенно 2023": 22.9,
      "Олимпиада 2023": 15.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0,
      "Олимпиада 2023": 1.0
    }
  },
  {
    "name": "Максим Валентин Босилков",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 21.5,
      "Пролетно 2025": 23.5,
      "Есенно 2024": 26.5,
      "Олимпиада 2024": 23.5,
      "Пролетно 2024": 22.0,
      "Есенно 2023": 29.8,
      "Олимпиада 2023": 29.5,
      "Пролетно 2023": 27.0,
      "Есенно 2022": 22.5
    },
    "competition_grades": {
      "Олимпиада 2025": 3.0,
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0,
      "Олимпиада 2023": 1.0,
      "Пролетно 2023": 1.0,
      "Есенно 2022": 1.0
    }
  },
  {
    "name": "Кирил Кирилов Момчилов",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 17.0,
      "Пролетно 2025": 23.0,
      "Есенно 2024": 19.5,
      "Олимпиада 2024": 23.0,
      "Пролетно 2024": 25.0,
      "Есенно 2023": 25.8,
      "Олимпиада 2023": 29.0,
      "Пролетно 2023": 18.5
    },
    "competition_grades": {
      "Олимпиада 2025": 3.0,
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0,
      "Олимпиада 2023": 1.0,
      "Пролетно 2023": 1.0
    }
  },
  {
    "name": "Иван Владимиров Стоянов",
    "grade": 9,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2025": 24.0,
      "Пролетно 2025": 17.0,
      "Есенно 2024": 24.5,
      "Олимпиада 2024": 17.5,
      "Пролетно 2024": 21.0,
      "Есенно 2023": 22.1,
      "Пролетно 2023": 21.0,
      "Есенно 2022": 21.5
    },
    "competition_grades": {
      "Олимпиада 2025": 3.0,
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0,
      "Пролетно 2023": 1.0,
      "Есенно 2022": 1.0
    }
  },
  {
    "name": "Филип Владимиров Алексиев",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 28.0,
      "Пролетно 2025": 25.5,
      "Есенно 2024": 22.0,
      "Пролетно 2024": 21.0,
      "Есенно 2023": 25.9
    },
    "competition_grades": {
      "Олимпиада 2025": 3.0,
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0
    }
  },
  {
    "name": "Цветелина Николаева Данова",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 20.5,
      "Пролетно 2025": 27.0,
      "Есенно 2024": 22.0,
      "Олимпиада 2024": 17.5,
      "Пролетно 2024": 18.25,
      "Есенно 2023": 23.9
    },
    "competition_grades": {
      "Олимпиада 2025": 3.0,
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0
    }
  },
  {
    "name": "Томас Николай Настев",
    "grade": 9,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 19.0,
      "Пролетно 2025": 18.0,
      "Есенно 2024": 20.0,
      "Пролетно 2024": 24.5,
      "Есенно 2023": 25.9,
      "Олимпиада 2023": 26.0,
      "Пролетно 2023": 28.5,
      "Есенно 2022": 17.5
    },
    "competition_grades": {
      "Олимпиада 2025": 3.0,
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0,
      "Олимпиада 2023": 1.0,
      "Пролетно 2023": 1.0,
      "Есенно 2022": 1.0
    }
  },
  {
    "name": "Радослав Антони Стефанов",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 17.5,
      "Пролетно 2025": 23.5,
      "Есенно 2024": 16.5,
      "Олимпиада 2024": 17.0,
      "Пролетно 2024": 16.5,
      "Есенно 2023": 28.8,
      "Олимпиада 2023": 8.0
    },
    "competition_grades": {
      "Олимпиада 2025": 3.0,
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0,
      "Олимпиада 2023": 1.0
    }
  },
  {
    "name": "Димитър Ангелов Мисирков",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 26.5,
      "Есенно 2024": 21.5,
      "Олимпиада 2024": 21.0,
      "Пролетно 2024": 25.5,
      "Есенно 2023": 29.7,
      "Пролетно 2023": 22.5,
      "Есенно 2022": 27.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0,
      "Пролетно 2023": 1.0,
      "Есенно 2022": 1.0
    }
  },
  {
    "name": "Божидар Светомиров Маринов",
    "grade": 9,
    "school": "ЕГ \"Пловдив\"",
    "city": "Пловдив",
    "competitions": {
      "Олимпиада 2025": 27.5,
      "Пролетно 2025": 14.5,
      "Есенно 2024": 15.0,
      "Пролетно 2024": 13.5,
      "Есенно 2023": 26.0,
      "Олимпиада 2023": 16.0
    },
    "competition_grades": {
      "Олимпиада 2025": 3.0,
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0,
      "Олимпиада 2023": 1.0
    }
  },
  {
    "name": "Александър Боянов Джунов",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 18.0,
      "Пролетно 2025": 23.5,
      "Есенно 2024": 17.0,
      "Олимпиада 2024": 12.0,
      "Есенно 2023": 25.9
    },
    "competition_grades": {
      "Олимпиада 2025": 3.0,
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Есенно 2023": 2.0
    }
  },
  {
    "name": "Дамян Иванов Накев",
    "grade": 9,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 24.0,
      "Есенно 2024": 18.5,
      "Олимпиада 2024": 16.5,
      "Пролетно 2024": 29.5,
      "Есенно 2023": 25.0,
      "Олимпиада 2023": 20.0,
      "Пролетно 2023": 16.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0,
      "Олимпиада 2023": 1.0,
      "Пролетно 2023": 1.0
    }
  },
  {
    "name": "Никола Светославов Иванов",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 24.5,
      "Пролетно 2025": 12.5,
      "Есенно 2024": 21.0,
      "Пролетно 2024": 21.0
    },
    "competition_grades": {
      "Олимпиада 2025": 3.0,
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Пролетно 2024": 2.0
    }
  },
  {
    "name": "Йоана Пламенова Младенова",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 23.5,
      "Пролетно 2025": 12.0,
      "Олимпиада 2024": 21.5,
      "Пролетно 2024": 24.0,
      "Олимпиада 2023": 8.5
    },
    "competition_grades": {
      "Олимпиада 2025": 3.0,
      "Пролетно 2025": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетно 2024": 2.0,
      "Олимпиада 2023": 1.0
    }
  },
  {
    "name": "Дарио Тодоров Тасев",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 22.0,
      "Пролетно 2025": 22.5,
      "Есенно 2024": 11.0,
      "Пролетно 2024": 13.0
    },
    "competition_grades": {
      "Олимпиада 2025": 3.0,
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Пролетно 2024": 2.0
    }
  },
  {
    "name": "Карим Ахмад Кхазал",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 24.0,
      "Есенно 2024": 23.5,
      "Олимпиада 2024": 18.5,
      "Пролетно 2024": 16.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетно 2024": 2.0
    }
  },
  {
    "name": "Антон Галинов Стоянов",
    "grade": 9,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 25.5,
      "Есенно 2024": 16.0,
      "Пролетно 2024": 11.0,
      "Есенно 2023": 21.4,
      "Пролетно 2023": 18.5,
      "Есенно 2022": 14.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0,
      "Пролетно 2023": 1.0,
      "Есенно 2022": 1.0
    }
  },
  {
    "name": "Федаил Ейваз Ферат",
    "grade": 9,
    "school": "ПГСАГ \"Кольо Фичето\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2025": 22.5,
      "Пролетно 2025": 14.0,
      "Есенно 2024": 12.5
    },
    "competition_grades": {
      "Олимпиада 2025": 3.0,
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Филип Галинов Тодоров",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 13.5,
      "Пролетно 2025": 18.5,
      "Есенно 2024": 7.0,
      "Пролетно 2024": 19.25
    },
    "competition_grades": {
      "Олимпиада 2025": 3.0,
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Пролетно 2024": 2.0
    }
  },
  {
    "name": "Нихат Дурханов Салиев",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 19.5,
      "Есенно 2024": 13.0,
      "Олимпиада 2024": 18.0,
      "Пролетно 2024": 14.5
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетно 2024": 2.0
    }
  },
  {
    "name": "Божидар Александров Сакарев",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 11.5,
      "Есенно 2024": 21.5,
      "Олимпиада 2024": 19.0,
      "Пролетно 2024": 15.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетно 2024": 2.0
    }
  },
  {
    "name": "Елен Стоянова Елинова",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 21.0,
      "Есенно 2024": 17.0,
      "Пролетно 2024": 19.5,
      "Олимпиада 2023": 11.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Пролетно 2024": 2.0,
      "Олимпиада 2023": 1.0
    }
  },
  {
    "name": "Виктор Валентинов Станев",
    "grade": 9,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Олимпиада 2025": 10.5,
      "Пролетно 2025": 16.0,
      "Есенно 2024": 11.5,
      "Пролетно 2024": 11.0
    },
    "competition_grades": {
      "Олимпиада 2025": 3.0,
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Пролетно 2024": 2.0
    }
  },
  {
    "name": "Илияна Илиянова Дамянова",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 23.0,
      "Есенно 2024": 9.0,
      "Пролетно 2024": 8.0,
      "Есенно 2023": 25.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0
    }
  },
  {
    "name": "Иван Златинов Велев",
    "grade": 9,
    "school": "МГ",
    "city": "Пловдив",
    "competitions": {
      "Олимпиада 2025": 23.0,
      "Олимпиада 2024": 13.0
    },
    "competition_grades": {
      "Олимпиада 2025": 3.0,
      "Олимпиада 2024": 2.0
    }
  },
  {
    "name": "Виктор Георгиев Генов",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 18.0,
      "Есенно 2024": 17.0,
      "Пролетно 2024": 17.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Пролетно 2024": 2.0
    }
  },
  {
    "name": "Любослав Красимиров Димов",
    "grade": 9,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2025": 26.0,
      "Есенно 2024": 15.5
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Атанас Иванов Голев",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 14.0,
      "Есенно 2024": 14.5,
      "Пролетно 2024": 20.5,
      "Есенно 2023": 12.9
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0
    }
  },
  {
    "name": "Камен Кирилов Янев",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 18.0,
      "Есенно 2024": 10.5,
      "Пролетно 2024": 11.0,
      "Есенно 2023": 14.2
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0
    }
  },
  {
    "name": "Виктория Боянова Белчева",
    "grade": 9,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 11.5,
      "Есенно 2024": 16.0,
      "Пролетно 2024": 10.5,
      "Есенно 2023": 17.5
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0
    }
  },
  {
    "name": "Марина Димитрова Маринова",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 13.0,
      "Есенно 2024": 10.5,
      "Пролетно 2024": 13.5,
      "Есенно 2023": 18.5
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0
    }
  },
  {
    "name": "Адриан Юлианов Пекунов",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 12.0,
      "Есенно 2024": 8.5,
      "Пролетно 2024": 4.0,
      "Олимпиада 2023": 19.5,
      "Пролетно 2023": 20.0,
      "Есенно 2022": 14.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Пролетно 2024": 2.0,
      "Олимпиада 2023": 1.0,
      "Пролетно 2023": 1.0,
      "Есенно 2022": 1.0
    }
  },
  {
    "name": "Деан Йорданов Ташев",
    "grade": 9,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2025": 9.5,
      "Есенно 2024": 11.0,
      "Пролетно 2024": 8.0,
      "Есенно 2023": 19.4,
      "Пролетно 2023": 16.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0,
      "Пролетно 2023": 1.0
    }
  },
  {
    "name": "Преслав Росенов Апостолов",
    "grade": 9,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2025": 17.5,
      "Есенно 2024": 10.0,
      "Пролетно 2024": 7.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Пролетно 2024": 2.0
    }
  },
  {
    "name": "Светла Николаева Димчева",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 8.0,
      "Есенно 2024": 15.0,
      "Пролетно 2024": 19.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Пролетно 2024": 2.0
    }
  },
  {
    "name": "Преслав Драгомиров Колев",
    "grade": 9,
    "school": "ППМГ \"Никола Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Есенно 2024": 16.5,
      "Пролетно 2024": 14.0,
      "Есенно 2023": 25.6
    },
    "competition_grades": {
      "Есенно 2024": 3.0,
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0
    }
  },
  {
    "name": "Теодора Иванова Илиева",
    "grade": 9,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Пролетно 2024": 14.0,
      "Есенно 2023": 17.4,
      "Пролетно 2023": 12.5
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0,
      "Пролетно 2023": 1.0
    }
  },
  {
    "name": "Нора Калинова Родопска",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2024": 17.5,
      "Есенно 2023": 29.6,
      "Олимпиада 2023": 15.5,
      "Пролетно 2023": 13.5,
      "Есенно 2022": 16.25
    },
    "competition_grades": {
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0,
      "Олимпиада 2023": 1.0,
      "Пролетно 2023": 1.0,
      "Есенно 2022": 1.0
    }
  },
  {
    "name": "Мария Игнатова Гавраилова",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 18.5
    },
    "competition_grades": {
      "Олимпиада 2025": 3.0
    }
  },
  {
    "name": "Василена Симеонова Нанева",
    "grade": 9,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 17.5
    },
    "competition_grades": {
      "Олимпиада 2025": 3.0
    }
  },
  {
    "name": "Калоян Христин Динин",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 13.5,
      "Есенно 2024": 10.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Никола Кръстев Ръжев",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 9.0,
      "Есенно 2024": 7.0,
      "Пролетно 2024": 7.0,
      "Пролетно 2023": 10.5,
      "Есенно 2022": 13.25
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Пролетно 2024": 2.0,
      "Пролетно 2023": 1.0,
      "Есенно 2022": 1.0
    }
  },
  {
    "name": "Александър Любомиров Славов",
    "grade": 9,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2025": 13.5,
      "Есенно 2024": 8.5
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Дарина Спартак Маринова",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 12.0,
      "Есенно 2024": 10.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Доменик Дезмънд Доус",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Есенно 2024": 16.0,
      "Есенно 2023": 22.6
    },
    "competition_grades": {
      "Есенно 2024": 3.0,
      "Есенно 2023": 2.0
    }
  },
  {
    "name": "Борис Валери Тодоров",
    "grade": 9,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Пролетно 2025": 8.5,
      "Есенно 2024": 7.0,
      "Олимпиада 2023": 21.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0,
      "Олимпиада 2023": 1.0
    }
  },
  {
    "name": "Андрей Александров Гиренко",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 14.0
    },
    "competition_grades": {
      "Олимпиада 2025": 3.0
    }
  },
  {
    "name": "Доминик Дезмънт Доус",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 18.5
    },
    "competition_grades": {
      "Пролетно 2025": 3.0
    }
  },
  {
    "name": "Яна Росенова Благоева",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 12.5,
      "Пролетно 2024": 13.5
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Пролетно 2024": 2.0
    }
  },
  {
    "name": "Димитър Петров Димитров",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 18.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0
    }
  },
  {
    "name": "Йована Димитрова Маринова",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 15.5
    },
    "competition_grades": {
      "Пролетно 2025": 3.0
    }
  },
  {
    "name": "Огнян Аспарухов Митов",
    "grade": 9,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2025": 9.0,
      "Есенно 2024": 8.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Денис Гюнай Аптула",
    "grade": 9,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 4.5,
      "Есенно 2024": 11.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Виктор Димитров Янакиев",
    "grade": 9,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 12.5
    },
    "competition_grades": {
      "Пролетно 2025": 3.0
    }
  },
  {
    "name": "Елица Данаилова Божилова",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 9.75,
      "Пролетно 2024": 6.5
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Пролетно 2024": 2.0
    }
  },
  {
    "name": "Мартин Петров Миланов",
    "grade": 9,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 7.0,
      "Есенно 2024": 6.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Кристиана Калоянова Калчева",
    "grade": 9,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2024": 10.5,
      "Есенно 2023": 12.5,
      "Пролетно 2023": 13.5
    },
    "competition_grades": {
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0,
      "Пролетно 2023": 1.0
    }
  },
  {
    "name": "Борис Стамбирский",
    "grade": 9,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Пролетно 2025": 6.0,
      "Есенно 2024": 5.5
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Ива Илиянова Сомлева",
    "grade": 9,
    "school": "Izzi",
    "city": "София",
    "competitions": {
      "Пролетно 2024": 10.5,
      "Пролетно 2023": 18.5,
      "Есенно 2022": 15.5
    },
    "competition_grades": {
      "Пролетно 2024": 2.0,
      "Пролетно 2023": 1.0,
      "Есенно 2022": 1.0
    }
  },
  {
    "name": "Кристиян Георгиев Георгиев",
    "grade": 9,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2024": 12.0,
      "Есенно 2023": 14.0
    },
    "competition_grades": {
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0
    }
  },
  {
    "name": "Момчил Чавдаров Видев",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенно 2023": 29.9
    },
    "competition_grades": {
      "Есенно 2023": 2.0
    }
  },
  {
    "name": "Калоян Миленов Шуманов",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 1.0,
      "Есенно 2024": 11.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Магдалена Станиславова Миленкова",
    "grade": 9,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2025": 5.0,
      "Олимпиада 2024": 7.5
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Олимпиада 2024": 2.0
    }
  },
  {
    "name": "Петър Тихомиров Денев",
    "grade": 9,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2025": 3.5,
      "Есенно 2024": 7.5
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Антони Емилов Димитров",
    "grade": 9,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенно 2023": 13.3,
      "Пролетно 2023": 14.5,
      "Есенно 2022": 16.25
    },
    "competition_grades": {
      "Есенно 2023": 2.0,
      "Пролетно 2023": 1.0,
      "Есенно 2022": 1.0
    }
  },
  {
    "name": "Йосиф Симо Меламед",
    "grade": 9,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 4.5,
      "Есенно 2024": 5.5
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Ясен Владиславов Пенчев",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Есенно 2024": 11.5
    },
    "competition_grades": {
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Борис Антонов Димов",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 8.5
    },
    "competition_grades": {
      "Пролетно 2025": 3.0
    }
  },
  {
    "name": "Мина Филипова Недева",
    "grade": 9,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 7.5
    },
    "competition_grades": {
      "Пролетно 2025": 3.0
    }
  },
  {
    "name": "Георги Томов Георгиев",
    "grade": 9,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2025": 4.5,
      "Пролетно 2024": 7.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Пролетно 2024": 2.0
    }
  },
  {
    "name": "Кристияна Калоянова Калчева",
    "grade": 9,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 5.5
    },
    "competition_grades": {
      "Пролетно 2025": 3.0,
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Лена Вероника Софи Фолнер",
    "grade": 9,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Есенно 2024": 8.5
    },
    "competition_grades": {
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Борис Пенчев Златев",
    "grade": 9,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенно 2024": 7.5
    },
    "competition_grades": {
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Карина Николаева Велчева",
    "grade": 9,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенно 2023": 16.3
    },
    "competition_grades": {
      "Есенно 2023": 2.0
    }
  },
  {
    "name": "Александър Николаев Стефанов",
    "grade": 9,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетно 2025": 5.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0
    }
  },
  {
    "name": "Георги Даниелов Александров",
    "grade": 9,
    "school": "ГПЧЕ \"Симеон Радев\"",
    "city": "Перник",
    "competitions": {
      "Пролетно 2025": 5.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0
    }
  },
  {
    "name": "Ивайло Николаев Иванов",
    "grade": 9,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетно 2025": 5.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0
    }
  },
  {
    "name": "Лора Димитрова Черкезова",
    "grade": 9,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Пролетно 2025": 5.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0
    }
  },
  {
    "name": "Петко Десиславов Иванов",
    "grade": 9,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 5.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0
    }
  },
  {
    "name": "Румяна Ивайлова Руменова",
    "grade": 9,
    "school": "ППМГ",
    "city": "Ловеч",
    "competitions": {
      "Пролетно 2025": 5.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0
    }
  },
  {
    "name": "Александър Боянов Русев",
    "grade": 9,
    "school": "ПГСАГ \"Кольо Фичето\"",
    "city": "Бургас",
    "competitions": {
      "Есенно 2024": 6.5
    },
    "competition_grades": {
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Ивелин Веселинов Методиев",
    "grade": 9,
    "school": "ПГКПИ",
    "city": "Бургас",
    "competitions": {
      "Есенно 2024": 6.5
    },
    "competition_grades": {
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Виктория Христова Бумбарова",
    "grade": 9,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2023": 18.5,
      "Есенно 2022": 11.5
    },
    "competition_grades": {
      "Пролетно 2023": 1.0,
      "Есенно 2022": 1.0
    }
  },
  {
    "name": "Васил Атанасов Скатов",
    "grade": 9,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2024": 2.0,
      "Есенно 2023": 11.9
    },
    "competition_grades": {
      "Пролетно 2024": 2.0,
      "Есенно 2023": 2.0
    }
  },
  {
    "name": "Димитър Димитров Катранджиев",
    "grade": 9,
    "school": "НПГПТО \"М. В. Ломоносов\"",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 4.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0
    }
  },
  {
    "name": "Симеон Георгиев Недялков",
    "grade": 9,
    "school": "ППМГ",
    "city": "Ловеч",
    "competitions": {
      "Пролетно 2025": 4.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0
    }
  },
  {
    "name": "Дарина Захариева Павлова",
    "grade": 9,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 3.5
    },
    "competition_grades": {
      "Пролетно 2025": 3.0
    }
  },
  {
    "name": "Теодора Мирославова Кирова",
    "grade": 9,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2023": 7.5,
      "Есенно 2022": 14.5
    },
    "competition_grades": {
      "Пролетно 2023": 1.0,
      "Есенно 2022": 1.0
    }
  },
  {
    "name": "Константин Димитров Сарафов",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Есенно 2024": 4.0
    },
    "competition_grades": {
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Александър Виденов Киневирски",
    "grade": 9,
    "school": "ПМГ \"Яне Сандански\"",
    "city": "Гоце Делчев",
    "competitions": {
      "Пролетно 2023": 16.5
    },
    "competition_grades": {
      "Пролетно 2023": 1.0
    }
  },
  {
    "name": "Йоанна Антонова Василева",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 6.5,
      "Есенно 2022": 9.0
    },
    "competition_grades": {
      "Олимпиада 2023": 1.0,
      "Есенно 2022": 1.0
    }
  },
  {
    "name": "Здравко Божидаров Божилов",
    "grade": 9,
    "school": "ПМГ \"Атанас Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Есенно 2024": 3.5
    },
    "competition_grades": {
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Димитър Костадинов Кочев",
    "grade": 9,
    "school": "НПГПТО \"М. В. Ломоносов\"",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 2.5
    },
    "competition_grades": {
      "Пролетно 2025": 3.0
    }
  },
  {
    "name": "Даниел Ивайлов Целяшки",
    "grade": 9,
    "school": "Професионална гимназия Велизар Пеев",
    "city": "Своге",
    "competitions": {
      "Есенно 2023": 7.9
    },
    "competition_grades": {
      "Есенно 2023": 2.0
    }
  },
  {
    "name": "Георги Стоянов Димитров",
    "grade": 9,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2023": 14.0
    },
    "competition_grades": {
      "Пролетно 2023": 1.0
    }
  },
  {
    "name": "Константин Пламенов Атанасов",
    "grade": 9,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетно 2023": 10.0,
      "Есенно 2022": 5.0
    },
    "competition_grades": {
      "Пролетно 2023": 1.0,
      "Есенно 2022": 1.0
    }
  },
  {
    "name": "Емил Стоянов Досев",
    "grade": 9,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Есенно 2024": 3.0
    },
    "competition_grades": {
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Цветомир Ивайлов Цандев",
    "grade": 9,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2023": 12.5
    },
    "competition_grades": {
      "Пролетно 2023": 1.0
    }
  },
  {
    "name": "Красимир Иванов Донков",
    "grade": 9,
    "school": "ППМГ",
    "city": "Ловеч",
    "competitions": {
      "Пролетно 2025": 2.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0
    }
  },
  {
    "name": "Мирослав Георгиев Алексиев",
    "grade": 9,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетно 2025": 2.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0
    }
  },
  {
    "name": "Велко Атанасов Кожухаров",
    "grade": 9,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Есенно 2024": 2.5
    },
    "competition_grades": {
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Герасим Павел Каназирев",
    "grade": 9,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Есенно 2024": 2.5
    },
    "competition_grades": {
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Йованин Атанасов Петков",
    "grade": 9,
    "school": "ПГСАГ \"Кольо Фичето\"",
    "city": "Бургас",
    "competitions": {
      "Есенно 2024": 2.5
    },
    "competition_grades": {
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Константин Катеринов Хаджидимитров",
    "grade": 9,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Есенно 2024": 2.5
    },
    "competition_grades": {
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Мая Божидарова Шуманова",
    "grade": 9,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Есенно 2024": 2.5
    },
    "competition_grades": {
      "Есенно 2024": 3.0
    }
  },
  {
    "name": "Боян Искренов Маринов",
    "grade": 9,
    "school": "21 СУ",
    "city": "София",
    "competitions": {
      "Пролетно 2023": 10.5
    },
    "competition_grades": {
      "Пролетно 2023": 1.0
    }
  },
  {
    "name": "Рая Иванова Иванова",
    "grade": 9,
    "school": "ОУ\"Св.Патриарх",
    "city": "Варна",
    "competitions": {
      "Пролетно 2023": 9.5
    },
    "competition_grades": {
      "Пролетно 2023": 1.0
    }
  },
  {
    "name": "Борис Симеонов Петранов",
    "grade": 9,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетно 2023": 7.0,
      "Есенно 2022": 2.5
    },
    "competition_grades": {
      "Пролетно 2023": 1.0,
      "Есенно 2022": 1.0
    }
  },
  {
    "name": "Никола Димитров Козаров",
    "grade": 9,
    "school": "СУ",
    "city": "Варна",
    "competitions": {
      "Пролетно 2023": 8.5
    },
    "competition_grades": {
      "Пролетно 2023": 1.0
    }
  },
  {
    "name": "Моника Красимирова Кръстева",
    "grade": 9,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 1.5
    },
    "competition_grades": {
      "Пролетно 2025": 3.0
    }
  },
  {
    "name": "Невена Христова Сановска",
    "grade": 9,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетно 2023": 7.0
    },
    "competition_grades": {
      "Пролетно 2023": 1.0
    }
  },
  {
    "name": "Владимир Мирославов Господинов",
    "grade": 9,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2023": 5.5
    },
    "competition_grades": {
      "Пролетно 2023": 1.0
    }
  },
  {
    "name": "Данаил Атанасов Андреев",
    "grade": 9,
    "school": "СУ",
    "city": "Варна",
    "competitions": {
      "Пролетно 2023": 5.5
    },
    "competition_grades": {
      "Пролетно 2023": 1.0
    }
  },
  {
    "name": "Никълъс Михайлов Михайлов",
    "grade": 9,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенно 2022": 7.25
    },
    "competition_grades": {
      "Есенно 2022": 1.0
    }
  },
  {
    "name": "Владислав Александров Грозданов",
    "grade": 9,
    "school": "Професионална гимназия Велизар Пеев",
    "city": "Своге",
    "competitions": {
      "Есенно 2023": 3.0
    },
    "competition_grades": {
      "Есенно 2023": 2.0
    }
  },
  {
    "name": "Людмил Денчо Банков",
    "grade": 9,
    "school": "ЧСУ \"Наука за деца\"",
    "city": "София",
    "competitions": {
      "Пролетно 2024": 2.0
    },
    "competition_grades": {
      "Пролетно 2024": 2.0
    }
  },
  {
    "name": "Александър Станимир Събев",
    "grade": 9,
    "school": "ОУ\"Св.Патриарх",
    "city": "Варна",
    "competitions": {
      "Пролетно 2023": 4.5
    },
    "competition_grades": {
      "Пролетно 2023": 1.0
    }
  },
  {
    "name": "Богомил Миленов Нелковски",
    "grade": 9,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенно 2022": 5.5
    },
    "competition_grades": {
      "Есенно 2022": 1.0
    }
  },
  {
    "name": "Нина Владимирова Петрова",
    "grade": 9,
    "school": "ОУ",
    "city": "Варна",
    "competitions": {
      "Пролетно 2023": 4.0
    },
    "competition_grades": {
      "Пролетно 2023": 1.0
    }
  },
  {
    "name": "Александър Боянов Калчев",
    "grade": 9,
    "school": "СУ",
    "city": "Варна",
    "competitions": {
      "Пролетно 2023": 3.5
    },
    "competition_grades": {
      "Пролетно 2023": 1.0
    }
  },
  {
    "name": "Симона Свиленова Петрова",
    "grade": 9,
    "school": "ОУ",
    "city": "Варна",
    "competitions": {
      "Пролетно 2023": 3.0
    },
    "competition_grades": {
      "Пролетно 2023": 1.0
    }
  },
  {
    "name": "Владислав Владиславов Пенчев",
    "grade": 9,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенно 2022": 3.5
    },
    "competition_grades": {
      "Есенно 2022": 1.0
    }
  },
  {
    "name": "Кристиян Яворов Янакиев",
    "grade": 9,
    "school": "ОУ",
    "city": "Варна",
    "competitions": {
      "Пролетно 2023": 1.5
    },
    "competition_grades": {
      "Пролетно 2023": 1.0
    }
  },
  {
    "name": "Мария Даниелова Филкова",
    "grade": 9,
    "school": "ОУ",
    "city": "Варна",
    "competitions": {
      "Пролетно 2023": 0.5
    },
    "competition_grades": {
      "Пролетно 2023": 1.0
    }
  },
  {
    "name": "Александър Емилов Костадинов",
    "grade": 9,
    "school": "НПГПТО \"М. В. Ломоносов\"",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 0.0
    },
    "competition_grades": {
      "Пролетно 2025": 3.0
    }
  },
  {
    "name": "Раян Деянов Камаринчев",
    "grade": 10,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Олимпиада 2025": 27.5,
      "Пролетно 2025": 28.5,
      "Есенно 2024": 28.5,
      "Олимпиада 2024": 28.0,
      "Пролетно 2024": 19.0,
      "Есенно 2023": 25.5,
      "Олимпиада 2023": 15.0,
      "Есенно 2022": 12.0,
      "Олимпиада 2022": 19.4,
      "Пролетно 2022": 22.0,
      "2 кръг 2022": 23.0
    },
    "competition_grades": {
      "Олимпиада 2025": 4.0,
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Есенно 2022": 2.0,
      "Олимпиада 2022": 1.0,
      "Пролетно 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Красимир Делчев Тухчиев",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 30.0,
      "Пролетно 2025": 29.5,
      "Есенно 2024": 24.5,
      "Олимпиада 2024": 23.0,
      "Пролетно 2024": 22.0,
      "Есенно 2023": 27.25,
      "Олимпиада 2023": 18.5,
      "Пролетно 2023": 21.5
    },
    "competition_grades": {
      "Олимпиада 2025": 4.0,
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетно 2023": 2.0
    }
  },
  {
    "name": "Стоян Йорданов Милев",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 28.0,
      "Пролетно 2025": 29.25,
      "Есенно 2024": 18.0,
      "Олимпиада 2024": 25.0,
      "Пролетно 2024": 28.0,
      "Есенно 2023": 27.0,
      "Олимпиада 2023": 20.0,
      "Пролетно 2023": 16.0,
      "Есенно 2022": 29.0
    },
    "competition_grades": {
      "Олимпиада 2025": 4.0,
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетно 2023": 2.0,
      "Есенно 2022": 2.0
    }
  },
  {
    "name": "Виктория Тихомирова Данчева",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 29.0,
      "Пролетно 2025": 27.5,
      "Есенно 2024": 14.0,
      "Олимпиада 2024": 30.0,
      "Пролетно 2024": 14.5,
      "Есенно 2023": 24.0,
      "Олимпиада 2023": 19.0,
      "Пролетно 2023": 17.5,
      "Пролетно 2022": 18.5
    },
    "competition_grades": {
      "Олимпиада 2025": 4.0,
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетно 2023": 2.0,
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Светослав Мартинов Цветанов",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 21.5,
      "Пролетно 2025": 22.5,
      "Есенно 2024": 14.0,
      "Олимпиада 2024": 18.5,
      "Пролетно 2024": 23.0,
      "Есенно 2023": 27.75,
      "Пролетно 2023": 19.0,
      "Есенно 2022": 21.0,
      "Олимпиада 2022": 15.4,
      "2 кръг 2022": 25.5
    },
    "competition_grades": {
      "Олимпиада 2025": 4.0,
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0,
      "Пролетно 2023": 2.0,
      "Есенно 2022": 2.0,
      "Олимпиада 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Нора Ивайлова Георгиева",
    "grade": 10,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 20.5,
      "Пролетно 2025": 23.0,
      "Есенно 2024": 10.0,
      "Олимпиада 2024": 23.5,
      "Пролетно 2024": 21.0,
      "Есенно 2023": 21.0,
      "Олимпиада 2023": 19.0,
      "Пролетно 2023": 12.5,
      "Есенно 2022": 15.5,
      "Олимпиада 2022": 16.55,
      "2 кръг 2022": 24.5
    },
    "competition_grades": {
      "Олимпиада 2025": 4.0,
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетно 2023": 2.0,
      "Есенно 2022": 2.0,
      "Олимпиада 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Теодор Бисеров Петров",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 15.0,
      "Пролетно 2025": 22.0,
      "Есенно 2024": 16.5,
      "Олимпиада 2024": 22.0,
      "Пролетно 2024": 22.0,
      "Есенно 2023": 26.5,
      "Есенно 2022": 24.5,
      "Олимпиада 2022": 24.6,
      "2 кръг 2022": 26.0
    },
    "competition_grades": {
      "Олимпиада 2025": 4.0,
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0,
      "Есенно 2022": 2.0,
      "Олимпиада 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Миглена Момчилова Меркулова",
    "grade": 10,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Олимпиада 2025": 18.5,
      "Пролетно 2025": 23.0,
      "Есенно 2024": 25.5,
      "Пролетно 2024": 20.0,
      "Есенно 2023": 24.0,
      "Олимпиада 2023": 8.0,
      "Пролетно 2023": 15.5,
      "Есенно 2022": 8.0
    },
    "competition_grades": {
      "Олимпиада 2025": 4.0,
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетно 2023": 2.0,
      "Есенно 2022": 2.0
    }
  },
  {
    "name": "Борис Димитров Ангелов",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 22.0,
      "Пролетно 2025": 29.0,
      "Есенно 2024": 19.5,
      "Олимпиада 2024": 22.5,
      "Олимпиада 2022": 11.5,
      "2 кръг 2022": 23.0
    },
    "competition_grades": {
      "Олимпиада 2025": 4.0,
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Олимпиада 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Аделина Цветкова Доровска",
    "grade": 10,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 7.55,
      "Пролетно 2025": 5.5,
      "Есенно 2024": 23.0,
      "Олимпиада 2024": 27.0,
      "Пролетно 2024": 27.0,
      "Есенно 2023": 24.75,
      "Олимпиада 2023": 19.0,
      "Пролетно 2023": 12.5,
      "Есенно 2022": 25.5,
      "Олимпиада 2022": 19.4,
      "2 кръг 2022": 24.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетно 2023": 2.0,
      "Есенно 2022": 2.0,
      "Олимпиада 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Мая Янева Минкова",
    "grade": 10,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Пролетно 2025": 20.5,
      "Есенно 2024": 21.0,
      "Олимпиада 2024": 26.0,
      "Пролетно 2024": 26.0,
      "Есенно 2023": 23.0,
      "Олимпиада 2023": 12.0,
      "Пролетно 2023": 13.5,
      "Есенно 2022": 19.5,
      "Пролетно 2022": 26.5
    },
    "competition_grades": {
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетно 2023": 2.0,
      "Есенно 2022": 2.0,
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Алекс Мартинов Киричев",
    "grade": 10,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Олимпиада 2025": 18.5,
      "Пролетно 2025": 16.25,
      "Есенно 2024": 6.5,
      "Олимпиада 2024": 17.5,
      "Пролетно 2024": 11.0,
      "Есенно 2023": 19.0,
      "Олимпиада 2023": 13.0,
      "Пролетно 2023": 7.5,
      "Есенно 2022": 20.25,
      "Олимпиада 2022": 17.8,
      "Пролетно 2022": 19.0,
      "2 кръг 2022": 22.5
    },
    "competition_grades": {
      "Олимпиада 2025": 4.0,
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетно 2023": 2.0,
      "Есенно 2022": 2.0,
      "Олимпиада 2022": 1.0,
      "Пролетно 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Искрен Христов Нинов",
    "grade": 10,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Олимпиада 2025": 18.5,
      "Пролетно 2025": 18.75,
      "Есенно 2024": 19.5,
      "Пролетно 2024": 15.5,
      "Олимпиада 2022": 18.1,
      "Пролетно 2022": 25.5,
      "2 кръг 2022": 22.5
    },
    "competition_grades": {
      "Олимпиада 2025": 4.0,
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Пролетно 2024": 3.0,
      "Олимпиада 2022": 1.0,
      "Пролетно 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Ярослав Михайлович Басков",
    "grade": 10,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Олимпиада 2025": 23.5,
      "Есенно 2024": 27.0,
      "Пролетно 2024": 17.5,
      "Есенно 2023": 18.5
    },
    "competition_grades": {
      "Олимпиада 2025": 4.0,
      "Есенно 2024": 4.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0
    }
  },
  {
    "name": "Георги Минчев Калбаков",
    "grade": 10,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 23.5,
      "Пролетно 2025": 24.5,
      "Пролетно 2024": 11.5
    },
    "competition_grades": {
      "Олимпиада 2025": 4.0,
      "Пролетно 2025": 4.0,
      "Пролетно 2024": 3.0
    }
  },
  {
    "name": "Ирина Йорданова Йорданова",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 22.5,
      "Есенно 2024": 17.0,
      "Пролетно 2024": 22.5,
      "Есенно 2023": 23.0,
      "Олимпиада 2023": 14.0,
      "Пролетно 2023": 26.0
    },
    "competition_grades": {
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетно 2023": 2.0
    }
  },
  {
    "name": "Красимир Станиславов Станков",
    "grade": 10,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2025": 19.75,
      "Есенно 2024": 16.0,
      "Олимпиада 2024": 17.0,
      "Пролетно 2024": 15.5,
      "Есенно 2023": 21.0,
      "Пролетно 2023": 12.0,
      "Есенно 2022": 8.5
    },
    "competition_grades": {
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0,
      "Пролетно 2023": 2.0,
      "Есенно 2022": 2.0
    }
  },
  {
    "name": "Владимир Мартинов Цветанов",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 20.0,
      "Есенно 2024": 11.5,
      "Олимпиада 2024": 22.5,
      "Пролетно 2024": 7.0,
      "Есенно 2023": 16.5,
      "Олимпиада 2023": 17.5,
      "Пролетно 2023": 19.5
    },
    "competition_grades": {
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетно 2023": 2.0
    }
  },
  {
    "name": "Калин Христов Кирилов",
    "grade": 10,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 14.0,
      "Пролетно 2025": 10.5,
      "Есенно 2024": 13.0,
      "Есенно 2023": 24.0,
      "Есенно 2022": 21.5,
      "Олимпиада 2022": 12.0,
      "2 кръг 2022": 22.5
    },
    "competition_grades": {
      "Олимпиада 2025": 4.0,
      "Пролетно 2025": 5.0,
      "Есенно 2024": 4.0,
      "Есенно 2023": 3.0,
      "Есенно 2022": 2.0,
      "Олимпиада 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Теодор Свиленов Илев",
    "grade": 10,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 26.0,
      "Есенно 2024": 15.5,
      "Пролетно 2024": 15.0,
      "Есенно 2023": 22.0
    },
    "competition_grades": {
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0
    }
  },
  {
    "name": "Калоян Панчов Панчовски",
    "grade": 10,
    "school": "Първа езикова гимназия",
    "city": "Варна",
    "competitions": {
      "Олимпиада 2025": 18.0,
      "Пролетно 2025": 21.5,
      "Есенно 2024": 6.5
    },
    "competition_grades": {
      "Олимпиада 2025": 4.0,
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0
    }
  },
  {
    "name": "Дона Иванова Димова",
    "grade": 10,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 16.25,
      "Есенно 2024": 7.5,
      "Олимпиада 2024": 21.5,
      "Пролетно 2024": 17.0,
      "Есенно 2023": 12.0,
      "Пролетно 2023": 10.5,
      "Есенно 2022": 7.5
    },
    "competition_grades": {
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0,
      "Пролетно 2023": 2.0,
      "Есенно 2022": 2.0
    }
  },
  {
    "name": "Цветелина Иванова Бакалова",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 28.5,
      "Олимпиада 2024": 23.0,
      "Пролетно 2022": 17.0
    },
    "competition_grades": {
      "Пролетно 2025": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Никола Димитров Лилов",
    "grade": 10,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенно 2024": 10.5,
      "Олимпиада 2024": 20.5,
      "Есенно 2023": 23.0,
      "Пролетно 2023": 11.0,
      "Есенно 2022": 17.0,
      "Олимпиада 2022": 21.0,
      "Пролетно 2022": 23.5,
      "2 кръг 2022": 26.0
    },
    "competition_grades": {
      "Есенно 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Есенно 2023": 3.0,
      "Пролетно 2023": 2.0,
      "Есенно 2022": 2.0,
      "Олимпиада 2022": 1.0,
      "Пролетно 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Димитър Росенов Йовчев",
    "grade": 10,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 15.0,
      "Есенно 2024": 11.0,
      "Пролетно 2024": 10.5,
      "Есенно 2023": 18.5
    },
    "competition_grades": {
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0
    }
  },
  {
    "name": "Станислав Каменов Янков",
    "grade": 10,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2024": 20.0,
      "Есенно 2023": 22.0,
      "Олимпиада 2023": 22.0,
      "Пролетно 2023": 18.0,
      "Есенно 2022": 22.0,
      "Олимпиада 2022": 18.5,
      "Пролетно 2022": 26.0,
      "2 кръг 2022": 23.0
    },
    "competition_grades": {
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетно 2023": 2.0,
      "Есенно 2022": 2.0,
      "Олимпиада 2022": 1.0,
      "Пролетно 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Йоан Димитров Димитров",
    "grade": 10,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 12.5,
      "Есенно 2024": 11.5,
      "Есенно 2023": 21.75,
      "Пролетно 2023": 8.5
    },
    "competition_grades": {
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Есенно 2023": 3.0,
      "Пролетно 2023": 2.0
    }
  },
  {
    "name": "Иван Антониев Дойчев",
    "grade": 10,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 7.0,
      "Пролетно 2025": 8.5,
      "Пролетно 2024": 17.0,
      "Олимпиада 2023": 5.0,
      "Есенно 2022": 20.0
    },
    "competition_grades": {
      "Олимпиада 2025": 4.0,
      "Пролетно 2025": 4.0,
      "Пролетно 2024": 3.0,
      "Олимпиада 2023": 2.0,
      "Есенно 2022": 2.0
    }
  },
  {
    "name": "Ева Иво Николова",
    "grade": 10,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 15.0,
      "Пролетно 2024": 13.5,
      "Есенно 2023": 11.0,
      "Пролетно 2023": 12.5,
      "Есенно 2022": 6.5
    },
    "competition_grades": {
      "Пролетно 2025": 4.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0,
      "Пролетно 2023": 2.0,
      "Есенно 2022": 2.0
    }
  },
  {
    "name": "Бисер Бисеров Дойчинов",
    "grade": 10,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 10.7,
      "Есенно 2024": 5.5,
      "Пролетно 2024": 9.5,
      "Есенно 2023": 19.0,
      "Есенно 2022": 7.5,
      "Пролетно 2022": 15.0
    },
    "competition_grades": {
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0,
      "Есенно 2022": 2.0,
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Мартин Иванов Димов",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 21.5,
      "Есенно 2023": 18.0,
      "Пролетно 2023": 14.5,
      "Есенно 2022": 17.0,
      "Олимпиада 2022": 14.2,
      "2 кръг 2022": 26.0
    },
    "competition_grades": {
      "Олимпиада 2024": 3.0,
      "Есенно 2023": 3.0,
      "Пролетно 2023": 2.0,
      "Есенно 2022": 2.0,
      "Олимпиада 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Яна Павлинова Вутова",
    "grade": 10,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 8.75,
      "Есенно 2024": 12.5,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 11.5
    },
    "competition_grades": {
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0
    }
  },
  {
    "name": "Даниел Валентинов Узунов",
    "grade": 10,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенно 2024": 15.0,
      "Пролетно 2024": 12.5,
      "Есенно 2023": 21.0
    },
    "competition_grades": {
      "Есенно 2024": 4.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0
    }
  },
  {
    "name": "Никола Веселинов Дебърски",
    "grade": 10,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Олимпиада 2025": 16.0
    },
    "competition_grades": {
      "Олимпиада 2025": 4.0
    }
  },
  {
    "name": "Росен Веселинов Ангелов",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 14.5
    },
    "competition_grades": {
      "Олимпиада 2025": 4.0
    }
  },
  {
    "name": "Велизар Николаев Ангелов",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2024": 18.0,
      "Есенно 2023": 18.5,
      "Олимпиада 2023": 8.5,
      "Пролетно 2023": 13.0
    },
    "competition_grades": {
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетно 2023": 2.0
    }
  },
  {
    "name": "Мирослава Мирославова Венелинова",
    "grade": 10,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 4.75,
      "Есенно 2024": 4.0,
      "Пролетно 2024": 10.0,
      "Есенно 2023": 15.0,
      "Есенно 2022": 2.0
    },
    "competition_grades": {
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0,
      "Есенно 2022": 2.0
    }
  },
  {
    "name": "Георги Георгиев Шиндаров",
    "grade": 10,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 8.2,
      "Есенно 2024": 9.0
    },
    "competition_grades": {
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0
    }
  },
  {
    "name": "Александра Пламенова Попова",
    "grade": 10,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2024": 13.5,
      "Есенно 2023": 9.5,
      "Пролетно 2023": 14.5,
      "Есенно 2022": 12.0,
      "Пролетно 2022": 24.5
    },
    "competition_grades": {
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0,
      "Пролетно 2023": 2.0,
      "Есенно 2022": 2.0,
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Валентин Кирилов Кирилов",
    "grade": 10,
    "school": "ППМГ \"Никола Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Есенно 2024": 12.5,
      "Пролетно 2024": 10.0
    },
    "competition_grades": {
      "Есенно 2024": 4.0,
      "Пролетно 2024": 3.0
    }
  },
  {
    "name": "Андрей Здравков Стефанов",
    "grade": 10,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 16.5,
      "Олимпиада 2023": 18.0
    },
    "competition_grades": {
      "Олимпиада 2024": 3.0,
      "Олимпиада 2023": 2.0
    }
  },
  {
    "name": "Даниел Николаев Гетов",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенно 2023": 25.75,
      "Олимпиада 2023": 21.5
    },
    "competition_grades": {
      "Есенно 2023": 3.0,
      "Олимпиада 2023": 2.0
    }
  },
  {
    "name": "Александър Атанасов Бангачев",
    "grade": 10,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2024": 19.5,
      "Олимпиада 2023": 12.0,
      "Есенно 2022": 11.0
    },
    "competition_grades": {
      "Пролетно 2024": 3.0,
      "Олимпиада 2023": 2.0,
      "Есенно 2022": 2.0
    }
  },
  {
    "name": "Олександр Олександров Виниченко",
    "grade": 10,
    "school": "ПГКПИ",
    "city": "Бургас",
    "competitions": {
      "Есенно 2024": 16.5
    },
    "competition_grades": {
      "Есенно 2024": 4.0
    }
  },
  {
    "name": "Росен Светлинов Манов",
    "grade": 10,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 11.5
    },
    "competition_grades": {
      "Пролетно 2025": 4.0
    }
  },
  {
    "name": "Лазар Боянов Цветков",
    "grade": 10,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенно 2024": 11.0,
      "Пролетно 2024": 6.0
    },
    "competition_grades": {
      "Есенно 2024": 4.0,
      "Пролетно 2024": 3.0
    }
  },
  {
    "name": "Алекс Бисеров Иванов",
    "grade": 10,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетно 2025": 6.7,
      "Пролетно 2024": 5.5,
      "Есенно 2023": 5.0
    },
    "competition_grades": {
      "Пролетно 2025": 4.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0
    }
  },
  {
    "name": "Никола Венциславов Гашев",
    "grade": 10,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 3.5,
      "Пролетно 2024": 11.5,
      "Пролетно 2022": 25.0
    },
    "competition_grades": {
      "Пролетно 2025": 4.0,
      "Пролетно 2024": 3.0,
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Димитър Тихомиров Данчев",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенно 2023": 20.0,
      "Пролетно 2023": 10.5,
      "Пролетно 2022": 19.5
    },
    "competition_grades": {
      "Есенно 2023": 3.0,
      "Пролетно 2023": 2.0,
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Мария Касия Людмилова Петрова",
    "grade": 10,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2023": 11.5,
      "Есенно 2022": 17.75,
      "Олимпиада 2022": 15.5,
      "Пролетно 2022": 25.0,
      "2 кръг 2022": 26.0
    },
    "competition_grades": {
      "Пролетно 2023": 2.0,
      "Есенно 2022": 2.0,
      "Олимпиада 2022": 1.0,
      "Пролетно 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Симеон Цветомиртов Цановски",
    "grade": 10,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 9.25
    },
    "competition_grades": {
      "Пролетно 2025": 4.0
    }
  },
  {
    "name": "Лъчезар Красимиров Точев",
    "grade": 10,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 3.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 2.0
    },
    "competition_grades": {
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0,
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0
    }
  },
  {
    "name": "Валерия Павлинова Петрова",
    "grade": 10,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2024": 11.5,
      "Есенно 2023": 13.5
    },
    "competition_grades": {
      "Пролетно 2024": 3.0,
      "Есенно 2023": 3.0
    }
  },
  {
    "name": "Калоян Милен Драганов",
    "grade": 10,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Есенно 2023": 14.0,
      "Олимпиада 2022": 16.5,
      "Пролетно 2022": 20.5,
      "2 кръг 2022": 25.0
    },
    "competition_grades": {
      "Есенно 2023": 3.0,
      "Олимпиада 2022": 1.0,
      "Пролетно 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Антоан Антоан Богданов",
    "grade": 10,
    "school": "МГ,, Акад. Кирил Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенно 2024": 6.5,
      "Пролетно 2024": 5.0
    },
    "competition_grades": {
      "Есенно 2024": 4.0,
      "Пролетно 2024": 3.0
    }
  },
  {
    "name": "Ана-Мария Тончо Добрева",
    "grade": 10,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетно 2025": 3.5,
      "Пролетно 2024": 7.5
    },
    "competition_grades": {
      "Пролетно 2025": 4.0,
      "Пролетно 2024": 3.0
    }
  },
  {
    "name": "Максимилиан Станиславов Хайдутов",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 19.0,
      "Есенно 2022": 15.5
    },
    "competition_grades": {
      "Олимпиада 2023": 2.0,
      "Есенно 2022": 2.0
    }
  },
  {
    "name": "Божидар Десиславов Станев",
    "grade": 10,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетно 2024": 8.5,
      "Пролетно 2022": 22.0
    },
    "competition_grades": {
      "Пролетно 2024": 3.0,
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Божидар Цветанов Дончев",
    "grade": 10,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетно 2023": 9.5,
      "Есенно 2022": 14.5,
      "Пролетно 2022": 21.0
    },
    "competition_grades": {
      "Пролетно 2023": 2.0,
      "Есенно 2022": 2.0,
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Явор Тошков Василев",
    "grade": 10,
    "school": "ППМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Есенно 2024": 6.0
    },
    "competition_grades": {
      "Есенно 2024": 4.0
    }
  },
  {
    "name": "Анна Томова Янакиева",
    "grade": 10,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 18.0
    },
    "competition_grades": {
      "Олимпиада 2023": 2.0
    }
  },
  {
    "name": "Константин Николов Младенов",
    "grade": 10,
    "school": "ЕГ \"Акад. Л. Стоянов\"",
    "city": "Благоевград",
    "competitions": {
      "Есенно 2024": 5.5
    },
    "competition_grades": {
      "Есенно 2024": 4.0
    }
  },
  {
    "name": "Цветомир Василев Смилов",
    "grade": 10,
    "school": "ППМГ \"Никола Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Есенно 2024": 5.5
    },
    "competition_grades": {
      "Есенно 2024": 4.0
    }
  },
  {
    "name": "Георгиос Ефстатиос Титопулос",
    "grade": 10,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Есенно 2023": 13.0
    },
    "competition_grades": {
      "Есенно 2023": 3.0
    }
  },
  {
    "name": "Лисалоте Пейтърова Бонсма",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенно 2023": 12.0
    },
    "competition_grades": {
      "Есенно 2023": 3.0
    }
  },
  {
    "name": "Мария Калинова Ганева",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 22.8,
      "2 кръг 2022": 25.0
    },
    "competition_grades": {
      "Олимпиада 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Иван Стоилов Стоилов",
    "grade": 10,
    "school": "ЕГ \"Хр. Ботев\"",
    "city": "Кърджали",
    "competitions": {
      "Пролетно 2024": 8.0
    },
    "competition_grades": {
      "Пролетно 2024": 3.0
    }
  },
  {
    "name": "Симеон Иванов Петков",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 17.35,
      "2 кръг 2022": 28.0
    },
    "competition_grades": {
      "Олимпиада 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Ния Боянова Иванова",
    "grade": 10,
    "school": "ППМГ \"Никола Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Есенно 2023": 10.0
    },
    "competition_grades": {
      "Есенно 2023": 3.0
    }
  },
  {
    "name": "Християн Маргаритов Маргаритов",
    "grade": 10,
    "school": "ОУ \"П.Р.Славейков\"",
    "city": "Варна",
    "competitions": {
      "Олимпиада 2022": 17.2,
      "2 кръг 2022": 23.0
    },
    "competition_grades": {
      "Олимпиада 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Александър Ивов Кръстанов",
    "grade": 10,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 1.5,
      "Есенно 2024": 2.0
    },
    "competition_grades": {
      "Пролетно 2025": 4.0,
      "Есенно 2024": 4.0
    }
  },
  {
    "name": "Радост Николова Тошева",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 13.9,
      "2 кръг 2022": 26.0
    },
    "competition_grades": {
      "Олимпиада 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Лиор Яков Майер",
    "grade": 10,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенно 2023": 9.0
    },
    "competition_grades": {
      "Есенно 2023": 3.0
    }
  },
  {
    "name": "Васил Ангелов Ангелов",
    "grade": 10,
    "school": "51 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 13.3,
      "2 кръг 2022": 25.0
    },
    "competition_grades": {
      "Олимпиада 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Боян Емилов Леондиев",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2023": 10.5,
      "Есенно 2022": 6.5
    },
    "competition_grades": {
      "Пролетно 2023": 2.0,
      "Есенно 2022": 2.0
    }
  },
  {
    "name": "Илина Теодорова Пашкунова",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 12.8,
      "2 кръг 2022": 25.0
    },
    "competition_grades": {
      "Олимпиада 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Елица Христова Декова",
    "grade": 10,
    "school": "134 СУ Димчо Дебелянов",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 13.7,
      "2 кръг 2022": 22.0
    },
    "competition_grades": {
      "Олимпиада 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Ирина Цветанова Тошева",
    "grade": 10,
    "school": "СУ Васил Левски",
    "city": "Елин Пелин",
    "competitions": {
      "Олимпиада 2022": 11.6,
      "2 кръг 2022": 25.5
    },
    "competition_grades": {
      "Олимпиада 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Тео Георгиев Георгиев",
    "grade": 10,
    "school": "107 ОУ \"Хан Крум\"",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 12.2,
      "2 кръг 2022": 22.0
    },
    "competition_grades": {
      "Олимпиада 2022": 1.0,
      "2 кръг 2022": 1.0
    }
  },
  {
    "name": "Богомил Мирославов Цанков",
    "grade": 10,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенно 2024": 3.0
    },
    "competition_grades": {
      "Есенно 2024": 4.0
    }
  },
  {
    "name": "Виктория Веселинова Горова",
    "grade": 10,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Есенно 2024": 3.0
    },
    "competition_grades": {
      "Есенно 2024": 4.0
    }
  },
  {
    "name": "Дарина Димитрова Кичукова",
    "grade": 10,
    "school": "МГ \"Акад. Кирил Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенно 2024": 3.0
    },
    "competition_grades": {
      "Есенно 2024": 4.0
    }
  },
  {
    "name": "Димитър Мартинов Димитров",
    "grade": 10,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2024": 2.0,
      "Пролетно 2023": 7.0
    },
    "competition_grades": {
      "Пролетно 2024": 3.0,
      "Пролетно 2023": 2.0
    }
  },
  {
    "name": "Теодор Цветославов Петков",
    "grade": 10,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетно 2023": 6.0,
      "Пролетно 2022": 13.5
    },
    "competition_grades": {
      "Пролетно 2023": 2.0,
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Алекс Владимиров Речников",
    "grade": 10,
    "school": "ППМГ \"Васил Левски\"",
    "city": "Смолян",
    "competitions": {
      "Пролетно 2024": 4.5
    },
    "competition_grades": {
      "Пролетно 2024": 3.0
    }
  },
  {
    "name": "Вера Мартинова Дуковска",
    "grade": 10,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2024": 4.5
    },
    "competition_grades": {
      "Пролетно 2024": 3.0
    }
  },
  {
    "name": "Луиза Стоилова Манолова",
    "grade": 10,
    "school": "СУ 'Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Пролетно 2024": 4.5
    },
    "competition_grades": {
      "Пролетно 2024": 3.0
    }
  },
  {
    "name": "Теодора Димитрова Кьосева",
    "grade": 10,
    "school": "ЧЕГ \"Проф. Иван Апостолов\"",
    "city": "София",
    "competitions": {
      "Есенно 2023": 6.0
    },
    "competition_grades": {
      "Есенно 2023": 3.0
    }
  },
  {
    "name": "Евгений Александрович Кашкин",
    "grade": 10,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенно 2023": 5.5
    },
    "competition_grades": {
      "Есенно 2023": 3.0
    }
  },
  {
    "name": "Ана-Никол Ивелинова Златарова",
    "grade": 10,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2024": 4.0
    },
    "competition_grades": {
      "Пролетно 2024": 3.0
    }
  },
  {
    "name": "Лилия Георгиева Димитрова",
    "grade": 10,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2024": 4.0
    },
    "competition_grades": {
      "Пролетно 2024": 3.0
    }
  },
  {
    "name": "Магдалена Петрова Петрова",
    "grade": 10,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетно 2022": 21.5
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Калина Стефанова Колева",
    "grade": 10,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенно 2023": 5.0
    },
    "competition_grades": {
      "Есенно 2023": 3.0
    }
  },
  {
    "name": "Стилян Веселинов Атанасов",
    "grade": 10,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетно 2022": 19.0
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Александър Мартинов Йосифов",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 18.5
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Огнян Огнянов Ганчев",
    "grade": 10,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетно 2022": 18.5
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Кристиан Мариан Неделчев",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 18.0
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Мартин Калинов Филипов",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 18.0
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Димитър Христов Тодоров",
    "grade": 10,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетно 2022": 17.0
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Дарин Ивайлов Димитров",
    "grade": 10,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетно 2022": 15.5
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Томислав Димитров Томов",
    "grade": 10,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2022": 15.5
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Елена Мариянова Димитрова",
    "grade": 10,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетно 2022": 15.0
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Стефан Дениславов Костов",
    "grade": 10,
    "school": "ППМГ \"Васил Левски\"",
    "city": "Смолян",
    "competitions": {
      "Пролетно 2024": 2.5
    },
    "competition_grades": {
      "Пролетно 2024": 3.0
    }
  },
  {
    "name": "Невена Валентинова Гечевска",
    "grade": 10,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетно 2022": 13.5
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Евгени Богданов Димитров",
    "grade": 10,
    "school": "ППМГ",
    "city": "Ловеч",
    "competitions": {
      "Пролетно 2025": 1.0
    },
    "competition_grades": {
      "Пролетно 2025": 4.0
    }
  },
  {
    "name": "Теодор Кирилов Хинков",
    "grade": 10,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетно 2022": 13.0
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Христос Елиас Хенди",
    "grade": 10,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Есенно 2023": 3.0
    },
    "competition_grades": {
      "Есенно 2023": 3.0
    }
  },
  {
    "name": "Ясен Ясенов Янев",
    "grade": 10,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенно 2022": 7.0
    },
    "competition_grades": {
      "Есенно 2022": 2.0
    }
  },
  {
    "name": "Йоана Велинова Гетова",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 12.0
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Мартин Николаев Василевски",
    "grade": 10,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2023": 5.0
    },
    "competition_grades": {
      "Пролетно 2023": 2.0
    }
  },
  {
    "name": "Стефан Иванов Дончев",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 11.0
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Дарина Николова Караиванова",
    "grade": 10,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетно 2022": 10.5
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Калоян Максимов Кръстев",
    "grade": 10,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетно 2022": 10.5
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Александър Мирославов Колев",
    "grade": 10,
    "school": "ПГКПИ",
    "city": "Бургас",
    "competitions": {
      "Есенно 2024": 1.0
    },
    "competition_grades": {
      "Есенно 2024": 4.0
    }
  },
  {
    "name": "Денислав Ивелинов Димов",
    "grade": 10,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2022": 8.5
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Михаил Михайлов Бояджиев",
    "grade": 10,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Пролетно 2022": 8.5
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Стефани Николаева Коновска",
    "grade": 10,
    "school": "СУ \"Иван Вазов\"",
    "city": "Вършец",
    "competitions": {
      "Пролетно 2022": 8.5
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Невена Валериева Русева",
    "grade": 10,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенно 2023": 2.0
    },
    "competition_grades": {
      "Есенно 2023": 3.0
    }
  },
  {
    "name": "Иван Красен Пенков",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 7.5
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Христомира Христова Иванова",
    "grade": 10,
    "school": "СУ \"Иван Вазов\"",
    "city": "Вършец",
    "competitions": {
      "Пролетно 2022": 7.0
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Йоан Николаев Маджаров",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 6.5
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Габриела Иванова Тенева",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 6.0
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Ива Владимирова Иванова",
    "grade": 10,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетно 2022": 4.5
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Сиян Дафин Кирилов",
    "grade": 10,
    "school": "5 ОУ \"Иван Вазов\"",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 4.5
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Цветияна Бориславова Борисова",
    "grade": 10,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетно 2022": 4.5
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Мария Николаева Цанева",
    "grade": 10,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенно 2023": 1.0
    },
    "competition_grades": {
      "Есенно 2023": 3.0
    }
  },
  {
    "name": "Никол Николаева Станева",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 2.5
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Александър Тодоров Горанов",
    "grade": 10,
    "school": "СУ \"Иван Вазов\"",
    "city": "Вършец",
    "competitions": {
      "Пролетно 2022": 2.0
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Деница Венциславова Стефанова",
    "grade": 10,
    "school": "5 ОУ \"Иван Вазов\"",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 1.0
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Никола Маринов Хубенов",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 0.5
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Николай Светославов Стратиев",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 0.5
    },
    "competition_grades": {
      "Пролетно 2022": 1.0
    }
  },
  {
    "name": "Калоян Антонов Тодоров",
    "grade": 11,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Олимпиада 2025": 77.25,
      "Пролетно 2025": 25.4,
      "Есенно 2024": 20.0,
      "Олимпиада 2024": 47.0,
      "Пролетно 2024": 11.3,
      "Есенно 2023": 21.5,
      "Олимпиада 2023": 47.0,
      "Пролетно 2023": 9.0,
      "Есенно 2022": 25.0,
      "Олимпиада 2022": 13.5,
      "Пролетно 2022": 29.0,
      "2 кръг 2022": 30.0,
      "Пролетно 2021": 20.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетно 2024": 7.0,
      "Есенно 2023": 7.0,
      "Олимпиада 2023": 5.0,
      "Пролетно 2023": 7.0,
      "Есенно 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетно 2022": 2.0,
      "2 кръг 2022": 2.0,
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Христо Атанасов Христов",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 75.85,
      "Пролетно 2025": 29.6,
      "Есенно 2024": 26.5,
      "Олимпиада 2024": 28.5,
      "Пролетно 2024": 28.25,
      "Есенно 2023": 16.0,
      "Олимпиада 2023": 13.0,
      "Пролетно 2023": 30.0,
      "Есенно 2022": 26.5,
      "Олимпиада 2022": 12.0,
      "Пролетно 2022": 23.5,
      "2 кръг 2022": 27.5,
      "Олимпиада 2021": 22.5,
      "2 кръг 2021": 25.5
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Олимпиада 2024": 4.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетно 2022": 2.0,
      "2 кръг 2022": 2.0,
      "Олимпиада 2021": 1.0,
      "2 кръг 2021": 1.0
    }
  },
  {
    "name": "Александър Николаев Николов",
    "grade": 11,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 81.05,
      "Пролетно 2025": 21.9,
      "Есенно 2024": 21.0,
      "Олимпиада 2024": 27.5,
      "Пролетно 2024": 3.8,
      "Есенно 2023": 30.0,
      "Пролетно 2023": 28.5,
      "Есенно 2022": 26.5,
      "Олимпиада 2022": 14.5,
      "2 кръг 2022": 30.0,
      "Олимпиада 2021": 27.0,
      "2 кръг 2021": 28.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Олимпиада 2024": 4.0,
      "Пролетно 2024": 7.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "2 кръг 2022": 2.0,
      "Олимпиада 2021": 1.0,
      "2 кръг 2021": 1.0
    }
  },
  {
    "name": "Никола Нинков Нинков",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 61.3,
      "Пролетно 2025": 26.0,
      "Есенно 2024": 22.25,
      "Олимпиада 2024": 22.5,
      "Пролетно 2024": 28.0,
      "Есенно 2023": 12.5,
      "Олимпиада 2023": 25.5,
      "Пролетно 2023": 29.0,
      "Пролетно 2022": 26.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Олимпиада 2024": 4.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетно 2023": 3.0,
      "Пролетно 2022": 2.0
    }
  },
  {
    "name": "Михаил Георгиев Гочев",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 63.0,
      "Пролетно 2025": 14.2,
      "Есенно 2024": 12.5,
      "Олимпиада 2024": 14.0,
      "Пролетно 2024": 25.5,
      "Есенно 2023": 22.0,
      "Пролетно 2023": 29.0,
      "Есенно 2022": 18.0,
      "Олимпиада 2022": 6.0,
      "Пролетно 2022": 18.0,
      "2 кръг 2022": 27.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетно 2022": 2.0,
      "2 кръг 2022": 2.0
    }
  },
  {
    "name": "Атанас Георгиев Гочев",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 64.15,
      "Пролетно 2025": 7.6,
      "Есенно 2024": 13.0,
      "Олимпиада 2024": 16.25,
      "Пролетно 2024": 26.0,
      "Есенно 2023": 27.25,
      "Пролетно 2023": 28.75,
      "Есенно 2022": 21.0,
      "Олимпиада 2022": 10.0,
      "Пролетно 2022": 19.0,
      "2 кръг 2022": 28.5
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетно 2022": 2.0,
      "2 кръг 2022": 2.0
    }
  },
  {
    "name": "Петър Мирчев Попов",
    "grade": 11,
    "school": "ПМГ \"Яне Сандански\"",
    "city": "Гоце Делчев",
    "competitions": {
      "Олимпиада 2025": 72.85,
      "Пролетно 2025": 4.0,
      "Есенно 2024": 10.0,
      "Олимпиада 2024": 29.5,
      "Есенно 2023": 11.0,
      "Пролетно 2023": 26.5,
      "Пролетно 2022": 20.0,
      "Пролетно 2021": 21.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Олимпиада 2024": 4.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Пролетно 2022": 2.0,
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Крум Крумов Стоименов",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 56.9,
      "Пролетно 2025": 11.0,
      "Есенно 2024": 10.0,
      "Пролетно 2024": 18.5,
      "Есенно 2023": 10.25,
      "Олимпиада 2023": 6.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Олимпиада 2023": 3.0
    }
  },
  {
    "name": "Димитър Емилов Бегов",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 12.3,
      "Пролетно 2025": 19.5,
      "Есенно 2024": 17.5,
      "Олимпиада 2024": 21.5,
      "Пролетно 2024": 29.5,
      "Есенно 2023": 16.0,
      "Олимпиада 2023": 27.0,
      "Пролетно 2023": 29.25,
      "Есенно 2022": 30.0,
      "Олимпиада 2022": 16.0,
      "Пролетно 2022": 30.0,
      "2 кръг 2022": 30.0,
      "Олимпиада 2021": 26.0,
      "Пролетно 2021": 30.0,
      "2 кръг 2021": 26.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Олимпиада 2024": 4.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетно 2022": 2.0,
      "2 кръг 2022": 2.0,
      "Олимпиада 2021": 1.0,
      "Пролетно 2021": 1.0,
      "2 кръг 2021": 1.0
    }
  },
  {
    "name": "Марио Величков Борилов",
    "grade": 11,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Олимпиада 2025": 25.3,
      "Пролетно 2025": 20.5,
      "Есенно 2024": 18.0,
      "Пролетно 2024": 26.5,
      "Есенно 2023": 11.0,
      "Пролетно 2023": 21.5
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0
    }
  },
  {
    "name": "Дамян Калинов Петров",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 28.05,
      "Пролетно 2025": 2.0,
      "Есенно 2024": 4.0,
      "Олимпиада 2024": 26.5,
      "Пролетно 2024": 28.75,
      "Есенно 2023": 10.0,
      "Пролетно 2023": 28.0,
      "Есенно 2022": 17.0,
      "Олимпиада 2022": 1.0,
      "Пролетно 2022": 25.5,
      "2 кръг 2022": 27.0,
      "Пролетно 2021": 11.5
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Олимпиада 2024": 4.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетно 2022": 2.0,
      "2 кръг 2022": 2.0,
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Николай Христов Хранов",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 18.0,
      "Есенно 2024": 19.5,
      "Олимпиада 2024": 23.5,
      "Пролетно 2024": 20.5,
      "Есенно 2023": 23.0,
      "Олимпиада 2023": 21.0,
      "Пролетно 2023": 20.0,
      "Есенно 2022": 25.5,
      "Олимпиада 2022": 10.0,
      "Пролетно 2022": 25.0,
      "2 кръг 2022": 26.5,
      "Пролетно 2021": 27.0
    },
    "competition_grades": {
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Олимпиада 2024": 4.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетно 2022": 2.0,
      "2 кръг 2022": 2.0,
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Михаела Деянова Колева",
    "grade": 11,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2025": 14.0,
      "Пролетно 2025": 13.4,
      "Есенно 2024": 4.0,
      "Олимпиада 2024": 28.0,
      "Пролетно 2024": 21.5,
      "Есенно 2023": 15.0,
      "Олимпиада 2023": 18.0,
      "Пролетно 2023": 28.75,
      "Есенно 2022": 29.5
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Олимпиада 2024": 4.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Васил Ангелов Цикалов",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 14.0,
      "Есенно 2024": 13.5,
      "Олимпиада 2024": 29.0,
      "Пролетно 2024": 28.0,
      "Есенно 2023": 17.0,
      "Олимпиада 2023": 15.5,
      "Пролетно 2023": 28.0,
      "Есенно 2022": 28.5,
      "Олимпиада 2022": 0.0,
      "Пролетно 2022": 20.0,
      "2 кръг 2022": 30.0
    },
    "competition_grades": {
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Олимпиада 2024": 4.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетно 2022": 2.0,
      "2 кръг 2022": 2.0
    }
  },
  {
    "name": "Богдан Добромиров Георгиев",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 22.5,
      "Есенно 2024": 12.5,
      "Олимпиада 2024": 26.0,
      "Пролетно 2024": 28.0,
      "Олимпиада 2023": 9.0,
      "Пролетно 2021": 28.5
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Олимпиада 2024": 4.0,
      "Пролетно 2024": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Валентин Николаев Филипов",
    "grade": 11,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Олимпиада 2025": 9.75,
      "Пролетно 2025": 10.5,
      "Есенно 2024": 10.25,
      "Олимпиада 2024": 27.5,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 26.0,
      "Есенно 2022": 26.0,
      "Олимпиада 2021": 23.0,
      "2 кръг 2021": 20.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Олимпиада 2024": 4.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0,
      "Олимпиада 2021": 1.0,
      "2 кръг 2021": 1.0
    }
  },
  {
    "name": "Пламен Тодоров Тодоров",
    "grade": 11,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2025": 17.0,
      "Есенно 2024": 17.25,
      "Олимпиада 2024": 25.0,
      "Олимпиада 2023": 16.5,
      "Есенно 2022": 21.5
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Есенно 2024": 5.0,
      "Олимпиада 2024": 4.0,
      "Олимпиада 2023": 3.0,
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Калоян Тодоров Стефанов",
    "grade": 11,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 14.5,
      "Есенно 2024": 15.0,
      "Олимпиада 2024": 21.5,
      "Пролетно 2024": 28.5,
      "Есенно 2023": 17.5
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Олимпиада 2024": 4.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0
    }
  },
  {
    "name": "Владимира Владимирова Георгиева",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 21.5,
      "Есенно 2024": 11.5,
      "Олимпиада 2024": 24.0,
      "Пролетно 2024": 26.0
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Олимпиада 2024": 4.0,
      "Пролетно 2024": 4.0
    }
  },
  {
    "name": "Александър Росенов Ненов",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 18.0,
      "Есенно 2024": 6.0,
      "Пролетно 2024": 28.5,
      "Есенно 2023": 14.5,
      "Олимпиада 2023": 21.5,
      "Пролетно 2023": 25.0,
      "Есенно 2022": 21.5,
      "Пролетно 2022": 25.0
    },
    "competition_grades": {
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0,
      "Пролетно 2022": 2.0
    }
  },
  {
    "name": "Калоян Иванов Иванов",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 11.7,
      "Пролетно 2025": 13.0,
      "Есенно 2024": 17.0,
      "Пролетно 2024": 13.0,
      "Есенно 2023": 5.0,
      "Пролетно 2023": 19.0,
      "Есенно 2022": 9.5
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Максим Александър Дерижан",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 13.5,
      "Пролетно 2025": 8.0,
      "Есенно 2024": 7.75,
      "Пролетно 2024": 25.5,
      "Есенно 2023": 17.75,
      "Есенно 2022": 6.5,
      "Олимпиада 2022": 11.0,
      "Пролетно 2022": 17.5,
      "2 кръг 2022": 27.5
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Есенно 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетно 2022": 2.0,
      "2 кръг 2022": 2.0
    }
  },
  {
    "name": "Константин Константинов Стойчев",
    "grade": 11,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 17.0,
      "Есенно 2024": 11.5,
      "Олимпиада 2024": 17.0,
      "Пролетно 2024": 20.0,
      "Есенно 2023": 15.5,
      "Есенно 2022": 20.0,
      "Олимпиада 2021": 20.0,
      "2 кръг 2021": 23.5
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Олимпиада 2024": 4.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Есенно 2022": 3.0,
      "Олимпиада 2021": 1.0,
      "2 кръг 2021": 1.0
    }
  },
  {
    "name": "Стефан Ивов Радославов",
    "grade": 11,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 8.0,
      "Пролетно 2025": 10.5,
      "Есенно 2024": 4.0,
      "Пролетно 2024": 18.5,
      "Есенно 2023": 18.75,
      "Олимпиада 2023": 22.5,
      "Пролетно 2023": 28.0,
      "Есенно 2022": 24.0,
      "Пролетно 2022": 14.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 5.0,
      "Есенно 2024": 7.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0,
      "Пролетно 2022": 2.0
    }
  },
  {
    "name": "Боян Иванов Иванов",
    "grade": 11,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетно 2025": 25.0,
      "Есенно 2024": 12.5,
      "Пролетно 2024": 23.0,
      "Пролетно 2023": 16.0
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Пролетно 2024": 4.0,
      "Пролетно 2023": 3.0
    }
  },
  {
    "name": "Здравко Светлозаров Николов",
    "grade": 11,
    "school": "ППМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Олимпиада 2025": 14.5,
      "Пролетно 2025": 16.0,
      "Есенно 2024": 10.75,
      "Есенно 2023": 8.5
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Есенно 2023": 4.0
    }
  },
  {
    "name": "Пресиян Петров Петров",
    "grade": 11,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2025": 8.0,
      "Есенно 2024": 12.5,
      "Олимпиада 2024": 27.5,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 25.0,
      "Есенно 2022": 20.5,
      "Олимпиада 2022": 8.0,
      "Пролетно 2022": 14.0,
      "2 кръг 2022": 29.5
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Олимпиада 2024": 4.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетно 2022": 2.0,
      "2 кръг 2022": 2.0
    }
  },
  {
    "name": "Георги Кирилов Момчилов",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 14.0,
      "Есенно 2024": 12.0,
      "Пролетно 2024": 22.0,
      "Есенно 2023": 9.0,
      "Пролетно 2023": 27.0,
      "Пролетно 2022": 25.0,
      "Пролетно 2021": 17.0
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Пролетно 2022": 2.0,
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Атанас Руменов Василев",
    "grade": 11,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Олимпиада 2025": 4.35,
      "Пролетно 2025": 9.0,
      "Есенно 2024": 10.0,
      "Пролетно 2024": 16.0,
      "Есенно 2023": 12.5,
      "Пролетно 2023": 26.0,
      "Есенно 2022": 20.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Теодор Спасов Златанов",
    "grade": 11,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетно 2025": 16.5,
      "Есенно 2024": 9.5,
      "Пролетно 2024": 26.5,
      "Пролетно 2023": 28.5
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Пролетно 2024": 4.0,
      "Пролетно 2023": 3.0
    }
  },
  {
    "name": "Игнат Валери Матеев",
    "grade": 11,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2025": 16.0,
      "Есенно 2024": 9.0,
      "Пролетно 2024": 15.0,
      "Есенно 2023": 7.5,
      "Пролетно 2023": 19.0,
      "Есенно 2022": 11.0
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Адел Бохос Карагьозян",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 10.5,
      "Есенно 2024": 16.5,
      "Пролетно 2024": 11.0,
      "Есенно 2023": 11.25,
      "Пролетно 2023": 19.0
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0
    }
  },
  {
    "name": "Калоян Тодоров Върбанов",
    "grade": 11,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2025": 14.5,
      "Есенно 2024": 14.25,
      "Есенно 2023": 7.0,
      "Пролетно 2023": 21.5,
      "Есенно 2022": 18.0
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Кристиян Йорданов Вълков",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 17.5,
      "Есенно 2024": 11.5,
      "Есенно 2022": 25.0,
      "Пролетно 2022": 20.0
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Есенно 2022": 3.0,
      "Пролетно 2022": 2.0
    }
  },
  {
    "name": "Валентин Чавдарев Христев",
    "grade": 11,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетно 2025": 15.0,
      "Есенно 2024": 8.0,
      "Пролетно 2024": 16.5,
      "Есенно 2023": 7.5
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0
    }
  },
  {
    "name": "Виктория Янкова Тумбева",
    "grade": 11,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 6.25,
      "Пролетно 2024": 23.5,
      "Есенно 2023": 10.5,
      "Пролетно 2023": 18.5,
      "Есенно 2022": 19.0
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Преслав Митков Тошев",
    "grade": 11,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2025": 9.5,
      "Есенно 2024": 11.5,
      "Есенно 2023": 9.0,
      "Пролетно 2023": 26.0,
      "Есенно 2022": 20.5
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Михаела Цанкова Карацанова",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 6.5,
      "Есенно 2024": 8.5,
      "Олимпиада 2024": 12.0,
      "Есенно 2023": 6.0,
      "Пролетно 2023": 20.0,
      "Пролетно 2022": 23.5
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Олимпиада 2024": 4.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Пролетно 2022": 2.0
    }
  },
  {
    "name": "Диляна Иванова Тодорова",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенно 2024": 17.0,
      "Олимпиада 2024": 24.5
    },
    "competition_grades": {
      "Есенно 2024": 5.0,
      "Олимпиада 2024": 4.0
    }
  },
  {
    "name": "Константин Ивайлов Божков",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 6.0,
      "Есенно 2024": 7.25,
      "Пролетно 2024": 23.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 13.5,
      "Есенно 2022": 8.5
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Мартин Петров Андреев",
    "grade": 11,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Олимпиада 2024": 28.0,
      "Олимпиада 2023": 15.5,
      "Пролетно 2023": 20.0,
      "Есенно 2022": 20.5
    },
    "competition_grades": {
      "Олимпиада 2024": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Атанас Мирославов Митрев",
    "grade": 11,
    "school": "ЕГ \"Хр. Ботев\"",
    "city": "Кърджали",
    "competitions": {
      "Пролетно 2025": 3.8,
      "Есенно 2024": 5.5,
      "Пролетно 2024": 29.0,
      "Есенно 2023": 12.5
    },
    "competition_grades": {
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0
    }
  },
  {
    "name": "Диана Найденова Начева",
    "grade": 11,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 11.0,
      "Пролетно 2024": 13.0,
      "Есенно 2023": 6.0,
      "Пролетно 2023": 8.0,
      "Есенно 2022": 10.5
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "София Николаева",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 8.0,
      "Есенно 2024": 9.25,
      "Пролетно 2024": 12.5,
      "Есенно 2023": 10.0
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0
    }
  },
  {
    "name": "Виктор Калинов Мончев",
    "grade": 11,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетно 2025": 9.0,
      "Есенно 2024": 9.0,
      "Пролетно 2024": 15.5,
      "Есенно 2023": 3.0
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0
    }
  },
  {
    "name": "Елена Даринова Йорданова",
    "grade": 11,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2024": 28.25,
      "Есенно 2023": 7.5,
      "Пролетно 2023": 29.5,
      "Есенно 2022": 23.5
    },
    "competition_grades": {
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Аркадий Николаевич Каленников",
    "grade": 11,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Пролетно 2025": 12.0,
      "Есенно 2024": 14.0
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0
    }
  },
  {
    "name": "Борислав Митков Димитров",
    "grade": 11,
    "school": "ЕГ \"Хр. Ботев\"",
    "city": "Кърджали",
    "competitions": {
      "Олимпиада 2024": 25.0,
      "Пролетно 2024": 11.5,
      "Есенно 2023": 6.5
    },
    "competition_grades": {
      "Олимпиада 2024": 4.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0
    }
  },
  {
    "name": "Боряна Димитрова Манолова",
    "grade": 11,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенно 2024": 9.5,
      "Пролетно 2024": 17.0,
      "Есенно 2023": 6.0,
      "Пролетно 2023": 15.5,
      "Есенно 2022": 10.5
    },
    "competition_grades": {
      "Есенно 2024": 5.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Филип Чавдаров Сербезов",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 14.5,
      "Олимпиада 2021": 11.0,
      "2 кръг 2021": 20.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Олимпиада 2021": 1.0,
      "2 кръг 2021": 1.0
    }
  },
  {
    "name": "Сара Красимирова Илиева",
    "grade": 11,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2024": 11.0,
      "Олимпиада 2023": 12.0,
      "Пролетно 2023": 28.0,
      "Есенно 2022": 26.5,
      "Пролетно 2022": 24.0,
      "Олимпиада 2021": 24.5,
      "2 кръг 2021": 24.0
    },
    "competition_grades": {
      "Пролетно 2024": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0,
      "Пролетно 2022": 2.0,
      "Олимпиада 2021": 1.0,
      "2 кръг 2021": 1.0
    }
  },
  {
    "name": "Ралица Мартинова Тончева",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2024": 26.0,
      "Есенно 2023": 7.0,
      "Есенно 2022": 24.0,
      "Пролетно 2022": 26.0
    },
    "competition_grades": {
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Есенно 2022": 3.0,
      "Пролетно 2022": 2.0
    }
  },
  {
    "name": "Октавиан Недков Вацов",
    "grade": 11,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 13.0,
      "Есенно 2024": 7.0
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0
    }
  },
  {
    "name": "Александър Руменов Желязков",
    "grade": 11,
    "school": "Трета ПМГ",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 6.0,
      "Есенно 2024": 9.0,
      "Пролетно 2024": 13.0
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Пролетно 2024": 4.0
    }
  },
  {
    "name": "Александра Петрова Касърова",
    "grade": 11,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенно 2024": 6.75,
      "Пролетно 2024": 13.0,
      "Пролетно 2023": 21.0,
      "Есенно 2022": 21.5,
      "Пролетно 2021": 20.5
    },
    "competition_grades": {
      "Есенно 2024": 5.0,
      "Пролетно 2024": 4.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0,
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Ема Ясенова Станкова",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 4.5,
      "Есенно 2024": 5.5,
      "Пролетно 2024": 11.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 16.5
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0,
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0
    }
  },
  {
    "name": "Борис Иванов Джурков",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенно 2023": 9.0,
      "Олимпиада 2023": 23.5,
      "Пролетно 2023": 18.0,
      "Есенно 2022": 19.5,
      "Пролетно 2022": 29.5,
      "Пролетно 2021": 29.0
    },
    "competition_grades": {
      "Есенно 2023": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0,
      "Пролетно 2022": 2.0,
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Константин Красимиров Буджански",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 12.8
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0
    }
  },
  {
    "name": "Данаил Адрианов Ангелов",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 5.75,
      "Есенно 2024": 11.5
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Есенно 2024": 5.0
    }
  },
  {
    "name": "Иван Севдалинов Димитров",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 7.0,
      "Есенно 2024": 12.25
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2024": 5.0
    }
  },
  {
    "name": "Йоан Климентов Кирилов",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенно 2024": 9.0,
      "Есенно 2023": 8.5,
      "Пролетно 2023": 9.0,
      "Есенно 2022": 20.5,
      "Олимпиада 2022": 4.5,
      "2 кръг 2022": 26.5
    },
    "competition_grades": {
      "Есенно 2024": 5.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "2 кръг 2022": 2.0
    }
  },
  {
    "name": "Венцислав Атанасов Мавродиев",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 11.5,
      "Пролетно 2024": 8.0
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Пролетно 2024": 4.0
    }
  },
  {
    "name": "Константин Георгиев Нешков",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2024": 18.0,
      "Пролетно 2023": 19.0,
      "Есенно 2022": 12.0,
      "Пролетно 2022": 22.0
    },
    "competition_grades": {
      "Пролетно 2024": 4.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0,
      "Пролетно 2022": 2.0
    }
  },
  {
    "name": "Никола Ангелов Цикалов",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 12.0,
      "Олимпиада 2023": 5.5,
      "Пролетно 2022": 7.0
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Олимпиада 2023": 3.0,
      "Пролетно 2022": 2.0
    }
  },
  {
    "name": "Сияна Любомирова Павлова",
    "grade": 11,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2023": 24.0,
      "Есенно 2022": 28.0,
      "Олимпиада 2022": 7.0,
      "Пролетно 2022": 14.5,
      "2 кръг 2022": 30.0,
      "Олимпиада 2021": 22.0,
      "2 кръг 2021": 26.5
    },
    "competition_grades": {
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетно 2022": 2.0,
      "2 кръг 2022": 2.0,
      "Олимпиада 2021": 1.0,
      "2 кръг 2021": 1.0
    }
  },
  {
    "name": "Петър Петров Вълков",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенно 2024": 8.75,
      "Пролетно 2023": 14.0,
      "Есенно 2022": 24.5
    },
    "competition_grades": {
      "Есенно 2024": 5.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "София Радославова Илчева",
    "grade": 11,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 6.0,
      "Есенно 2023": 6.5,
      "Пролетно 2023": 13.5,
      "Есенно 2022": 11.0
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Денислава Дойчинова Бонджева",
    "grade": 11,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2024": 12.0,
      "Есенно 2023": 8.25,
      "Пролетно 2023": 22.0
    },
    "competition_grades": {
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0
    }
  },
  {
    "name": "Валентин Найденов Митев",
    "grade": 11,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенно 2023": 5.5,
      "Пролетно 2023": 26.0,
      "Есенно 2022": 27.0,
      "Пролетно 2021": 18.0
    },
    "competition_grades": {
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0,
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Любомир Валерий Швецов",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 7.6
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0
    }
  },
  {
    "name": "Ерик Ивайлов Иванов",
    "grade": 11,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 10.0
    },
    "competition_grades": {
      "Пролетно 2025": 5.0
    }
  },
  {
    "name": "Тимур Севал Ахмед",
    "grade": 11,
    "school": "ПМГ \"Акад. Боян Петканчин\"",
    "city": "Хасково",
    "competitions": {
      "Есенно 2024": 12.5
    },
    "competition_grades": {
      "Есенно 2024": 5.0
    }
  },
  {
    "name": "Нермин Хюсмен Идириз",
    "grade": 11,
    "school": "ППМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Пролетно 2025": 6.5,
      "Есенно 2023": 8.0
    },
    "competition_grades": {
      "Пролетно 2025": 5.0,
      "Есенно 2023": 4.0
    }
  },
  {
    "name": "Анастасия Артьомова Горская",
    "grade": 11,
    "school": "ПГКПИ",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2024": 13.0,
      "Есенно 2023": 8.0
    },
    "competition_grades": {
      "Пролетно 2024": 4.0,
      "Есенно 2023": 4.0
    }
  },
  {
    "name": "Светослав Станиславов Пенков",
    "grade": 11,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Есенно 2023": 3.0,
      "Пролетно 2023": 16.5,
      "Есенно 2022": 22.0,
      "Пролетно 2021": 23.5
    },
    "competition_grades": {
      "Есенно 2023": 4.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0,
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Петко Свиленов Петков",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенно 2024": 6.0,
      "Есенно 2023": 9.0
    },
    "competition_grades": {
      "Есенно 2024": 5.0,
      "Есенно 2023": 4.0
    }
  },
  {
    "name": "Георги Ставрев Николов",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 7.0,
      "Олимпиада 2022": 4.0,
      "Пролетно 2022": 13.5,
      "2 кръг 2022": 28.5
    },
    "competition_grades": {
      "Олимпиада 2023": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетно 2022": 2.0,
      "2 кръг 2022": 2.0
    }
  },
  {
    "name": "Николай Илиянов Цачев",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенно 2024": 5.0
    },
    "competition_grades": {
      "Есенно 2024": 5.0
    }
  },
  {
    "name": "Алекс Стефанов Чолаков",
    "grade": 11,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Есенно 2022": 27.0
    },
    "competition_grades": {
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Ивайло Борисов Василев",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 22.0,
      "Олимпиада 2021": 14.5,
      "Пролетно 2021": 26.0,
      "2 кръг 2021": 21.5
    },
    "competition_grades": {
      "Пролетно 2022": 2.0,
      "Олимпиада 2021": 1.0,
      "Пролетно 2021": 1.0,
      "2 кръг 2021": 1.0
    }
  },
  {
    "name": "Иво Дойнов Янев",
    "grade": 11,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенно 2022": 14.0,
      "Пролетно 2022": 14.5,
      "Пролетно 2021": 18.5
    },
    "competition_grades": {
      "Есенно 2022": 3.0,
      "Пролетно 2022": 2.0,
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Боян Велизаров Руженов",
    "grade": 11,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенно 2022": 24.0
    },
    "competition_grades": {
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Калин Ивелинов Иванов",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2023": 18.0
    },
    "competition_grades": {
      "Пролетно 2023": 3.0
    }
  },
  {
    "name": "Христо Йорданов Коев",
    "grade": 11,
    "school": "ПМГ\"Атанас Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Пролетно 2024": 7.5
    },
    "competition_grades": {
      "Пролетно 2024": 4.0
    }
  },
  {
    "name": "Лиа Красимирова Боянова",
    "grade": 11,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2023": 17.5
    },
    "competition_grades": {
      "Пролетно 2023": 3.0
    }
  },
  {
    "name": "Денис Росенов Карабашев",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 1.0,
      "Пролетно 2022": 19.0,
      "2 кръг 2022": 27.0
    },
    "competition_grades": {
      "Олимпиада 2022": 2.0,
      "Пролетно 2022": 2.0,
      "2 кръг 2022": 2.0
    }
  },
  {
    "name": "Себастиян Стоянов Киров",
    "grade": 11,
    "school": "ПГМЕЕ",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2024": 7.0
    },
    "competition_grades": {
      "Пролетно 2024": 4.0
    }
  },
  {
    "name": "Калина Радостинова Железчева",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 28.0,
      "Пролетно 2021": 26.5
    },
    "competition_grades": {
      "Пролетно 2022": 2.0,
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Никола Бенчев Бенчев",
    "grade": 11,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенно 2022": 17.0,
      "Пролетно 2021": 20.0
    },
    "competition_grades": {
      "Есенно 2022": 3.0,
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Захариева София Николаева",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2023": 16.0
    },
    "competition_grades": {
      "Пролетно 2023": 3.0
    }
  },
  {
    "name": "Денис Николаев Сираков",
    "grade": 11,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Есенно 2022": 20.0
    },
    "competition_grades": {
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Виктор Красимиров Аврамски",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 14.5,
      "2 кръг 2022": 27.0
    },
    "competition_grades": {
      "Пролетно 2022": 2.0,
      "2 кръг 2022": 2.0
    }
  },
  {
    "name": "Жанета Димитрова Калева",
    "grade": 11,
    "school": "ПМГ \"Ат. Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Пролетно 2024": 3.0,
      "Есенно 2022": 9.5
    },
    "competition_grades": {
      "Пролетно 2024": 4.0,
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Тервел Добринов Енчев",
    "grade": 11,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенно 2023": 7.75
    },
    "competition_grades": {
      "Есенно 2023": 4.0
    }
  },
  {
    "name": "Христо Младенов Младенов",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 8.0,
      "2 кръг 2022": 28.5
    },
    "competition_grades": {
      "Олимпиада 2022": 2.0,
      "2 кръг 2022": 2.0
    }
  },
  {
    "name": "Теодора Светломирова Желязкова",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенно 2022": 18.0
    },
    "competition_grades": {
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Димана Мирославова Праматарова",
    "grade": 11,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Олимпиада 2023": 10.0
    },
    "competition_grades": {
      "Олимпиада 2023": 3.0
    }
  },
  {
    "name": "Николай Емилов Рогов",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 7.5,
      "2 кръг 2022": 28.0
    },
    "competition_grades": {
      "Олимпиада 2022": 2.0,
      "2 кръг 2022": 2.0
    }
  },
  {
    "name": "Алекс Петров Матеев",
    "grade": 11,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетно 2024": 5.5
    },
    "competition_grades": {
      "Пролетно 2024": 4.0
    }
  },
  {
    "name": "Алмира Ибрахим Емин",
    "grade": 11,
    "school": "ЕГ \"Хр. Ботев\"",
    "city": "Кърджали",
    "competitions": {
      "Пролетно 2024": 5.5
    },
    "competition_grades": {
      "Пролетно 2024": 4.0
    }
  },
  {
    "name": "Виктория Иванова Стоянова",
    "grade": 11,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетно 2023": 5.0,
      "Есенно 2022": 10.5
    },
    "competition_grades": {
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Катерина Бисерова Симеонова",
    "grade": 11,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетно 2023": 11.0,
      "Есенно 2022": 2.0
    },
    "competition_grades": {
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Марина Николаева Кънева",
    "grade": 11,
    "school": "ПМГ \"Ат. Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Пролетно 2024": 3.5,
      "Есенно 2022": 3.5
    },
    "competition_grades": {
      "Пролетно 2024": 4.0,
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Йордан Ивайлов Илиев",
    "grade": 11,
    "school": "ППМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Есенно 2023": 6.0
    },
    "competition_grades": {
      "Есенно 2023": 4.0
    }
  },
  {
    "name": "Георги Стоилов Колевски",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 3.0,
      "2 кръг 2022": 27.5
    },
    "competition_grades": {
      "Олимпиада 2022": 2.0,
      "2 кръг 2022": 2.0
    }
  },
  {
    "name": "Преслава Добринова Добрева",
    "grade": 11,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Есенно 2022": 13.5
    },
    "competition_grades": {
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Стефан Христов Енев",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 23.5
    },
    "competition_grades": {
      "Пролетно 2022": 2.0
    }
  },
  {
    "name": "Селин Сайди Имамова",
    "grade": 11,
    "school": "ПМГ \"Яне Сандански\"",
    "city": "Гоце Делчев",
    "competitions": {
      "Пролетно 2022": 15.0,
      "Пролетно 2021": 16.0
    },
    "competition_grades": {
      "Пролетно 2022": 2.0,
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Симона Николаева Христова",
    "grade": 11,
    "school": "ППМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Есенно 2023": 5.0
    },
    "competition_grades": {
      "Есенно 2023": 4.0
    }
  },
  {
    "name": "Ефе Енвер Мехмедали",
    "grade": 11,
    "school": "ЕГ \"Хр. Ботев\"",
    "city": "Кърджали",
    "competitions": {
      "Пролетно 2024": 3.5
    },
    "competition_grades": {
      "Пролетно 2024": 4.0
    }
  },
  {
    "name": "Михаил Михайлов Бошов",
    "grade": 11,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 19.0,
      "2 кръг 2021": 21.0
    },
    "competition_grades": {
      "Олимпиада 2021": 1.0,
      "2 кръг 2021": 1.0
    }
  },
  {
    "name": "Алекс Александров Андреев",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенно 2022": 9.5
    },
    "competition_grades": {
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Теодора Даниелова Петрова",
    "grade": 11,
    "school": "55 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 18.0,
      "2 кръг 2021": 20.0
    },
    "competition_grades": {
      "Олимпиада 2021": 1.0,
      "2 кръг 2021": 1.0
    }
  },
  {
    "name": "Крум Василев Станев",
    "grade": 11,
    "school": "ПТГ",
    "city": "Габрово",
    "competitions": {
      "Пролетно 2023": 6.5
    },
    "competition_grades": {
      "Пролетно 2023": 3.0
    }
  },
  {
    "name": "Малина Калинова Гладнишка",
    "grade": 11,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетно 2023": 6.5
    },
    "competition_grades": {
      "Пролетно 2023": 3.0
    }
  },
  {
    "name": "Елизабет Славчева Славова",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2022": 15.0
    },
    "competition_grades": {
      "Пролетно 2022": 2.0
    }
  },
  {
    "name": "Велимир Господинов Гочков",
    "grade": 11,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 13.0,
      "2 кръг 2021": 24.0
    },
    "competition_grades": {
      "Олимпиада 2021": 1.0,
      "2 кръг 2021": 1.0
    }
  },
  {
    "name": "Атанас Манолов Ружинов",
    "grade": 11,
    "school": "126 ОУ „П. Ю. Тодоров“",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 12.0,
      "2 кръг 2021": 24.5
    },
    "competition_grades": {
      "Олимпиада 2021": 1.0,
      "2 кръг 2021": 1.0
    }
  },
  {
    "name": "Кристин Спасова Костадинова",
    "grade": 11,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенно 2022": 8.0
    },
    "competition_grades": {
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Мартин Димитров Белчев",
    "grade": 11,
    "school": "ПГКПИ",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2023": 6.0
    },
    "competition_grades": {
      "Пролетно 2023": 3.0
    }
  },
  {
    "name": "Божидара Филипова Пухалева",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 14.0
    },
    "competition_grades": {
      "Пролетно 2022": 2.0
    }
  },
  {
    "name": "Ема Мариянова Великова",
    "grade": 11,
    "school": "ППМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Есенно 2023": 3.0
    },
    "competition_grades": {
      "Есенно 2023": 4.0
    }
  },
  {
    "name": "Румяна Георгиева Лазарова",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенно 2022": 7.0
    },
    "competition_grades": {
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Дара Томова Георгиева",
    "grade": 11,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2023": 4.0,
      "Есенно 2022": 1.0
    },
    "competition_grades": {
      "Пролетно 2023": 3.0,
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Ивайло Стефанов Ламбуров",
    "grade": 11,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Пролетно 2021": 26.0
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Ная Красимирова Юрукова",
    "grade": 11,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетно 2021": 26.0
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Мария Георгиева Николова",
    "grade": 11,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Есенно 2022": 6.0
    },
    "competition_grades": {
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Теоман Мехмед Ахмед",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2021": 25.0
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Николай Цветомиров Цолов",
    "grade": 11,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенно 2023": 2.5
    },
    "competition_grades": {
      "Есенно 2023": 4.0
    }
  },
  {
    "name": "Георги Здравков Примов",
    "grade": 11,
    "school": "ОМГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2022": 10.5
    },
    "competition_grades": {
      "Пролетно 2022": 2.0
    }
  },
  {
    "name": "Мартин Антонов Дойчев",
    "grade": 11,
    "school": "ПМГ \"Ат. Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Есенно 2022": 5.5
    },
    "competition_grades": {
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Стоян Иванов Дражев",
    "grade": 11,
    "school": "ПМГ \"Ат. Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Есенно 2022": 5.5
    },
    "competition_grades": {
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Рая Красимирова Савова",
    "grade": 11,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2022": 3.0,
      "Пролетно 2021": 15.5
    },
    "competition_grades": {
      "Пролетно 2022": 2.0,
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Никола Христов Дойнов",
    "grade": 11,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетно 2021": 22.5
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Ивайла Ивайлова Илиева",
    "grade": 11,
    "school": "ПТГ",
    "city": "Габрово",
    "competitions": {
      "Пролетно 2023": 4.0
    },
    "competition_grades": {
      "Пролетно 2023": 3.0
    }
  },
  {
    "name": "Лора Николаева Апостолова",
    "grade": 11,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетно 2021": 21.5
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Атанас Мариянов Найденов",
    "grade": 11,
    "school": "134 ОУ \"Димчо Дебелянов\"",
    "city": "София",
    "competitions": {
      "Пролетно 2021": 20.0
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Ивайла Драгомирова Радева",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2024": 1.5
    },
    "competition_grades": {
      "Пролетно 2024": 4.0
    }
  },
  {
    "name": "Траян Парушев Василев",
    "grade": 11,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетно 2023": 3.5
    },
    "competition_grades": {
      "Пролетно 2023": 3.0
    }
  },
  {
    "name": "Андон Димитров Такев",
    "grade": 11,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Есенно 2022": 4.5
    },
    "competition_grades": {
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Алексанър Любомиров Малчев",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 7.0
    },
    "competition_grades": {
      "Пролетно 2022": 2.0
    }
  },
  {
    "name": "Андреа Людмилова Неделчева",
    "grade": 11,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетно 2021": 15.5
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Мартин Матеев Панчаревски",
    "grade": 11,
    "school": "107 ОУ \"Хан Крум\"",
    "city": "София",
    "competitions": {
      "Пролетно 2021": 15.5
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Кая Христова Колева",
    "grade": 11,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "2 кръг 2021": 20.0
    },
    "competition_grades": {
      "2 кръг 2021": 1.0
    }
  },
  {
    "name": "Християн Любомиров Божинов",
    "grade": 11,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Есенно 2022": 3.5
    },
    "competition_grades": {
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Йордан Йорданов Митев",
    "grade": 11,
    "school": "ПГМЕЕ",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2024": 1.0
    },
    "competition_grades": {
      "Пролетно 2024": 4.0
    }
  },
  {
    "name": "Роман  Мартинов",
    "grade": 11,
    "school": "ПГМЕЕ",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2024": 1.0
    },
    "competition_grades": {
      "Пролетно 2024": 4.0
    }
  },
  {
    "name": "Абдула Абдула Кичуков",
    "grade": 11,
    "school": "ПМГ \"Яне Сандански\"",
    "city": "Гоце Делчев",
    "competitions": {
      "Пролетно 2021": 13.0
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Давид Стефанов Рекинов",
    "grade": 11,
    "school": "134 ОУ \"Димчо Дебелянов\"",
    "city": "София",
    "competitions": {
      "Пролетно 2021": 13.0
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Николай Николаев Тонков",
    "grade": 11,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетно 2021": 13.0
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Божидара Георгиева Амуджиева",
    "grade": 11,
    "school": "ПМГ \"Ат. Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Есенно 2022": 3.0
    },
    "competition_grades": {
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Калина Тихомирова Трифонова",
    "grade": 11,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенно 2022": 3.0
    },
    "competition_grades": {
      "Есенно 2022": 3.0
    }
  },
  {
    "name": "Виктория Момчилова Георгиева",
    "grade": 11,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетно 2021": 12.5
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Деян Красимиров Минев",
    "grade": 11,
    "school": "ППМГ \":Акад.проф.д-р Асен Златаров”",
    "city": "Ботевград",
    "competitions": {
      "Есенно 2023": 1.25
    },
    "competition_grades": {
      "Есенно 2023": 4.0
    }
  },
  {
    "name": "Момчил Момчилов Пенев",
    "grade": 11,
    "school": "ППМГ \":Акад.проф.д-р Асен Златаров”",
    "city": "Ботевград",
    "competitions": {
      "Есенно 2023": 1.0
    },
    "competition_grades": {
      "Есенно 2023": 4.0
    }
  },
  {
    "name": "Тома Марио Давидов",
    "grade": 11,
    "school": "ППМГ \":Акад.проф.д-р Асен Златаров”",
    "city": "Ботевград",
    "competitions": {
      "Есенно 2023": 1.0
    },
    "competition_grades": {
      "Есенно 2023": 4.0
    }
  },
  {
    "name": "Борис Иванов Георгиев",
    "grade": 11,
    "school": "21 СУ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Пролетно 2021": 9.0
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Илиан Ивайлов Илиев",
    "grade": 11,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетно 2021": 9.0
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Раян Иванов Иванов",
    "grade": 11,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетно 2021": 9.0
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Крум Красимиров Митев",
    "grade": 11,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетно 2021": 8.5
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Анна Красен Александрова",
    "grade": 11,
    "school": "ПТГ",
    "city": "Габрово",
    "competitions": {
      "Пролетно 2023": 1.5
    },
    "competition_grades": {
      "Пролетно 2023": 3.0
    }
  },
  {
    "name": "Ива Светославова Цветкова",
    "grade": 11,
    "school": "ОУ \"Димитър Талев\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2021": 7.5
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Мартин Евгениев Аронов",
    "grade": 11,
    "school": "134 ОУ \"Димчо Дебелянов\"",
    "city": "София",
    "competitions": {
      "Пролетно 2021": 7.5
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Павел Асенов Жилков",
    "grade": 11,
    "school": "ППМГ \"Васил Левски\"",
    "city": "Смолян",
    "competitions": {
      "Пролетно 2021": 7.5
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Стамен Николов Дамянов",
    "grade": 11,
    "school": "21 СУ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Пролетно 2021": 7.5
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Венцислав Красимиров Марев",
    "grade": 11,
    "school": "ОУ \"Димитър Талев\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2021": 7.0
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Даниел Пламенов Янчев",
    "grade": 11,
    "school": "21 СУ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Пролетно 2021": 6.0
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Калоян Божидаров Кожухаров",
    "grade": 11,
    "school": "ПМГ",
    "city": "Перник",
    "competitions": {
      "Пролетно 2023": 1.0
    },
    "competition_grades": {
      "Пролетно 2023": 3.0
    }
  },
  {
    "name": "Борислава Асенова Хаджиева",
    "grade": 11,
    "school": "ОУ \"Димитър Талев\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2021": 5.0
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Имануел Тодоров Горанов",
    "grade": 11,
    "school": "СУ \"Иван Вазов\"",
    "city": "Вършец",
    "competitions": {
      "Пролетно 2021": 5.0
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Вероника Христова Костова",
    "grade": 11,
    "school": "ОУ \"Димитър Талев\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2021": 4.0
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Антоанета Тодорова Стоянова",
    "grade": 11,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2021": 1.5
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Стефан Миленов Димитров",
    "grade": 11,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетно 2021": 1.5
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Теодор Радостинов Пенев",
    "grade": 11,
    "school": "ОУ \"Димитър Талев\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2021": 1.0
    },
    "competition_grades": {
      "Пролетно 2021": 1.0
    }
  },
  {
    "name": "Илия Генчев Ников",
    "grade": 12,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Олимпиада 2025": 86.55,
      "Пролетно 2025": 27.1,
      "Есенно 2024": 17.0,
      "Олимпиада 2024": 70.5,
      "Пролетно 2024": 19.2,
      "Есенно 2023": 26.7,
      "Олимпиада 2023": 52.3,
      "Пролетно 2023": 19.9,
      "Есенно 2022": 11.95,
      "Олимпиада 2022": 25.75,
      "Пролетно 2022": 29.0,
      "2 кръг 2022": 28.0,
      "Олимпиада 2021": 12.5,
      "Пролетно 2021": 25.25,
      "2 кръг 2021": 29.5,
      "Есенно 2019": 18.95
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетно 2024": 7.0,
      "Есенно 2023": 7.0,
      "Олимпиада 2023": 5.0,
      "Пролетно 2023": 7.0,
      "Есенно 2022": 7.0,
      "Олимпиада 2022": 3.0,
      "Пролетно 2022": 3.0,
      "2 кръг 2022": 3.0,
      "Олимпиада 2021": 2.0,
      "Пролетно 2021": 2.0,
      "2 кръг 2021": 2.0,
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Юнсин Ху",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 76.6,
      "Пролетно 2025": 19.6,
      "Есенно 2024": 21.0,
      "Олимпиада 2024": 61.45,
      "Пролетно 2024": 14.1,
      "Есенно 2023": 23.0,
      "Олимпиада 2023": 24.5,
      "Пролетно 2023": 24.5,
      "Есенно 2022": 27.5,
      "Олимпиада 2022": 18.5,
      "Пролетно 2022": 27.5,
      "2 кръг 2022": 23.0,
      "Олимпиада 2021": 20.0,
      "2 кръг 2021": 30.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетно 2024": 7.0,
      "Есенно 2023": 7.0,
      "Олимпиада 2023": 4.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетно 2022": 3.0,
      "2 кръг 2022": 3.0,
      "Олимпиада 2021": 2.0,
      "2 кръг 2021": 2.0
    }
  },
  {
    "name": "Петър Желязков Петров",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Олимпиада 2025": 79.65,
      "Пролетно 2025": 23.3,
      "Есенно 2024": 21.5,
      "Олимпиада 2024": 56.25,
      "Пролетно 2024": 8.4,
      "Есенно 2023": 16.0,
      "Олимпиада 2023": 26.0,
      "Пролетно 2023": 9.5,
      "Есенно 2022": 24.5,
      "Олимпиада 2022": 17.0,
      "Пролетно 2022": 28.75,
      "2 кръг 2022": 28.0,
      "Олимпиада 2021": 6.0,
      "Пролетно 2021": 19.0,
      "2 кръг 2021": 30.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетно 2024": 7.0,
      "Есенно 2023": 7.0,
      "Олимпиада 2023": 4.0,
      "Пролетно 2023": 7.0,
      "Есенно 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетно 2022": 3.0,
      "2 кръг 2022": 3.0,
      "Олимпиада 2021": 2.0,
      "Пролетно 2021": 2.0,
      "2 кръг 2021": 2.0
    }
  },
  {
    "name": "Илия Константинов Василев",
    "grade": 12,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 73.7,
      "Пролетно 2025": 29.0,
      "Есенно 2024": 14.5,
      "Олимпиада 2024": 62.25,
      "Пролетно 2024": 14.4,
      "Есенно 2023": 18.5,
      "Пролетно 2023": 11.8,
      "Есенно 2022": 1.2,
      "Олимпиада 2022": 20.0,
      "Пролетно 2022": 25.0,
      "2 кръг 2022": 22.0,
      "Пролетно 2021": 29.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетно 2024": 7.0,
      "Есенно 2023": 7.0,
      "Пролетно 2023": 7.0,
      "Есенно 2022": 7.0,
      "Олимпиада 2022": 3.0,
      "Пролетно 2022": 3.0,
      "2 кръг 2022": 3.0,
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Даниел Илиев Койнов",
    "grade": 12,
    "school": "ППМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Олимпиада 2025": 78.35,
      "Пролетно 2025": 12.9,
      "Олимпиада 2024": 52.25,
      "Есенно 2023": 23.0,
      "Олимпиада 2023": 28.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Олимпиада 2024": 5.0,
      "Есенно 2023": 5.0,
      "Олимпиада 2023": 4.0
    }
  },
  {
    "name": "Димитър Атанасов Германов",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 72.55,
      "Пролетно 2025": 28.7,
      "Есенно 2024": 18.5,
      "Пролетно 2024": 26.0,
      "Есенно 2023": 26.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Пролетно 2024": 5.0,
      "Есенно 2023": 5.0
    }
  },
  {
    "name": "Алберт Константин Асенов Иваницов",
    "grade": 12,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 72.85,
      "Пролетно 2025": 28.5,
      "Есенно 2024": 14.0,
      "Олимпиада 2024": 18.75,
      "Пролетно 2024": 9.9,
      "Есенно 2023": 21.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетно 2024": 7.0,
      "Есенно 2023": 5.0
    }
  },
  {
    "name": "Стефан Николаев Спасов",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 59.3,
      "Пролетно 2025": 28.0,
      "Есенно 2024": 17.5,
      "Пролетно 2024": 20.5,
      "Есенно 2023": 20.5,
      "Олимпиада 2023": 27.0,
      "Пролетно 2023": 22.0,
      "Есенно 2022": 27.5,
      "Олимпиада 2022": 23.0,
      "Пролетно 2022": 26.5,
      "2 кръг 2022": 22.0,
      "Пролетно 2021": 26.5,
      "Олимпиада 2020": 21.0,
      "2 кръг 2020": 30.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Пролетно 2024": 7.0,
      "Есенно 2023": 7.0,
      "Олимпиада 2023": 4.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетно 2022": 3.0,
      "2 кръг 2022": 3.0,
      "Пролетно 2021": 2.0,
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Чавдар Дамянов Ненов",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 29.2,
      "Пролетно 2025": 13.5,
      "Есенно 2024": 8.5,
      "Олимпиада 2024": 52.9,
      "Пролетно 2024": 14.0,
      "Есенно 2023": 15.5,
      "Олимпиада 2023": 15.5,
      "Пролетно 2023": 18.0,
      "Пролетно 2021": 19.75
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетно 2024": 5.0,
      "Есенно 2023": 5.0,
      "Олимпиада 2023": 4.0,
      "Пролетно 2023": 4.0,
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Марин Танев Танев",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 49.05,
      "Пролетно 2025": 9.5,
      "Есенно 2024": 9.0,
      "Пролетно 2024": 8.8,
      "Есенно 2023": 19.0,
      "Пролетно 2023": 20.5,
      "Есенно 2022": 22.0,
      "Пролетно 2022": 22.5,
      "Пролетно 2021": 11.75
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Пролетно 2024": 7.0,
      "Есенно 2023": 5.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Пролетно 2022": 3.0,
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Лора Димитрова Лукманова",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 28.05,
      "Пролетно 2025": 11.0,
      "Есенно 2024": 12.5,
      "Олимпиада 2024": 16.0,
      "Пролетно 2024": 6.0,
      "Есенно 2023": 13.5,
      "Олимпиада 2023": 21.0,
      "Пролетно 2023": 22.4,
      "Есенно 2022": 30.0,
      "Олимпиада 2022": 27.0,
      "Пролетно 2022": 30.0,
      "2 кръг 2022": 29.0,
      "Олимпиада 2021": 19.5,
      "Пролетно 2021": 28.0,
      "2 кръг 2021": 30.0,
      "Олимпиада 2020": 27.0,
      "2 кръг 2020": 30.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетно 2024": 7.0,
      "Есенно 2023": 7.0,
      "Олимпиада 2023": 4.0,
      "Пролетно 2023": 7.0,
      "Есенно 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетно 2022": 3.0,
      "2 кръг 2022": 3.0,
      "Олимпиада 2021": 2.0,
      "Пролетно 2021": 2.0,
      "2 кръг 2021": 2.0,
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Филип Роберт Стефанов",
    "grade": 12,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 12.3,
      "Пролетно 2025": 16.25,
      "Есенно 2024": 27.0,
      "Олимпиада 2024": 20.0,
      "Пролетно 2024": 14.5,
      "Есенно 2023": 23.5,
      "Олимпиада 2023": 20.0,
      "Пролетно 2023": 26.0,
      "Есенно 2022": 29.5,
      "Пролетно 2022": 29.5,
      "Пролетно 2021": 21.5
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 6.0,
      "Есенно 2024": 6.0,
      "Олимпиада 2024": 5.0,
      "Пролетно 2024": 5.0,
      "Есенно 2023": 5.0,
      "Олимпиада 2023": 4.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Пролетно 2022": 3.0,
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Александър Мирославов Гатев",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2025": 16.15,
      "Пролетно 2025": 19.25,
      "Есенно 2024": 28.0,
      "Олимпиада 2024": 14.5,
      "Есенно 2023": 22.0,
      "Олимпиада 2023": 17.5
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 6.0,
      "Есенно 2024": 6.0,
      "Олимпиада 2024": 5.0,
      "Есенно 2023": 5.0,
      "Олимпиада 2023": 4.0
    }
  },
  {
    "name": "Димитър Методи Лазов",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 22.0,
      "Есенно 2024": 22.0,
      "Олимпиада 2024": 15.5,
      "Есенно 2023": 21.5,
      "Олимпиада 2023": 26.0,
      "Пролетно 2023": 24.5,
      "Есенно 2022": 26.9,
      "Олимпиада 2021": 14.5,
      "Пролетно 2021": 23.5,
      "2 кръг 2021": 30.0
    },
    "competition_grades": {
      "Пролетно 2025": 6.0,
      "Есенно 2024": 6.0,
      "Олимпиада 2024": 5.0,
      "Есенно 2023": 5.0,
      "Олимпиада 2023": 4.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Олимпиада 2021": 2.0,
      "Пролетно 2021": 2.0,
      "2 кръг 2021": 2.0
    }
  },
  {
    "name": "Димитър Александров Войводов",
    "grade": 12,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Олимпиада 2025": 14.75,
      "Пролетно 2025": 14.25,
      "Есенно 2024": 19.0,
      "Пролетно 2024": 11.5,
      "Есенно 2023": 15.5,
      "Пролетно 2023": 24.0,
      "Есенно 2022": 13.5,
      "Олимпиада 2022": 8.0,
      "Пролетно 2022": 7.5,
      "2 кръг 2022": 23.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2025": 6.0,
      "Есенно 2024": 6.0,
      "Пролетно 2024": 5.0,
      "Есенно 2023": 5.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетно 2022": 3.0,
      "2 кръг 2022": 3.0
    }
  },
  {
    "name": "Стела Бисерова Бинева",
    "grade": 12,
    "school": "ПМГ \"Акад. Боян Петканчин\"",
    "city": "Хасково",
    "competitions": {
      "Олимпиада 2025": 13.45,
      "Есенно 2024": 13.0,
      "Олимпиада 2024": 15.25,
      "Пролетно 2024": 20.5,
      "Есенно 2023": 22.5,
      "Олимпиада 2023": 19.0,
      "Пролетно 2023": 23.0,
      "Есенно 2022": 21.5,
      "Олимпиада 2020": 16.0,
      "2 кръг 2020": 28.5
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Есенно 2024": 6.0,
      "Олимпиада 2024": 5.0,
      "Пролетно 2024": 5.0,
      "Есенно 2023": 5.0,
      "Олимпиада 2023": 4.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Ванеса Ангелова Калинкова",
    "grade": 12,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2025": 11.25,
      "Есенно 2024": 24.0,
      "Пролетно 2024": 12.0,
      "Есенно 2023": 19.5,
      "Пролетно 2023": 25.0,
      "Есенно 2022": 29.8,
      "Олимпиада 2022": 22.75,
      "Пролетно 2022": 25.0,
      "2 кръг 2022": 26.0,
      "Олимпиада 2021": 13.5,
      "Пролетно 2021": 28.5,
      "2 кръг 2021": 30.0
    },
    "competition_grades": {
      "Пролетно 2025": 6.0,
      "Есенно 2024": 6.0,
      "Пролетно 2024": 5.0,
      "Есенно 2023": 5.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетно 2022": 3.0,
      "2 кръг 2022": 3.0,
      "Олимпиада 2021": 2.0,
      "Пролетно 2021": 2.0,
      "2 кръг 2021": 2.0
    }
  },
  {
    "name": "Никола Бориславов Борисов",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 17.75,
      "Есенно 2024": 0.0,
      "Олимпиада 2024": 16.5,
      "Пролетно 2024": 15.5,
      "Есенно 2023": 17.5,
      "Олимпиада 2023": 27.5,
      "Пролетно 2023": 21.0,
      "Олимпиада 2022": 16.75,
      "Пролетно 2022": 12.5,
      "2 кръг 2022": 30.0
    },
    "competition_grades": {
      "Пролетно 2025": 6.0,
      "Есенно 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетно 2024": 5.0,
      "Есенно 2023": 5.0,
      "Олимпиада 2023": 4.0,
      "Пролетно 2023": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетно 2022": 3.0,
      "2 кръг 2022": 3.0
    }
  },
  {
    "name": "Людмила Димитрова Канева",
    "grade": 12,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 13.75,
      "Есенно 2024": 25.0,
      "Олимпиада 2024": 13.25,
      "Есенно 2023": 19.0,
      "Пролетно 2023": 20.5
    },
    "competition_grades": {
      "Пролетно 2025": 6.0,
      "Есенно 2024": 6.0,
      "Олимпиада 2024": 5.0,
      "Есенно 2023": 5.0,
      "Пролетно 2023": 4.0
    }
  },
  {
    "name": "Александър Иванов Коджабашийски",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 17.0,
      "Есенно 2024": 20.0,
      "Пролетно 2024": 17.5,
      "Есенно 2023": 19.0,
      "Олимпиада 2023": 16.5
    },
    "competition_grades": {
      "Пролетно 2025": 6.0,
      "Есенно 2024": 6.0,
      "Пролетно 2024": 5.0,
      "Есенно 2023": 5.0,
      "Олимпиада 2023": 4.0
    }
  },
  {
    "name": "Ангел Антонов Христов",
    "grade": 12,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2025": 8.75,
      "Есенно 2024": 20.5,
      "Пролетно 2024": 22.0,
      "Есенно 2023": 18.0,
      "Пролетно 2023": 23.5,
      "Есенно 2022": 20.3,
      "Пролетно 2022": 21.0
    },
    "competition_grades": {
      "Пролетно 2025": 6.0,
      "Есенно 2024": 6.0,
      "Пролетно 2024": 5.0,
      "Есенно 2023": 5.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Гюрхан Селяхтин Азиз",
    "grade": 12,
    "school": "ЕГ \"Хр. Ботев\"",
    "city": "Кърджали",
    "competitions": {
      "Пролетно 2025": 3.5,
      "Есенно 2024": 12.0,
      "Олимпиада 2024": 15.25,
      "Пролетно 2024": 21.5,
      "Есенно 2023": 21.5,
      "Олимпиада 2023": 26.5,
      "Олимпиада 2022": 5.5,
      "2 кръг 2022": 23.0
    },
    "competition_grades": {
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетно 2024": 5.0,
      "Есенно 2023": 5.0,
      "Олимпиада 2023": 4.0,
      "Олимпиада 2022": 3.0,
      "2 кръг 2022": 3.0
    }
  },
  {
    "name": "Ивайло Илиев Христов",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Олимпиада 2025": 17.85,
      "Пролетно 2024": 3.1,
      "Есенно 2023": 14.5,
      "Пролетно 2023": 21.0,
      "Есенно 2022": 11.5,
      "Олимпиада 2022": 20.5,
      "Пролетно 2022": 21.5,
      "2 кръг 2022": 24.0,
      "Пролетно 2021": 20.0
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0,
      "Пролетно 2024": 7.0,
      "Есенно 2023": 5.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетно 2022": 3.0,
      "2 кръг 2022": 3.0,
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Рая Ивова Шикова",
    "grade": 12,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Пролетно 2024": 18.5,
      "Есенно 2023": 22.0,
      "Олимпиада 2023": 21.0,
      "Пролетно 2023": 23.5,
      "Есенно 2022": 29.9,
      "Олимпиада 2022": 25.5,
      "Пролетно 2022": 28.5,
      "2 кръг 2022": 23.0,
      "Олимпиада 2021": 14.5,
      "Пролетно 2021": 29.25,
      "2 кръг 2021": 30.0,
      "Олимпиада 2020": 25.0,
      "2 кръг 2020": 30.0,
      "Есенно 2019": 24.2
    },
    "competition_grades": {
      "Пролетно 2024": 5.0,
      "Есенно 2023": 5.0,
      "Олимпиада 2023": 4.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетно 2022": 3.0,
      "2 кръг 2022": 3.0,
      "Олимпиада 2021": 2.0,
      "Пролетно 2021": 2.0,
      "2 кръг 2021": 2.0,
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0,
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Лазар Делянов Тодоров",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 10.25,
      "Есенно 2024": 18.0,
      "Есенно 2023": 19.5,
      "Олимпиада 2023": 17.5
    },
    "competition_grades": {
      "Пролетно 2025": 6.0,
      "Есенно 2024": 6.0,
      "Есенно 2023": 5.0,
      "Олимпиада 2023": 4.0
    }
  },
  {
    "name": "Абълай Бахътулъ Турганбек",
    "grade": 12,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 10.5,
      "Пролетно 2024": 21.0,
      "Есенно 2023": 16.0,
      "Пролетно 2023": 13.0,
      "Есенно 2022": 16.9,
      "Олимпиада 2022": 18.25,
      "Пролетно 2022": 13.5,
      "2 кръг 2022": 23.0,
      "Пролетно 2021": 16.75
    },
    "competition_grades": {
      "Пролетно 2025": 6.0,
      "Пролетно 2024": 5.0,
      "Есенно 2023": 5.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетно 2022": 3.0,
      "2 кръг 2022": 3.0,
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Христо Константинов Кисев",
    "grade": 12,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенно 2024": 23.5,
      "Олимпиада 2024": 18.25,
      "Есенно 2023": 15.0
    },
    "competition_grades": {
      "Есенно 2024": 6.0,
      "Олимпиада 2024": 5.0,
      "Есенно 2023": 5.0
    }
  },
  {
    "name": "Калоян Владиславов Цанев",
    "grade": 12,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 8.5,
      "Олимпиада 2024": 17.2,
      "Есенно 2023": 10.0,
      "Олимпиада 2023": 15.0,
      "Пролетно 2023": 9.3,
      "Есенно 2022": 4.95,
      "Пролетно 2022": 23.5,
      "Пролетно 2021": 30.0,
      "Олимпиада 2020": 22.0,
      "2 кръг 2020": 30.0
    },
    "competition_grades": {
      "Пролетно 2025": 7.0,
      "Олимпиада 2024": 5.0,
      "Есенно 2023": 7.0,
      "Олимпиада 2023": 5.0,
      "Пролетно 2023": 7.0,
      "Есенно 2022": 7.0,
      "Пролетно 2022": 3.0,
      "Пролетно 2021": 2.0,
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Никола Кирилов Пейчев",
    "grade": 12,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенно 2024": 18.0,
      "Пролетно 2024": 14.0,
      "Есенно 2023": 15.5,
      "Пролетно 2023": 17.0,
      "Есенно 2022": 12.0
    },
    "competition_grades": {
      "Есенно 2024": 6.0,
      "Пролетно 2024": 5.0,
      "Есенно 2023": 5.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0
    }
  },
  {
    "name": "Деница Марианова Йорданова",
    "grade": 12,
    "school": "ППМГ \"Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Олимпиада 2025": 21.5
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0
    }
  },
  {
    "name": "Теодор Николаев Стоянов",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенно 2024": 19.5,
      "Пролетно 2024": 13.0,
      "Пролетно 2023": 13.5,
      "Есенно 2022": 17.0,
      "Олимпиада 2021": 12.5,
      "Пролетно 2021": 18.5,
      "2 кръг 2021": 30.0
    },
    "competition_grades": {
      "Есенно 2024": 6.0,
      "Пролетно 2024": 5.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Олимпиада 2021": 2.0,
      "Пролетно 2021": 2.0,
      "2 кръг 2021": 2.0
    }
  },
  {
    "name": "Калоян Иванов Иванов 0",
    "grade": 12,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2025": 20.75,
      "Пролетно 2024": 11.0,
      "Пролетно 2023": 1.0
    },
    "competition_grades": {
      "Пролетно 2025": 6.0,
      "Пролетно 2024": 5.0,
      "Пролетно 2023": 4.0
    }
  },
  {
    "name": "Мила Красимир Гетова",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенно 2023": 19.0,
      "Олимпиада 2023": 19.0,
      "Пролетно 2023": 21.0,
      "Есенно 2022": 21.5,
      "Олимпиада 2022": 17.0,
      "Пролетно 2022": 26.0,
      "2 кръг 2022": 25.0,
      "Олимпиада 2021": 17.5,
      "Пролетно 2021": 14.5,
      "2 кръг 2021": 30.0
    },
    "competition_grades": {
      "Есенно 2023": 5.0,
      "Олимпиада 2023": 4.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетно 2022": 3.0,
      "2 кръг 2022": 3.0,
      "Олимпиада 2021": 2.0,
      "Пролетно 2021": 2.0,
      "2 кръг 2021": 2.0
    }
  },
  {
    "name": "Калоян Тихомиров Даскалов",
    "grade": 12,
    "school": "ППМГ \"Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Олимпиада 2025": 17.45
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0
    }
  },
  {
    "name": "Александра Константинова Петкова",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2024": 3.8,
      "Есенно 2023": 7.7,
      "Олимпиада 2023": 20.0,
      "Пролетно 2023": 28.5,
      "Есенно 2022": 29.0,
      "Олимпиада 2022": 19.0,
      "Пролетно 2022": 26.5,
      "2 кръг 2022": 23.0
    },
    "competition_grades": {
      "Пролетно 2024": 7.0,
      "Есенно 2023": 7.0,
      "Олимпиада 2023": 4.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетно 2022": 3.0,
      "2 кръг 2022": 3.0
    }
  },
  {
    "name": "Деодор Асенов Величков",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2024": 9.0,
      "Есенно 2023": 21.5,
      "Пролетно 2023": 10.5,
      "Есенно 2022": 21.0,
      "Олимпиада 2022": 16.0,
      "2 кръг 2022": 22.0,
      "Олимпиада 2021": 5.0,
      "Пролетно 2021": 21.5,
      "2 кръг 2021": 29.0
    },
    "competition_grades": {
      "Пролетно 2024": 5.0,
      "Есенно 2023": 5.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "2 кръг 2022": 3.0,
      "Олимпиада 2021": 2.0,
      "Пролетно 2021": 2.0,
      "2 кръг 2021": 2.0
    }
  },
  {
    "name": "Калоян Августинов Маринов",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 34.75
    },
    "competition_grades": {
      "Олимпиада 2024": 5.0
    }
  },
  {
    "name": "Ема Марин Янева",
    "grade": 12,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 12.25,
      "Пролетно 2024": 12.0,
      "Есенно 2022": 8.0,
      "Пролетно 2022": 10.0
    },
    "competition_grades": {
      "Пролетно 2025": 6.0,
      "Пролетно 2024": 5.0,
      "Есенно 2022": 4.0,
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Калоян Калинов Димитров",
    "grade": 12,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенно 2023": 20.5,
      "Пролетно 2023": 23.25,
      "Есенно 2022": 17.3,
      "Олимпиада 2022": 18.0,
      "Пролетно 2022": 16.5,
      "2 кръг 2022": 25.0,
      "Олимпиада 2021": 10.5,
      "2 кръг 2021": 30.0
    },
    "competition_grades": {
      "Есенно 2023": 5.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетно 2022": 3.0,
      "2 кръг 2022": 3.0,
      "Олимпиада 2021": 2.0,
      "2 кръг 2021": 2.0
    }
  },
  {
    "name": "Александър Георгиев Иванов",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 11.0,
      "Есенно 2024": 7.0,
      "Пролетно 2024": 5.0
    },
    "competition_grades": {
      "Пролетно 2025": 6.0,
      "Есенно 2024": 6.0,
      "Пролетно 2024": 5.0
    }
  },
  {
    "name": "Кристиан Николаев Велчев",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 2.8,
      "Есенно 2024": 3.5,
      "Пролетно 2024": 7.6,
      "Есенно 2023": 20.0,
      "Пролетно 2023": 10.5,
      "Пролетно 2022": 6.5,
      "Пролетно 2021": 23.5,
      "Есенно 2019": 17.55
    },
    "competition_grades": {
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Пролетно 2024": 7.0,
      "Есенно 2023": 5.0,
      "Пролетно 2023": 4.0,
      "Пролетно 2022": 3.0,
      "Пролетно 2021": 2.0,
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Ивайло Станимиров Мъндев",
    "grade": 12,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Пролетно 2025": 6.5,
      "Есенно 2024": 3.5,
      "Пролетно 2024": 9.5,
      "Есенно 2023": 10.5,
      "Есенно 2022": 7.5,
      "Пролетно 2022": 10.0
    },
    "competition_grades": {
      "Пролетно 2025": 7.0,
      "Есенно 2024": 7.0,
      "Пролетно 2024": 5.0,
      "Есенно 2023": 5.0,
      "Есенно 2022": 4.0,
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Балвис Симеонов Пенчев",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенно 2024": 9.0,
      "Пролетно 2024": 10.0,
      "Пролетно 2023": 10.0,
      "Есенно 2022": 19.0,
      "Олимпиада 2022": 9.5,
      "2 кръг 2022": 22.0
    },
    "competition_grades": {
      "Есенно 2024": 6.0,
      "Пролетно 2024": 5.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "2 кръг 2022": 3.0
    }
  },
  {
    "name": "Николета Калинова Стойнова",
    "grade": 12,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетно 2025": 12.0,
      "Пролетно 2023": 9.0,
      "Есенно 2022": 10.4,
      "Пролетно 2022": 13.0,
      "Пролетно 2021": 18.5,
      "Олимпиада 2020": 9.0,
      "2 кръг 2020": 28.5
    },
    "competition_grades": {
      "Пролетно 2025": 6.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Пролетно 2022": 3.0,
      "Пролетно 2021": 2.0,
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Рени Огнянова Паскалева",
    "grade": 12,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Есенно 2023": 16.0,
      "Олимпиада 2023": 18.0,
      "Олимпиада 2022": 17.5,
      "Пролетно 2022": 28.0,
      "2 кръг 2022": 25.0,
      "Олимпиада 2021": 19.0,
      "2 кръг 2021": 30.0,
      "2 кръг 2020": 28.5,
      "Есенно 2019": 23.0
    },
    "competition_grades": {
      "Есенно 2023": 5.0,
      "Олимпиада 2023": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетно 2022": 3.0,
      "2 кръг 2022": 3.0,
      "Олимпиада 2021": 2.0,
      "2 кръг 2021": 2.0,
      "2 кръг 2020": 1.0,
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Ивайло Емилов Благоев",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенно 2024": 6.5,
      "Пролетно 2024": 13.5,
      "Олимпиада 2023": 11.0
    },
    "competition_grades": {
      "Есенно 2024": 6.0,
      "Пролетно 2024": 5.0,
      "Олимпиада 2023": 4.0
    }
  },
  {
    "name": "Борис Дилянов Биков",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2024": 14.0,
      "Есенно 2023": 16.0,
      "Есенно 2022": 12.5
    },
    "competition_grades": {
      "Пролетно 2024": 5.0,
      "Есенно 2023": 5.0,
      "Есенно 2022": 4.0
    }
  },
  {
    "name": "Димо Симеонов Петков",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2024": 12.5,
      "Пролетно 2023": 14.5,
      "Есенно 2022": 13.5,
      "Пролетно 2022": 12.5,
      "Пролетно 2021": 14.75
    },
    "competition_grades": {
      "Пролетно 2024": 5.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Пролетно 2022": 3.0,
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Николай Красимиров Костадинов",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2025": 8.75,
      "Есенно 2024": 3.0
    },
    "competition_grades": {
      "Пролетно 2025": 6.0,
      "Есенно 2024": 6.0
    }
  },
  {
    "name": "Калина Ивайлова Цонева",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенно 2024": 6.5,
      "Есенно 2023": 15.0
    },
    "competition_grades": {
      "Есенно 2024": 6.0,
      "Есенно 2023": 5.0
    }
  },
  {
    "name": "Михаил Христов Бараков",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенно 2023": 13.0,
      "Пролетно 2023": 10.0,
      "Есенно 2022": 8.0,
      "Пролетно 2022": 19.0,
      "Пролетно 2021": 10.25
    },
    "competition_grades": {
      "Есенно 2023": 5.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Пролетно 2022": 3.0,
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Димитър Пламенов Попов",
    "grade": 12,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2024": 12.0,
      "Пролетно 2023": 13.0,
      "Пролетно 2022": 11.5,
      "Есенно 2019": 8.35
    },
    "competition_grades": {
      "Пролетно 2024": 5.0,
      "Пролетно 2023": 4.0,
      "Пролетно 2022": 3.0,
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Сияна Тодорова Майсторова",
    "grade": 12,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2023": 20.0,
      "Есенно 2022": 10.0,
      "Пролетно 2022": 21.5,
      "Олимпиада 2021": 8.0,
      "Пролетно 2021": 21.75,
      "2 кръг 2021": 29.8
    },
    "competition_grades": {
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Пролетно 2022": 3.0,
      "Олимпиада 2021": 2.0,
      "Пролетно 2021": 2.0,
      "2 кръг 2021": 2.0
    }
  },
  {
    "name": "Димитър Борисов Попов",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенно 2023": 10.5,
      "Пролетно 2023": 16.75,
      "Пролетно 2022": 7.5
    },
    "competition_grades": {
      "Есенно 2023": 5.0,
      "Пролетно 2023": 4.0,
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Симона Петрова Гагарова",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 17.5,
      "Есенно 2022": 19.5
    },
    "competition_grades": {
      "Олимпиада 2023": 4.0,
      "Есенно 2022": 4.0
    }
  },
  {
    "name": "Атанас Проданов Сталев",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2023": 16.5,
      "Есенно 2022": 11.5,
      "Пролетно 2021": 19.25,
      "Олимпиада 2020": 26.0,
      "2 кръг 2020": 30.0,
      "Есенно 2019": 21.0
    },
    "competition_grades": {
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Пролетно 2021": 2.0,
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0,
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Кристиян Даниелов Николов",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенно 2022": 16.0,
      "Олимпиада 2022": 8.0,
      "2 кръг 2022": 23.0,
      "Олимпиада 2021": 10.0,
      "Пролетно 2021": 18.0,
      "2 кръг 2021": 29.5
    },
    "competition_grades": {
      "Есенно 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "2 кръг 2022": 3.0,
      "Олимпиада 2021": 2.0,
      "Пролетно 2021": 2.0,
      "2 кръг 2021": 2.0
    }
  },
  {
    "name": "Борис Кирилов Велчев",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2024": 13.5
    },
    "competition_grades": {
      "Пролетно 2024": 5.0
    }
  },
  {
    "name": "Даяна Цветелинова Маринова",
    "grade": 12,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетно 2024": 6.5,
      "Есенно 2023": 5.5,
      "Пролетно 2023": 1.5,
      "Есенно 2022": 6.5
    },
    "competition_grades": {
      "Пролетно 2024": 5.0,
      "Есенно 2023": 5.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0
    }
  },
  {
    "name": "Борис Ивайлов Карабойков",
    "grade": 12,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Есенно 2023": 5.0,
      "Пролетно 2023": 4.5,
      "Есенно 2022": 10.5,
      "Пролетно 2022": 9.0,
      "Пролетно 2021": 19.0
    },
    "competition_grades": {
      "Есенно 2023": 5.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Пролетно 2022": 3.0,
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Александра Петрова Кобакова",
    "grade": 12,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенно 2024": 6.5
    },
    "competition_grades": {
      "Есенно 2024": 6.0
    }
  },
  {
    "name": "Ралица Валентинова Йорданова",
    "grade": 12,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетно 2024": 6.0,
      "Есенно 2022": 11.4,
      "Пролетно 2022": 9.5
    },
    "competition_grades": {
      "Пролетно 2024": 5.0,
      "Есенно 2022": 4.0,
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Иван Станимиров Атанасов",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2024": 11.0
    },
    "competition_grades": {
      "Пролетно 2024": 5.0
    }
  },
  {
    "name": "Стефко Тихомиров Николаев",
    "grade": 12,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2024": 6.0,
      "Пролетно 2023": 5.5,
      "Пролетно 2022": 9.5,
      "Есенно 2019": 11.95
    },
    "competition_grades": {
      "Пролетно 2024": 5.0,
      "Пролетно 2023": 4.0,
      "Пролетно 2022": 3.0,
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Никола Николов Пъдарев",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенно 2022": 16.5,
      "Олимпиада 2021": 10.5,
      "Пролетно 2021": 23.5,
      "2 кръг 2021": 30.0
    },
    "competition_grades": {
      "Есенно 2022": 4.0,
      "Олимпиада 2021": 2.0,
      "Пролетно 2021": 2.0,
      "2 кръг 2021": 2.0
    }
  },
  {
    "name": "Светослав Спасов Иванов",
    "grade": 12,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетно 2024": 7.0,
      "Есенно 2022": 7.5
    },
    "competition_grades": {
      "Пролетно 2024": 5.0,
      "Есенно 2022": 4.0
    }
  },
  {
    "name": "Любомир Илианов Стойчев",
    "grade": 12,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2024": 6.5,
      "Пролетно 2023": 6.75
    },
    "competition_grades": {
      "Пролетно 2024": 5.0,
      "Пролетно 2023": 4.0
    }
  },
  {
    "name": "Кристиян Пламен Милтиядов",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенно 2023": 12.0
    },
    "competition_grades": {
      "Есенно 2023": 5.0
    }
  },
  {
    "name": "Теодора Свиленова Мачева",
    "grade": 12,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенно 2023": 8.0,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 4.9
    },
    "competition_grades": {
      "Есенно 2023": 5.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0
    }
  },
  {
    "name": "Виктор Невелинов Василев",
    "grade": 12,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Есенно 2023": 3.5,
      "Пролетно 2023": 9.5,
      "Пролетно 2022": 5.0,
      "Олимпиада 2020": 7.0,
      "2 кръг 2020": 28.5
    },
    "competition_grades": {
      "Есенно 2023": 5.0,
      "Пролетно 2023": 4.0,
      "Пролетно 2022": 3.0,
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Александра Миленова Петкова",
    "grade": 12,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенно 2023": 9.5,
      "Пролетно 2023": 0.0,
      "Есенно 2022": 4.7
    },
    "competition_grades": {
      "Есенно 2023": 5.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0
    }
  },
  {
    "name": "София Георгиева Апостолова",
    "grade": 12,
    "school": "ППМГ \"Никола Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетно 2024": 5.5,
      "Есенно 2023": 3.5,
      "Пролетно 2023": 1.0
    },
    "competition_grades": {
      "Пролетно 2024": 5.0,
      "Есенно 2023": 5.0,
      "Пролетно 2023": 4.0
    }
  },
  {
    "name": "Николай Евгениев Николаев",
    "grade": 12,
    "school": "ППМГ \"Екзарх Антим I\"",
    "city": "Видин",
    "competitions": {
      "Олимпиада 2023": 15.0
    },
    "competition_grades": {
      "Олимпиада 2023": 4.0
    }
  },
  {
    "name": "Нина Недкова Минчева",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2024": 3.0,
      "Есенно 2023": 7.0
    },
    "competition_grades": {
      "Пролетно 2024": 5.0,
      "Есенно 2023": 5.0
    }
  },
  {
    "name": "Александър Танер Тасим",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенно 2022": 16.9,
      "Пролетно 2021": 19.5,
      "Олимпиада 2020": 10.0,
      "2 кръг 2020": 28.5
    },
    "competition_grades": {
      "Есенно 2022": 4.0,
      "Пролетно 2021": 2.0,
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Борис Владимиров Михов",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенно 2024": 4.5
    },
    "competition_grades": {
      "Есенно 2024": 6.0
    }
  },
  {
    "name": "Константин Петров Тодоров",
    "grade": 12,
    "school": "ППМГ \"Никола Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Олимпиада 2025": 2.25
    },
    "competition_grades": {
      "Олимпиада 2025": 5.0
    }
  },
  {
    "name": "Петко Валериев Лазаров",
    "grade": 12,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенно 2022": 7.0,
      "Пролетно 2022": 15.5,
      "Пролетно 2021": 24.0
    },
    "competition_grades": {
      "Есенно 2022": 4.0,
      "Пролетно 2022": 3.0,
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Георги Данаилов Парушев",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2024": 4.0,
      "Есенно 2023": 3.0
    },
    "competition_grades": {
      "Пролетно 2024": 5.0,
      "Есенно 2023": 5.0
    }
  },
  {
    "name": "Тодор Фаршидов Каракочев",
    "grade": 12,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенно 2022": 9.7,
      "Пролетно 2022": 16.0,
      "Есенно 2019": 12.0
    },
    "competition_grades": {
      "Есенно 2022": 4.0,
      "Пролетно 2022": 3.0,
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Мария Миленова Динкова",
    "grade": 12,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенно 2023": 5.5,
      "Пролетно 2023": 3.0,
      "Есенно 2022": 2.5
    },
    "competition_grades": {
      "Есенно 2023": 5.0,
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0
    }
  },
  {
    "name": "Виктор Георгиев Риджалски",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2024": 5.0
    },
    "competition_grades": {
      "Пролетно 2024": 5.0
    }
  },
  {
    "name": "Тома Спасов Тасев",
    "grade": 12,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетно 2023": 1.5,
      "Есенно 2022": 6.0,
      "Пролетно 2022": 12.5
    },
    "competition_grades": {
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Мира Стаменова Дулевска",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 16.5,
      "Пролетно 2021": 17.0,
      "2 кръг 2021": 30.0
    },
    "competition_grades": {
      "Олимпиада 2021": 2.0,
      "Пролетно 2021": 2.0,
      "2 кръг 2021": 2.0
    }
  },
  {
    "name": "Мартин Михайлов Марковски",
    "grade": 12,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетно 2024": 4.5
    },
    "competition_grades": {
      "Пролетно 2024": 5.0
    }
  },
  {
    "name": "Борис Калинов Азгоров",
    "grade": 12,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 13.0,
      "Пролетно 2021": 28.0
    },
    "competition_grades": {
      "Пролетно 2022": 3.0,
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Йоана Стефанова Станева",
    "grade": 12,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2023": 3.5,
      "Есенно 2022": 6.5,
      "Есенно 2019": 14.9
    },
    "competition_grades": {
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Костадин Жулиенов Граматиков",
    "grade": 12,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Пролетно 2023": 2.5,
      "Есенно 2022": 6.2,
      "Пролетно 2022": 4.5
    },
    "competition_grades": {
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Александър Александров Попвеличков",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенно 2023": 4.5,
      "Есенно 2019": 14.35
    },
    "competition_grades": {
      "Есенно 2023": 5.0,
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Мартин Бориславов Сотиров",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 12.5,
      "Пролетно 2021": 16.5
    },
    "competition_grades": {
      "Пролетно 2022": 3.0,
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Преслав Преславов Петров",
    "grade": 12,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетно 2023": 4.0,
      "Есенно 2022": 3.0,
      "Пролетно 2022": 3.75
    },
    "competition_grades": {
      "Пролетно 2023": 4.0,
      "Есенно 2022": 4.0,
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Райна Георгиева Георгиева",
    "grade": 12,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетно 2023": 4.5,
      "Пролетно 2022": 7.5
    },
    "competition_grades": {
      "Пролетно 2023": 4.0,
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Мария Тервел Павлова",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 15.0,
      "Есенно 2019": 17.13
    },
    "competition_grades": {
      "Пролетно 2022": 3.0,
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Николай Василев Деспотов",
    "grade": 12,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2022": 15.0
    },
    "competition_grades": {
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Веселина Веселинова Василева",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 9.5,
      "Пролетно 2021": 10.5
    },
    "competition_grades": {
      "Пролетно 2022": 3.0,
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Костадин Стефанов Кудев",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2022": 6.0,
      "Пролетно 2021": 18.0
    },
    "competition_grades": {
      "Пролетно 2022": 3.0,
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Росен Иванов Маринов",
    "grade": 12,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 23.0,
      "2 кръг 2020": 30.0,
      "Есенно 2019": 19.68
    },
    "competition_grades": {
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0,
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Далия Адреанова Петрова",
    "grade": 12,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетно 2023": 3.0,
      "Пролетно 2022": 6.25
    },
    "competition_grades": {
      "Пролетно 2023": 4.0,
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Емил Стефанов Стефанов",
    "grade": 12,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Пролетно 2022": 11.0
    },
    "competition_grades": {
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Михаела Георгиева Христова",
    "grade": 12,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2022": 10.75
    },
    "competition_grades": {
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Георгий Валерьевич Можейко",
    "grade": 12,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 23.0,
      "2 кръг 2020": 28.5
    },
    "competition_grades": {
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Емил Руменов Ортомаров",
    "grade": 12,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Пролетно 2022": 10.0
    },
    "competition_grades": {
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Цветослав Цветлинов Попов",
    "grade": 12,
    "school": "ППМГ \"Екзарх Антим I\"",
    "city": "Видин",
    "competitions": {
      "Олимпиада 2020": 19.0,
      "2 кръг 2020": 28.5
    },
    "competition_grades": {
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Валери Тодоров Иванов",
    "grade": 12,
    "school": "ПГКПИ ",
    "city": "Бургас",
    "competitions": {
      "Пролетно 2023": 1.5,
      "Пролетно 2022": 5.5
    },
    "competition_grades": {
      "Пролетно 2023": 4.0,
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Ния Данаилова Господинова",
    "grade": 12,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Есенно 2022": 5.0
    },
    "competition_grades": {
      "Есенно 2022": 4.0
    }
  },
  {
    "name": "Нора Огнянова Паскалева",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "2 кръг 2020": 28.5,
      "Есенно 2019": 25.75
    },
    "competition_grades": {
      "2 кръг 2020": 1.0,
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Момчил Христов Христов",
    "grade": 12,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2022": 7.0,
      "Есенно 2019": 9.3
    },
    "competition_grades": {
      "Пролетно 2022": 3.0,
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Стефани Илиева Стоянова",
    "grade": 12,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Олимпиада 2020": 13.0,
      "2 кръг 2020": 28.5
    },
    "competition_grades": {
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Руси Миленов Хаджийски",
    "grade": 12,
    "school": "ППМГ \"Васил Левски\"",
    "city": "Смолян",
    "competitions": {
      "Есенно 2022": 4.2
    },
    "competition_grades": {
      "Есенно 2022": 4.0
    }
  },
  {
    "name": "Йоана Викторова Стоянова",
    "grade": 12,
    "school": "33 СОУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 10.0,
      "2 кръг 2020": 28.5
    },
    "competition_grades": {
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Николай Борисов Мутафчиев",
    "grade": 12,
    "school": "55 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 10.0,
      "2 кръг 2020": 28.5
    },
    "competition_grades": {
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Яна Бориславова Спасова",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2021": 17.25
    },
    "competition_grades": {
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Биляна Емилова Христова",
    "grade": 12,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетно 2023": 3.0
    },
    "competition_grades": {
      "Пролетно 2023": 4.0
    }
  },
  {
    "name": "Камелия Искренова Тодорова",
    "grade": 12,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2022": 7.0
    },
    "competition_grades": {
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Александра Пламенова Димитрова",
    "grade": 12,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетно 2021": 16.5
    },
    "competition_grades": {
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Данаил Венциславов Маринов",
    "grade": 12,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2021": 16.5
    },
    "competition_grades": {
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Десислава Иванова Гарванова",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетно 2021": 16.45
    },
    "competition_grades": {
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Виктория Йорданова Господинова",
    "grade": 12,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетно 2022": 6.5
    },
    "competition_grades": {
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Кристиан Даниелов Петров",
    "grade": 12,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Есенно 2022": 3.5
    },
    "competition_grades": {
      "Есенно 2022": 4.0
    }
  },
  {
    "name": "Стефани Боянова Найденова",
    "grade": 12,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенно 2022": 3.5
    },
    "competition_grades": {
      "Есенно 2022": 4.0
    }
  },
  {
    "name": "Кристиан Венелинов Василев",
    "grade": 12,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2023": 2.5
    },
    "competition_grades": {
      "Пролетно 2023": 4.0
    }
  },
  {
    "name": "Христиан Мартинов Монев",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2023": 2.5
    },
    "competition_grades": {
      "Пролетно 2023": 4.0
    }
  },
  {
    "name": "Илиян Милков Мурадилов",
    "grade": 12,
    "school": "ППМГ \"Васил Левски\"",
    "city": "Смолян",
    "competitions": {
      "Есенно 2022": 2.1,
      "Пролетно 2022": 2.0
    },
    "competition_grades": {
      "Есенно 2022": 4.0,
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Николас Ерлинг Лунд Нилсен",
    "grade": 12,
    "school": "ГПЧЕ \"Йоан Екзарх\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2022": 5.5
    },
    "competition_grades": {
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Борис Ангелов Калоферов",
    "grade": 12,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетно 2021": 12.5
    },
    "competition_grades": {
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Николай Стефанов Младенов",
    "grade": 12,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетно 2022": 5.25
    },
    "competition_grades": {
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Марина Калинова Димитранова",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетно 2021": 12.0
    },
    "competition_grades": {
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Ивана Иванова Иванова",
    "grade": 12,
    "school": "ЕГ \"Акад. Людмил Стоянов\"",
    "city": "Благоевград",
    "competitions": {
      "Пролетно 2022": 5.0
    },
    "competition_grades": {
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Виктор Светлинов Росенов",
    "grade": 12,
    "school": "ПМГ",
    "city": "Перник",
    "competitions": {
      "Пролетно 2023": 2.0
    },
    "competition_grades": {
      "Пролетно 2023": 4.0
    }
  },
  {
    "name": "Никола Николаев Георгиев",
    "grade": 12,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Пролетно 2021": 11.0
    },
    "competition_grades": {
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Боряна Веселинова Янева",
    "grade": 12,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетно 2022": 4.0
    },
    "competition_grades": {
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Данаил Димчев Недялков",
    "grade": 12,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2023": 1.5
    },
    "competition_grades": {
      "Пролетно 2023": 4.0
    }
  },
  {
    "name": "Марк Владимиров Иванов",
    "grade": 12,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2022": 3.5
    },
    "competition_grades": {
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Мартин Николаев Вълчев",
    "grade": 12,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетно 2022": 3.0
    },
    "competition_grades": {
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Ралица Мехмедова Ибрахимова",
    "grade": 12,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетно 2021": 6.5
    },
    "competition_grades": {
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Катрин Асенова Петрова",
    "grade": 12,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетно 2022": 2.5
    },
    "competition_grades": {
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Васил Константинов Кременаров",
    "grade": 12,
    "school": "ППМГ \"Васил Левски\"",
    "city": "Смолян",
    "competitions": {
      "Пролетно 2022": 2.0
    },
    "competition_grades": {
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Тодор Мариянов Зеленков",
    "grade": 12,
    "school": "ОУ \"Св. П. Евтимий\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенно 2019": 14.5
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Боряна Иванова Кюркчиева",
    "grade": 12,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Есенно 2019": 13.05
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Борис Димитров Тодоров",
    "grade": 12,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенно 2019": 12.25
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Марина Мариян Николаева",
    "grade": 12,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетно 2021": 3.0
    },
    "competition_grades": {
      "Пролетно 2021": 2.0
    }
  },
  {
    "name": "Георги Ивайлов Велков",
    "grade": 12,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Пролетно 2023": 0.5
    },
    "competition_grades": {
      "Пролетно 2023": 4.0
    }
  },
  {
    "name": "Емануил Христов Серафимов",
    "grade": 12,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенно 2019": 8.5
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Никол Николаева Острова",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенно 2019": 8.25
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Ивайло Анастасов Краев",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенно 2019": 8.0
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Катерина Александрова Димитрова",
    "grade": 12,
    "school": "ППМГ \"Васил Левски\"",
    "city": "Смолян",
    "competitions": {
      "Пролетно 2022": 1.0
    },
    "competition_grades": {
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Калоян Славов Гърков",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенно 2019": 7.3
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Димитър Димитров Димитров",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенно 2019": 7.2
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Стойчо Цветанов Лахтариев",
    "grade": 12,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенно 2022": 0.5
    },
    "competition_grades": {
      "Есенно 2022": 4.0
    }
  },
  {
    "name": "Ния Георгиева Владова",
    "grade": 12,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенно 2019": 6.6
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Йоанна Николова Чанева",
    "grade": 12,
    "school": "ОУ \"Св. П. Евтимий\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенно 2019": 5.7
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Панайот Иванов Димитров",
    "grade": 12,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенно 2019": 5.3
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Мартин Тодоров Ганчев",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенно 2019": 5.0
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Кристина Красимирова Илиева",
    "grade": 12,
    "school": "ОУ \"Иван Вазов\"",
    "city": "Горна Оряховица",
    "competitions": {
      "Есенно 2019": 4.6
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Карина Валериева Аспарухова",
    "grade": 12,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенно 2019": 4.0
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "София Руменова Рашева",
    "grade": 12,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенно 2019": 3.75
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Любомир Мирославов Великов",
    "grade": 12,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетно 2022": 0.5
    },
    "competition_grades": {
      "Пролетно 2022": 3.0
    }
  },
  {
    "name": "Христиана Христова Стефанова",
    "grade": 12,
    "school": "ОУ \"Св. П. Евтимий\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенно 2019": 3.5
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Преслав Дончев Панайотов",
    "grade": 12,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенно 2019": 3.25
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Надежда Паисиева Христова",
    "grade": 12,
    "school": "ОУ \"Св. П. Евтимий\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенно 2019": 3.1
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Борислав Христов Христов",
    "grade": 12,
    "school": "ОУ \"Иван Вазов\"",
    "city": "Горна Оряховица",
    "competitions": {
      "Есенно 2019": 2.5
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Дариян Живков Василев",
    "grade": 12,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенно 2019": 2.2
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Йордан Нанков Нанков",
    "grade": 12,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенно 2019": 1.5
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Мария Георгиева Арсова",
    "grade": 12,
    "school": "ОУ \"Иван Вазов\"",
    "city": "Горна Оряховица",
    "competitions": {
      "Есенно 2019": 1.5
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Никола Борисов Стефанов",
    "grade": 12,
    "school": "ОУ \"Иван Вазов\"",
    "city": "Горна Оряховица",
    "competitions": {
      "Есенно 2019": 1.5
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Ивайло Марианов Маринов",
    "grade": 12,
    "school": "ОУ \"Иван Вазов\"",
    "city": "Горна Оряховица",
    "competitions": {
      "Есенно 2019": 1.0
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Тихомир Калоянов Колев",
    "grade": 12,
    "school": "ОУ \"Иван Вазов\"",
    "city": "Горна Оряховица",
    "competitions": {
      "Есенно 2019": 1.0
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Свилена Красимирова Грешева",
    "grade": 12,
    "school": "ОУ \"Иван Вазов\"",
    "city": "Горна Оряховица",
    "competitions": {
      "Есенно 2019": 0.5
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Недко Георгиев Георгиев",
    "grade": 12,
    "school": "ОУ \"Иван Вазов\"",
    "city": "Горна Оряховица",
    "competitions": {
      "Есенно 2019": 0.1
    },
    "competition_grades": {
      "Есенно 2019": 1.0
    }
  },
  {
    "name": "Радостин Йосифов Гавраилов",
    "grade": 12,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенно 2022": 0.0
    },
    "competition_grades": {
      "Есенно 2022": 4.0
    }
  },
  {
    "name": "Стефан Атанасов Куманов",
    "grade": 12,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенно 2022": 0.0
    },
    "competition_grades": {
      "Есенно 2022": 4.0
    }
  },
]