studentsData = [
  {
    "name": "Виктор Кристин Добриков",
    "grade": 7,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 28.0,
      "Есенни 2024": 27.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Ника Димитрова Атанасова",
    "grade": 7,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 29.0,
      "Есенни 2024": 24.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Александра Сашева Тодорова",
    "grade": 7,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 29.5,
      "Есенни 2024": 17.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Виктор Венелинов Кожухаров",
    "grade": 7,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 27.5,
      "Есенни 2024": 20.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Виктор Теодор Атанасов",
    "grade": 7,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 30.0,
      "Есенни 2024": 15.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Панайот Панайотов Панайотов",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 19.5,
      "Есенни 2024": 28.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Николай Светославов Величков",
    "grade": 7,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 22.5,
      "Есенни 2024": 23.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Мартин Венциславов Хитов",
    "grade": 7,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2025": 27.5,
      "Есенни 2024": 15.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Георгия Георгиева Михалева",
    "grade": 7,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2025": 27.0,
      "Есенни 2024": 14.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Михаил Евгениев Станчев",
    "grade": 7,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 27.0,
      "Есенни 2024": 14.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Иван Миладинов Достумски",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 24.0,
      "Есенни 2024": 16.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Преслав Калоянов Пенев",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 26.0,
      "Есенни 2024": 12.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Даниел Дамянов Колев",
    "grade": 7,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2025": 26.5,
      "Есенни 2024": 8.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Виктор Станимиров Стоянов",
    "grade": 7,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2025": 21.5,
      "Есенни 2024": 13.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Никола Бисеров Петров",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 19.0,
      "Есенни 2024": 16.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Венцислав Маринов Георгиев",
    "grade": 7,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Пролетни 2025": 18.0,
      "Есенни 2024": 16.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Иванета Николова Николова",
    "grade": 7,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 28.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "Калоян Стефанов Стефанов",
    "grade": 7,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 19.0,
      "Есенни 2024": 12.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Добрил Иванов Иванов",
    "grade": 7,
    "school": "125 СУ \"Боян Пенев\"",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 28.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "Никола Недялков Василев",
    "grade": 7,
    "school": "125 СУ \"Боян Пенев\"",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 28.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "Борис Георгиев Иванов",
    "grade": 7,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 27.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "Габриел Кирилов Гавазки",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 27.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "София Живкова Пампорова",
    "grade": 7,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2025": 19.5,
      "Есенни 2024": 9.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Гергана Тихомирова Тотева",
    "grade": 7,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 26.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "Божидар Атанасов Тодоров",
    "grade": 7,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2025": 22.5,
      "Есенни 2024": 4.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Николай Йорданов Цветанов",
    "grade": 7,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2025": 21.5,
      "Есенни 2024": 5.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Александра Белчева Ботева",
    "grade": 7,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2025": 16.0,
      "Есенни 2024": 12.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Деян Динков Пейков",
    "grade": 7,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 24.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "Кирил Веселинов Киров",
    "grade": 7,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 24.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "Боян Георгиев Гогов",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 24.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "Георги Стоянов Димов",
    "grade": 7,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 6.0,
      "Есенни 2024": 15.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Борис Бориславов Ангелов",
    "grade": 7,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2025": 17.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "Шиджа Донг",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 16.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "Димитър Станиславов Пасков",
    "grade": 7,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2024": 21.5
    },
    "competition_grades": {
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Николай Павлов Тахрилов",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 16.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "Христо Йорданов Ботев",
    "grade": 7,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 16.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "Денис Кукса",
    "grade": 7,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Пролетни 2025": 15.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "Полина Павловна Курчакова",
    "grade": 7,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2025": 14.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "Никола Драгомиров Найденов",
    "grade": 7,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2025": 9.0,
      "Есенни 2024": 6.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Даниел Кирилов Кръстев",
    "grade": 7,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2025": 12.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "Ема Александрова Сиди",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2024": 16.5
    },
    "competition_grades": {
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Теодора Георгиева Георгиева",
    "grade": 7,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 11.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Александър Любомиров Стайков",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 12.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "Боян Александров Стоев",
    "grade": 7,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2025": 11.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "Елена Костадинова Купенова",
    "grade": 7,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 11.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "Елена Иванова Илкова",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2024": 15.0
    },
    "competition_grades": {
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Филип Юриев Джалев",
    "grade": 7,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенни 2024": 14.5
    },
    "competition_grades": {
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Драгомир Владиславов Матеев",
    "grade": 7,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 4.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Ния Николаева Миронова",
    "grade": 7,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 9.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "Кристиан Рази Ханна",
    "grade": 7,
    "school": "104 ОУ",
    "city": "София",
    "competitions": {
      "Есенни 2024": 12.5
    },
    "competition_grades": {
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Христо Димитров Суванджиев",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2024": 11.0
    },
    "competition_grades": {
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Алексей Андреевич Карташев",
    "grade": 7,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2024": 10.0
    },
    "competition_grades": {
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Костадин Тихомиров Костадинов",
    "grade": 7,
    "school": "ППМГ",
    "city": "Ловеч",
    "competitions": {
      "Пролетни 2025": 7.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "Светослава Драгомирова Колева",
    "grade": 7,
    "school": "ППМГ \"Никола Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Есенни 2024": 9.0
    },
    "competition_grades": {
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "София Вергил Кънчева",
    "grade": 7,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2025": 6.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "Росислав Росенов Войков",
    "grade": 7,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2025": 0.5,
      "Есенни 2024": 6.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Цветомир Владимиров Александров",
    "grade": 7,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 4.0
    },
    "competition_grades": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Денис Кукса Григорйе",
    "grade": 7,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Есенни 2024": 6.0
    },
    "competition_grades": {
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Далия Тодорова Нейкова",
    "grade": 7,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 4.5
    },
    "competition_grades": {
      "Пролетни 2025": 1.0
    }
  },
  {
    "name": "Ивайла Младенова Пашовска",
    "grade": 7,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Есенни 2024": 5.0
    },
    "competition_grades": {
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Берк Исмаил Хазим",
    "grade": 7,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Есенни 2024": 4.0
    },
    "competition_grades": {
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Анелия Станимирова Стефанова",
    "grade": 7,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Есенни 2024": 3.0
    },
    "competition_grades": {
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Никита Гумашев",
    "grade": 7,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Есенни 2024": 2.5
    },
    "competition_grades": {
      "Есенни 2024": 1.0
    }
  },
  {
    "name": "Петър Петров Петров",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 28.5,
      "Есенни 2024": 28.4,
      "Олимпиада 2024": 19.0,
      "Пролетни 2024": 24.0,
      "Есенни 2023": 28.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Олимпиада 2024": 1.0,
      "Пролетни 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Бижо Бижев Бижев",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 24.5,
      "Есенни 2024": 23.7,
      "Олимпиада 2024": 14.0,
      "Пролетни 2024": 27.25,
      "Есенни 2023": 29.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Олимпиада 2024": 1.0,
      "Пролетни 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Борислава Иванова Бачовска",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 16.0,
      "Есенни 2024": 28.6,
      "Олимпиада 2024": 23.0,
      "Пролетни 2024": 26.75,
      "Есенни 2023": 28.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Олимпиада 2024": 1.0,
      "Пролетни 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Виктор Анев Анев",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 26.5,
      "Есенни 2024": 27.1,
      "Пролетни 2024": 25.25,
      "Есенни 2023": 29.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Пролетни 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Огнян Добрев Добрев",
    "grade": 8,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 21.5,
      "Есенни 2024": 26.5,
      "Пролетни 2024": 25.5,
      "Есенни 2023": 26.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Пролетни 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Никола Станимиров Костов",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 29.5,
      "Есенни 2024": 28.1,
      "Пролетни 2024": 22.3
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Пролетни 2024": 1.0
    }
  },
  {
    "name": "Борис Илиев Пулев",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 27.5,
      "Есенни 2024": 25.9,
      "Олимпиада 2024": 22.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Олимпиада 2024": 1.0
    }
  },
  {
    "name": "Мария Живкова Желязкова",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 17.0,
      "Есенни 2024": 23.5,
      "Олимпиада 2024": 12.5,
      "Пролетни 2024": 20.25,
      "Есенни 2023": 27.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Олимпиада 2024": 1.0,
      "Пролетни 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Янилия Теодор Терпо",
    "grade": 8,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2025": 27.0,
      "Есенни 2024": 23.1,
      "Олимпиада 2024": 21.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Олимпиада 2024": 1.0
    }
  },
  {
    "name": "Борислав Росен Бъчваров",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 27.0,
      "Есенни 2024": 25.8,
      "Олимпиада 2024": 16.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Олимпиада 2024": 1.0
    }
  },
  {
    "name": "Невена Георгиева Ралева",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 20.5,
      "Есенни 2024": 23.8,
      "Пролетни 2024": 19.5,
      "Есенни 2023": 25.75
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Пролетни 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Мартин Стефанов Чавдаров",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 23.5,
      "Есенни 2024": 21.4,
      "Олимпиада 2024": 26.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Олимпиада 2024": 1.0
    }
  },
  {
    "name": "Даниел Христов Тодоров",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 22.5,
      "Есенни 2024": 25.0,
      "Олимпиада 2024": 21.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Олимпиада 2024": 1.0
    }
  },
  {
    "name": "Петър Атанасов Григоров",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 26.5,
      "Есенни 2024": 23.8,
      "Пролетни 2024": 20.75
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Пролетни 2024": 1.0
    }
  },
  {
    "name": "Теа Валентинова Тодорова",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 20.5,
      "Есенни 2024": 25.8,
      "Пролетни 2024": 22.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Пролетни 2024": 1.0
    }
  },
  {
    "name": "Никола Доцов Доцов",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 23.0,
      "Есенни 2024": 21.5,
      "Олимпиада 2024": 16.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Олимпиада 2024": 1.0
    }
  },
  {
    "name": "Лев Юриевич Беленкий",
    "grade": 8,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 13.0,
      "Есенни 2024": 19.5,
      "Пролетни 2024": 26.25,
      "Есенни 2023": 27.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Пролетни 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Делян-Слав Атанасов Мирев",
    "grade": 8,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 17.0,
      "Есенни 2024": 26.5,
      "Пролетни 2024": 21.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Пролетни 2024": 1.0
    }
  },
  {
    "name": "Деян Кръстев Гигов",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 14.5,
      "Есенни 2024": 21.9,
      "Пролетни 2024": 16.25,
      "Есенни 2023": 23.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Пролетни 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Яни Мишев Мишев",
    "grade": 8,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2025": 17.5,
      "Есенни 2024": 24.7,
      "Олимпиада 2024": 14.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Олимпиада 2024": 1.0
    }
  },
  {
    "name": "Велина Валентинова Тодорова",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 13.0,
      "Есенни 2024": 26.2,
      "Пролетни 2024": 18.75
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Пролетни 2024": 1.0
    }
  },
  {
    "name": "Виктор Евгениев Кукурешков",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 14.5,
      "Есенни 2024": 20.8,
      "Есенни 2023": 27.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Марина Димитрова Маринова 0",
    "grade": 8,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенни 2024": 23.4,
      "Олимпиада 2024": 19.0,
      "Пролетни 2024": 24.25
    },
    "competition_grades": {
      "Есенни 2024": 2.0,
      "Олимпиада 2024": 1.0,
      "Пролетни 2024": 1.0
    }
  },
  {
    "name": "Виктор Мартинов Георгиев",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2024": 27.1,
      "Олимпиада 2024": 15.0,
      "Есенни 2023": 28.0
    },
    "competition_grades": {
      "Есенни 2024": 2.0,
      "Олимпиада 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Тодор Николаев Кюлафлийски",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 19.5,
      "Есенни 2024": 22.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0
    }
  },
  {
    "name": "Матей Павлов Маринов",
    "grade": 8,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2025": 15.5,
      "Есенни 2024": 23.2
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0
    }
  },
  {
    "name": "Емил Александров Кожухаров",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 11.5,
      "Есенни 2024": 27.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0
    }
  },
  {
    "name": "Теодор Стойков Стойков",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 18.0,
      "Есенни 2024": 17.1
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0
    }
  },
  {
    "name": "Борис Николов Георгиев",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 16.0,
      "Есенни 2024": 19.3
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0
    }
  },
  {
    "name": "Виктор Георгиев Сланчев",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 17.0,
      "Есенни 2024": 16.7
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0
    }
  },
  {
    "name": "Антони Валентинов Стоев",
    "grade": 8,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2025": 13.0,
      "Есенни 2024": 21.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0
    }
  },
  {
    "name": "Борис Валентинов Захариев",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 18.0,
      "Есенни 2024": 14.4
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0
    }
  },
  {
    "name": "Павел Великов Казаков",
    "grade": 8,
    "school": "ППМГ \"Гео Милев\"",
    "city": "Стара Загора",
    "competitions": {
      "Есенни 2024": 17.8,
      "Пролетни 2024": 21.0,
      "Есенни 2023": 18.0
    },
    "competition_grades": {
      "Есенни 2024": 2.0,
      "Пролетни 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Борис Антонов Матеев",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 15.0,
      "Есенни 2024": 17.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0
    }
  },
  {
    "name": "Дорян Димитров Добрев",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2024": 14.5,
      "Пролетни 2024": 23.65,
      "Есенни 2023": 21.5
    },
    "competition_grades": {
      "Есенни 2024": 2.0,
      "Пролетни 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Николай Тихомиров Цветков",
    "grade": 8,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 6.0,
      "Есенни 2024": 17.6,
      "Есенни 2023": 25.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Калина Симеонова Симеонова",
    "grade": 8,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2025": 9.5,
      "Есенни 2024": 23.2
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0
    }
  },
  {
    "name": "Александър Георгиев Гендов",
    "grade": 8,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2025": 15.5,
      "Есенни 2024": 14.7
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0
    }
  },
  {
    "name": "Камен Атанасов Бангачев",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2024": 24.7,
      "Есенни 2023": 25.0
    },
    "competition_grades": {
      "Есенни 2024": 2.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Виктория Николаева Митева",
    "grade": 8,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 1.5,
      "Есенни 2024": 20.7,
      "Пролетни 2024": 13.0,
      "Есенни 2023": 11.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Пролетни 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Огняна Мариянова Петкова",
    "grade": 8,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 6.5,
      "Пролетни 2024": 19.0,
      "Есенни 2023": 23.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Пролетни 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Михаил Миленов Иванов",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 25.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Анна Стоянова Кръстева",
    "grade": 8,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 11.0,
      "Пролетни 2024": 18.75,
      "Есенни 2023": 19.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Пролетни 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Димитър Галинов Хайдутов",
    "grade": 8,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2025": 15.0,
      "Есенни 2024": 11.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0
    }
  },
  {
    "name": "Виктор Диан Спасов",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенни 2024": 17.0,
      "Олимпиада 2024": 18.5
    },
    "competition_grades": {
      "Есенни 2024": 2.0,
      "Олимпиада 2024": 1.0
    }
  },
  {
    "name": "Илля Андрийович Ивановский",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 23.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Никола Христов Цветков",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 18.5,
      "Пролетни 2024": 6.75
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Пролетни 2024": 1.0
    }
  },
  {
    "name": "Даниел Красимиров Парушев",
    "grade": 8,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 4.5,
      "Есенни 2024": 14.0,
      "Пролетни 2024": 15.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0,
      "Пролетни 2024": 1.0
    }
  },
  {
    "name": "Ивайло Христинов Димитров",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 21.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Ивайло Огнянов Андонов",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 20.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Агнеса Петрова Галанова",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 7.5,
      "Есенни 2024": 16.6
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0
    }
  },
  {
    "name": "Емили Бохос Бохосян",
    "grade": 8,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2025": 8.5,
      "Есенни 2024": 14.8
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0
    }
  },
  {
    "name": "Данаил Данаилов Дацев",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 19.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Георги Миленов Проданов",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 19.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Кристиян Кирилов Апостолов",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 6.0,
      "Есенни 2024": 17.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0
    }
  },
  {
    "name": "Мая Владимирова Милойкова",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 9.0,
      "Пролетни 2024": 21.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Пролетни 2024": 1.0
    }
  },
  {
    "name": "Едоард Едоардов Байов",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 8.5,
      "Есенни 2024": 11.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0
    }
  },
  {
    "name": "Георги Петров Георгиев",
    "grade": 8,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2024": 18.0,
      "Есенни 2023": 28.0
    },
    "competition_grades": {
      "Пролетни 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Стоян Николаев Костадинов",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2024": 19.25,
      "Есенни 2023": 23.0
    },
    "competition_grades": {
      "Пролетни 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Велин Ивайлов Пенчев",
    "grade": 8,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2024": 17.75,
      "Есенни 2023": 23.5
    },
    "competition_grades": {
      "Пролетни 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Теодор Колев Колев",
    "grade": 8,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2024": 18.0,
      "Есенни 2023": 17.25
    },
    "competition_grades": {
      "Пролетни 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Ангелина Петрова Попова",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 12.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 2.0
    }
  },
  {
    "name": "Северин Юриев Кавлаков",
    "grade": 8,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2024": 17.0,
      "Есенни 2023": 17.5
    },
    "competition_grades": {
      "Пролетни 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Александър Викторов Иванов",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 12.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Никола Станиславов Мановски",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 12.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Виктор Венциславов Хаджибеев",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 11.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Захари Константинов Тотев",
    "grade": 8,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2024": 13.25,
      "Есенни 2023": 17.0
    },
    "competition_grades": {
      "Пролетни 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Николай Валериев Кавалски",
    "grade": 8,
    "school": "91. НЕГ \"Проф. К. Гълъбов\"",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 8.0,
      "Есенни 2023": 7.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Никола Христов Колев",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2024": 23.25
    },
    "competition_grades": {
      "Пролетни 2024": 1.0
    }
  },
  {
    "name": "Виктория Бранимирова Начева",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 9.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Даника Станиславова Райкова",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 9.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Петър Николаев Ненов",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 15.5
    },
    "competition_grades": {
      "Олимпиада 2024": 1.0
    }
  },
  {
    "name": "Александър Ивайлов Русев",
    "grade": 8,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2024": 15.5,
      "Есенни 2023": 6.0
    },
    "competition_grades": {
      "Пролетни 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Денислав Филипов Филипов",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенни 2023": 24.5
    },
    "competition_grades": {
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Марина Василева Георгиева",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2023": 23.0
    },
    "competition_grades": {
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Михаил Стоянов Чолаков",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Есенни 2023": 22.25
    },
    "competition_grades": {
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Любомир Кирилов Харачеров",
    "grade": 8,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Пролетни 2024": 6.0,
      "Есенни 2023": 14.0
    },
    "competition_grades": {
      "Пролетни 2024": 1.0,
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Мартин Петров Петров",
    "grade": 8,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2023": 21.5
    },
    "competition_grades": {
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Тея Яворова Спирова",
    "grade": 8,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2023": 21.5
    },
    "competition_grades": {
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Тодор Любенов Добрев",
    "grade": 8,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2023": 21.5
    },
    "competition_grades": {
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Селена Емилова Бухова",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2024": 16.05
    },
    "competition_grades": {
      "Пролетни 2024": 1.0
    }
  },
  {
    "name": "Пламен Николаев Големанов",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенни 2023": 20.5
    },
    "competition_grades": {
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Мартина Красимирова Илиева",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2024": 14.4
    },
    "competition_grades": {
      "Пролетни 2024": 1.0
    }
  },
  {
    "name": "Виктория Венциславова Димкина",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Есенни 2023": 18.5
    },
    "competition_grades": {
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Емре Нехат Назиф",
    "grade": 8,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Есенни 2024": 6.4
    },
    "competition_grades": {
      "Есенни 2024": 2.0
    }
  },
  {
    "name": "Антоний Диан Лалев",
    "grade": 8,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 4.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Теодор Пенев Господинов",
    "grade": 8,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2023": 13.5
    },
    "competition_grades": {
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Бояна Николаева Цаневска",
    "grade": 8,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 4.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Виктория Ангелова Атанасова",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 4.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Дария Златкова Златева",
    "grade": 8,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търниво",
    "competitions": {
      "Пролетни 2025": 3.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Иван Томов Тончев",
    "grade": 8,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Пролетни 2024": 6.0
    },
    "competition_grades": {
      "Пролетни 2024": 1.0
    }
  },
  {
    "name": "Антон Иванов Голев",
    "grade": 8,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 2.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Михаил Нестор Несторов",
    "grade": 8,
    "school": "ТУЕС",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 2.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Никола Дончев Николов",
    "grade": 8,
    "school": "НПГПТО \"М. В. Ломоносов\"",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 2.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Полина Петкова Здравкова",
    "grade": 8,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2025": 2.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Петър Мирославов Петров",
    "grade": 8,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2023": 7.0
    },
    "competition_grades": {
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Боян Ивайлов Дочев",
    "grade": 8,
    "school": "НПГПТО \"М. В. Ломоносов\"",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 2.0
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Велизара Васиева Иванова",
    "grade": 8,
    "school": "НПГПТО \"М. В. Ломоносов\"",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 1.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Даниел Георгиев Димитров",
    "grade": 8,
    "school": "СУ \"Йордан Йовков\"",
    "city": "Кърджали",
    "competitions": {
      "Пролетни 2024": 3.0
    },
    "competition_grades": {
      "Пролетни 2024": 1.0
    }
  },
  {
    "name": "Йоана Георгиева Христова",
    "grade": 8,
    "school": "СУ \"Йордан Йовков\"",
    "city": "Кърджали",
    "competitions": {
      "Пролетни 2024": 2.0
    },
    "competition_grades": {
      "Пролетни 2024": 1.0
    }
  },
  {
    "name": "Никола Елиас Хенди",
    "grade": 8,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Есенни 2023": 2.5
    },
    "competition_grades": {
      "Есенни 2023": 1.0
    }
  },
  {
    "name": "Хелин Бирсен Мехмедали",
    "grade": 8,
    "school": "СУ \"Йордан Йовков\"",
    "city": "Кърджали",
    "competitions": {
      "Пролетни 2024": 1.5
    },
    "competition_grades": {
      "Пролетни 2024": 1.0
    }
  },
  {
    "name": "Веселина Валентинова Витанова",
    "grade": 8,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търниво",
    "competitions": {
      "Пролетни 2025": 0.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Силвия Михаилова Кирилова",
    "grade": 8,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2025": 0.5
    },
    "competition_grades": {
      "Пролетни 2025": 2.0
    }
  },
  {
    "name": "Нурай Нурджан Юсеин",
    "grade": 8,
    "school": "СУ \"Йордан Йовков\"",
    "city": "Кърджали",
    "competitions": {
      "Пролетни 2024": 1.0
    },
    "competition_grades": {
      "Пролетни 2024": 1.0
    }
  },
  {
    "name": "Максим Валентин Босилков",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 23.5,
      "Есенни 2024": 26.5,
      "Олимпиада 2024": 23.5,
      "Пролетни 2024": 22.0,
      "Есенни 2023": 29.8,
      "Олимпиада 2023": 29.5,
      "Пролетни 2023": 27.0,
      "Есенни 2022": 22.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0,
      "Олимпиада 2023": 1.0,
      "Пролетни 2023": 1.0,
      "Есенни 2022": 1.0
    }
  },
  {
    "name": "Димитър Ангелов Мисирков",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 26.5,
      "Есенни 2024": 21.5,
      "Олимпиада 2024": 21.0,
      "Пролетни 2024": 25.5,
      "Есенни 2023": 29.7,
      "Пролетни 2023": 22.5,
      "Есенни 2022": 27.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0,
      "Пролетни 2023": 1.0,
      "Есенни 2022": 1.0
    }
  },
  {
    "name": "Кирил Кирилов Момчилов",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 23.0,
      "Есенни 2024": 19.5,
      "Олимпиада 2024": 23.0,
      "Пролетни 2024": 25.0,
      "Есенни 2023": 25.8,
      "Олимпиада 2023": 29.0,
      "Пролетни 2023": 18.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0,
      "Олимпиада 2023": 1.0,
      "Пролетни 2023": 1.0
    }
  },
  {
    "name": "Йордан Мариянов Петков",
    "grade": 9,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 16.0,
      "Есенни 2024": 22.0,
      "Олимпиада 2024": 19.5,
      "Пролетни 2024": 28.5,
      "Есенни 2023": 27.8,
      "Олимпиада 2023": 12.0,
      "Пролетни 2023": 29.0,
      "Есенни 2022": 25.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Олимпиада 2024": 2.0,
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0,
      "Олимпиада 2023": 1.0,
      "Пролетни 2023": 1.0,
      "Есенни 2022": 1.0
    }
  },
  {
    "name": "Дамян Иванов Накев",
    "grade": 9,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 24.0,
      "Есенни 2024": 18.5,
      "Олимпиада 2024": 16.5,
      "Пролетни 2024": 29.5,
      "Есенни 2023": 25.0,
      "Олимпиада 2023": 20.0,
      "Пролетни 2023": 16.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0,
      "Олимпиада 2023": 1.0,
      "Пролетни 2023": 1.0
    }
  },
  {
    "name": "Светослав Дариел Арабов",
    "grade": 9,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 26.5,
      "Есенни 2024": 13.0,
      "Олимпиада 2024": 19.5,
      "Пролетни 2024": 29.75,
      "Есенни 2023": 25.9,
      "Пролетни 2023": 25.0,
      "Есенни 2022": 18.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Олимпиада 2024": 2.0,
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0,
      "Пролетни 2023": 1.0,
      "Есенни 2022": 1.0
    }
  },
  {
    "name": "Мирослав Методиев Драганов",
    "grade": 9,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2025": 17.0,
      "Есенни 2024": 21.0,
      "Олимпиада 2024": 24.0,
      "Пролетни 2024": 30.0,
      "Есенни 2023": 22.9,
      "Олимпиада 2023": 15.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0,
      "Олимпиада 2023": 1.0
    }
  },
  {
    "name": "Цветелина Николаева Данова",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 27.0,
      "Есенни 2024": 22.0,
      "Олимпиада 2024": 17.5,
      "Пролетни 2024": 18.25,
      "Есенни 2023": 23.9
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0
    }
  },
  {
    "name": "Иван Владимиров Стоянов",
    "grade": 9,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2025": 17.0,
      "Есенни 2024": 24.5,
      "Олимпиада 2024": 17.5,
      "Пролетни 2024": 21.0,
      "Есенни 2023": 22.1,
      "Пролетни 2023": 21.0,
      "Есенни 2022": 21.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0,
      "Пролетни 2023": 1.0,
      "Есенни 2022": 1.0
    }
  },
  {
    "name": "Томас Николай Настев",
    "grade": 9,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 18.0,
      "Есенни 2024": 20.0,
      "Пролетни 2024": 24.5,
      "Есенни 2023": 25.9,
      "Олимпиада 2023": 26.0,
      "Пролетни 2023": 28.5,
      "Есенни 2022": 17.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0,
      "Олимпиада 2023": 1.0,
      "Пролетни 2023": 1.0,
      "Есенни 2022": 1.0
    }
  },
  {
    "name": "Радослав Антони Стефанов",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 23.5,
      "Есенни 2024": 16.5,
      "Олимпиада 2024": 17.0,
      "Пролетни 2024": 16.5,
      "Есенни 2023": 28.8,
      "Олимпиада 2023": 8.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0,
      "Олимпиада 2023": 1.0
    }
  },
  {
    "name": "Филип Владимиров Алексиев",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 25.5,
      "Есенни 2024": 22.0,
      "Пролетни 2024": 21.0,
      "Есенни 2023": 25.9
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0
    }
  },
  {
    "name": "Карим Ахмад Кхазал",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 24.0,
      "Есенни 2024": 23.5,
      "Олимпиада 2024": 18.5,
      "Пролетни 2024": 16.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетни 2024": 2.0
    }
  },
  {
    "name": "Антон Галинов Стоянов",
    "grade": 9,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 25.5,
      "Есенни 2024": 16.0,
      "Пролетни 2024": 11.0,
      "Есенни 2023": 21.4,
      "Пролетни 2023": 18.5,
      "Есенни 2022": 14.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0,
      "Пролетни 2023": 1.0,
      "Есенни 2022": 1.0
    }
  },
  {
    "name": "Александър Боянов Джунов",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 23.5,
      "Есенни 2024": 17.0,
      "Олимпиада 2024": 12.0,
      "Есенни 2023": 25.9
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Есенни 2023": 2.0
    }
  },
  {
    "name": "Нихат Дурханов Салиев",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 19.5,
      "Есенни 2024": 13.0,
      "Олимпиада 2024": 18.0,
      "Пролетни 2024": 14.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетни 2024": 2.0
    }
  },
  {
    "name": "Божидар Александров Сакарев",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 11.5,
      "Есенни 2024": 21.5,
      "Олимпиада 2024": 19.0,
      "Пролетни 2024": 15.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетни 2024": 2.0
    }
  },
  {
    "name": "Елен Стоянова Елинова",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 21.0,
      "Есенни 2024": 17.0,
      "Пролетни 2024": 19.5,
      "Олимпиада 2023": 11.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Пролетни 2024": 2.0,
      "Олимпиада 2023": 1.0
    }
  },
  {
    "name": "Божидар Светомиров Маринов",
    "grade": 9,
    "school": "ЕГ \"Пловдив\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2025": 14.5,
      "Есенни 2024": 15.0,
      "Пролетни 2024": 13.5,
      "Есенни 2023": 26.0,
      "Олимпиада 2023": 16.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0,
      "Олимпиада 2023": 1.0
    }
  },
  {
    "name": "Илияна Илиянова Дамянова",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 23.0,
      "Есенни 2024": 9.0,
      "Пролетни 2024": 8.0,
      "Есенни 2023": 25.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0
    }
  },
  {
    "name": "Виктор Георгиев Генов",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 18.0,
      "Есенни 2024": 17.0,
      "Пролетни 2024": 17.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Пролетни 2024": 2.0
    }
  },
  {
    "name": "Любослав Красимиров Димов",
    "grade": 9,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2025": 26.0,
      "Есенни 2024": 15.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Атанас Иванов Голев",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 14.0,
      "Есенни 2024": 14.5,
      "Пролетни 2024": 20.5,
      "Есенни 2023": 12.9
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0
    }
  },
  {
    "name": "Никола Светославов Иванов",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 12.5,
      "Есенни 2024": 21.0,
      "Пролетни 2024": 21.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Пролетни 2024": 2.0
    }
  },
  {
    "name": "Йоана Пламенова Младенова",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 12.0,
      "Олимпиада 2024": 21.5,
      "Пролетни 2024": 24.0,
      "Олимпиада 2023": 8.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Олимпиада 2024": 2.0,
      "Пролетни 2024": 2.0,
      "Олимпиада 2023": 1.0
    }
  },
  {
    "name": "Дарио Тодоров Тасев",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 22.5,
      "Есенни 2024": 11.0,
      "Пролетни 2024": 13.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Пролетни 2024": 2.0
    }
  },
  {
    "name": "Камен Кирилов Янев",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 18.0,
      "Есенни 2024": 10.5,
      "Пролетни 2024": 11.0,
      "Есенни 2023": 14.2
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0
    }
  },
  {
    "name": "Виктория Боянова Белчева",
    "grade": 9,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 11.5,
      "Есенни 2024": 16.0,
      "Пролетни 2024": 10.5,
      "Есенни 2023": 17.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0
    }
  },
  {
    "name": "Марина Димитрова Маринова",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 13.0,
      "Есенни 2024": 10.5,
      "Пролетни 2024": 13.5,
      "Есенни 2023": 18.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0
    }
  },
  {
    "name": "Филип Галинов Тодоров",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 18.5,
      "Есенни 2024": 7.0,
      "Пролетни 2024": 19.25
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Пролетни 2024": 2.0
    }
  },
  {
    "name": "Адриан Юлианов Пекунов",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 12.0,
      "Есенни 2024": 8.5,
      "Пролетни 2024": 4.0,
      "Олимпиада 2023": 19.5,
      "Пролетни 2023": 20.0,
      "Есенни 2022": 14.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Пролетни 2024": 2.0,
      "Олимпиада 2023": 1.0,
      "Пролетни 2023": 1.0,
      "Есенни 2022": 1.0
    }
  },
  {
    "name": "Деан Йорданов Ташев",
    "grade": 9,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2025": 9.5,
      "Есенни 2024": 11.0,
      "Пролетни 2024": 8.0,
      "Есенни 2023": 19.4,
      "Пролетни 2023": 16.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0,
      "Пролетни 2023": 1.0
    }
  },
  {
    "name": "Виктор Валентинов Станев",
    "grade": 9,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2025": 16.0,
      "Есенни 2024": 11.5,
      "Пролетни 2024": 11.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Пролетни 2024": 2.0
    }
  },
  {
    "name": "Преслав Росенов Апостолов",
    "grade": 9,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2025": 17.5,
      "Есенни 2024": 10.0,
      "Пролетни 2024": 7.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Пролетни 2024": 2.0
    }
  },
  {
    "name": "Светла Николаева Димчева",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 8.0,
      "Есенни 2024": 15.0,
      "Пролетни 2024": 19.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Пролетни 2024": 2.0
    }
  },
  {
    "name": "Преслав Драгомиров Колев",
    "grade": 9,
    "school": "ППМГ \"Никола Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Есенни 2024": 16.5,
      "Пролетни 2024": 14.0,
      "Есенни 2023": 25.6
    },
    "competition_grades": {
      "Есенни 2024": 3.0,
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0
    }
  },
  {
    "name": "Теодора Иванова Илиева",
    "grade": 9,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Пролетни 2024": 14.0,
      "Есенни 2023": 17.4,
      "Пролетни 2023": 12.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0,
      "Пролетни 2023": 1.0
    }
  },
  {
    "name": "Нора Калинова Родопска",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2024": 17.5,
      "Есенни 2023": 29.6,
      "Олимпиада 2023": 15.5,
      "Пролетни 2023": 13.5,
      "Есенни 2022": 16.25
    },
    "competition_grades": {
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0,
      "Олимпиада 2023": 1.0,
      "Пролетни 2023": 1.0,
      "Есенни 2022": 1.0
    }
  },
  {
    "name": "Федаил Ейваз Ферат",
    "grade": 9,
    "school": "ПГСАГ \"Кольо Фичето\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2025": 14.0,
      "Есенни 2024": 12.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Калоян Христин Динин",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 13.5,
      "Есенни 2024": 10.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Никола Кръстев Ръжев",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 9.0,
      "Есенни 2024": 7.0,
      "Пролетни 2024": 7.0,
      "Пролетни 2023": 10.5,
      "Есенни 2022": 13.25
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Пролетни 2024": 2.0,
      "Пролетни 2023": 1.0,
      "Есенни 2022": 1.0
    }
  },
  {
    "name": "Александър Любомиров Славов",
    "grade": 9,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2025": 13.5,
      "Есенни 2024": 8.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Дарина Спартак Маринова",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 12.0,
      "Есенни 2024": 10.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Доменик Дезмънд Доус",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Есенни 2024": 16.0,
      "Есенни 2023": 22.6
    },
    "competition_grades": {
      "Есенни 2024": 3.0,
      "Есенни 2023": 2.0
    }
  },
  {
    "name": "Борис Валери Тодоров",
    "grade": 9,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Пролетни 2025": 8.5,
      "Есенни 2024": 7.0,
      "Олимпиада 2023": 21.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0,
      "Олимпиада 2023": 1.0
    }
  },
  {
    "name": "Доминик Дезмънт Доус",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 18.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0
    }
  },
  {
    "name": "Яна Росенова Благоева",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 12.5,
      "Пролетни 2024": 13.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Пролетни 2024": 2.0
    }
  },
  {
    "name": "Димитър Петров Димитров",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 18.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0
    }
  },
  {
    "name": "Йована Димитрова Маринова",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 15.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0
    }
  },
  {
    "name": "Огнян Аспарухов Митов",
    "grade": 9,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2025": 9.0,
      "Есенни 2024": 8.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Денис Гюнай Аптула",
    "grade": 9,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 4.5,
      "Есенни 2024": 11.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Виктор Димитров Янакиев",
    "grade": 9,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 12.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0
    }
  },
  {
    "name": "Елица Данаилова Божилова",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 9.75,
      "Пролетни 2024": 6.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Пролетни 2024": 2.0
    }
  },
  {
    "name": "Мартин Петров Миланов",
    "grade": 9,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 6.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Кристиана Калоянова Калчева",
    "grade": 9,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2024": 10.5,
      "Есенни 2023": 12.5,
      "Пролетни 2023": 13.5
    },
    "competition_grades": {
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0,
      "Пролетни 2023": 1.0
    }
  },
  {
    "name": "Борис Стамбирский",
    "grade": 9,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Пролетни 2025": 6.0,
      "Есенни 2024": 5.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Ива Илиянова Сомлева",
    "grade": 9,
    "school": "Izzi",
    "city": "София",
    "competitions": {
      "Пролетни 2024": 10.5,
      "Пролетни 2023": 18.5,
      "Есенни 2022": 15.5
    },
    "competition_grades": {
      "Пролетни 2024": 2.0,
      "Пролетни 2023": 1.0,
      "Есенни 2022": 1.0
    }
  },
  {
    "name": "Кристиян Георгиев Георгиев",
    "grade": 9,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2024": 12.0,
      "Есенни 2023": 14.0
    },
    "competition_grades": {
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0
    }
  },
  {
    "name": "Момчил Чавдаров Видев",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2023": 29.9
    },
    "competition_grades": {
      "Есенни 2023": 2.0
    }
  },
  {
    "name": "Калоян Миленов Шуманов",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 1.0,
      "Есенни 2024": 11.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Магдалена Станиславова Миленкова",
    "grade": 9,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2025": 5.0,
      "Олимпиада 2024": 7.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Олимпиада 2024": 2.0
    }
  },
  {
    "name": "Петър Тихомиров Денев",
    "grade": 9,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2025": 3.5,
      "Есенни 2024": 7.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Антони Емилов Димитров",
    "grade": 9,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2023": 13.3,
      "Пролетни 2023": 14.5,
      "Есенни 2022": 16.25
    },
    "competition_grades": {
      "Есенни 2023": 2.0,
      "Пролетни 2023": 1.0,
      "Есенни 2022": 1.0
    }
  },
  {
    "name": "Ясен Владиславов Пенчев",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Есенни 2024": 11.5
    },
    "competition_grades": {
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Йосиф Симо Меламед",
    "grade": 9,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 4.5,
      "Есенни 2024": 5.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Борис Антонов Димов",
    "grade": 9,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 8.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0
    }
  },
  {
    "name": "Мина Филипова Недева",
    "grade": 9,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 7.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0
    }
  },
  {
    "name": "Георги Томов Георгиев",
    "grade": 9,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2025": 4.5,
      "Пролетни 2024": 7.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Пролетни 2024": 2.0
    }
  },
  {
    "name": "Иван Златинов Велев",
    "grade": 9,
    "school": "МГ",
    "city": "Пловдив",
    "competitions": {
      "Олимпиада 2024": 13.0
    },
    "competition_grades": {
      "Олимпиада 2024": 2.0
    }
  },
  {
    "name": "Кристияна Калоянова Калчева",
    "grade": 9,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 5.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0,
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Лена Вероника Софи Фолнер",
    "grade": 9,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Есенни 2024": 8.5
    },
    "competition_grades": {
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Борис Пенчев Златев",
    "grade": 9,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенни 2024": 7.5
    },
    "competition_grades": {
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Карина Николаева Велчева",
    "grade": 9,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2023": 16.3
    },
    "competition_grades": {
      "Есенни 2023": 2.0
    }
  },
  {
    "name": "Александър Николаев Стефанов",
    "grade": 9,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2025": 5.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0
    }
  },
  {
    "name": "Георги Даниелов Александров",
    "grade": 9,
    "school": "ГПЧЕ \"Симеон Радев\"",
    "city": "Перник",
    "competitions": {
      "Пролетни 2025": 5.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0
    }
  },
  {
    "name": "Ивайло Николаев Иванов",
    "grade": 9,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2025": 5.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0
    }
  },
  {
    "name": "Лора Димитрова Черкезова",
    "grade": 9,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Пролетни 2025": 5.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0
    }
  },
  {
    "name": "Петко Десиславов Иванов",
    "grade": 9,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 5.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0
    }
  },
  {
    "name": "Румяна Ивайлова Руменова",
    "grade": 9,
    "school": "ППМГ",
    "city": "Ловеч",
    "competitions": {
      "Пролетни 2025": 5.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0
    }
  },
  {
    "name": "Александър Боянов Русев",
    "grade": 9,
    "school": "ПГСАГ \"Кольо Фичето\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2024": 6.5
    },
    "competition_grades": {
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Ивелин Веселинов Методиев",
    "grade": 9,
    "school": "ПГКПИ",
    "city": "Бургас",
    "competitions": {
      "Есенни 2024": 6.5
    },
    "competition_grades": {
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Виктория Христова Бумбарова",
    "grade": 9,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2023": 18.5,
      "Есенни 2022": 11.5
    },
    "competition_grades": {
      "Пролетни 2023": 1.0,
      "Есенни 2022": 1.0
    }
  },
  {
    "name": "Васил Атанасов Скатов",
    "grade": 9,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2024": 2.0,
      "Есенни 2023": 11.9
    },
    "competition_grades": {
      "Пролетни 2024": 2.0,
      "Есенни 2023": 2.0
    }
  },
  {
    "name": "Димитър Димитров Катранджиев",
    "grade": 9,
    "school": "НПГПТО \"М. В. Ломоносов\"",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 4.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0
    }
  },
  {
    "name": "Симеон Георгиев Недялков",
    "grade": 9,
    "school": "ППМГ",
    "city": "Ловеч",
    "competitions": {
      "Пролетни 2025": 4.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0
    }
  },
  {
    "name": "Дарина Захариева Павлова",
    "grade": 9,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 3.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0
    }
  },
  {
    "name": "Теодора Мирославова Кирова",
    "grade": 9,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2023": 7.5,
      "Есенни 2022": 14.5
    },
    "competition_grades": {
      "Пролетни 2023": 1.0,
      "Есенни 2022": 1.0
    }
  },
  {
    "name": "Константин Димитров Сарафов",
    "grade": 9,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Есенни 2024": 4.0
    },
    "competition_grades": {
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Александър Виденов Киневирски",
    "grade": 9,
    "school": "ПМГ \"Яне Сандански\"",
    "city": "Гоце Делчев",
    "competitions": {
      "Пролетни 2023": 16.5
    },
    "competition_grades": {
      "Пролетни 2023": 1.0
    }
  },
  {
    "name": "Йоанна Антонова Василева",
    "grade": 9,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 6.5,
      "Есенни 2022": 9.0
    },
    "competition_grades": {
      "Олимпиада 2023": 1.0,
      "Есенни 2022": 1.0
    }
  },
  {
    "name": "Здравко Божидаров Божилов",
    "grade": 9,
    "school": "ПМГ \"Атанас Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Есенни 2024": 3.5
    },
    "competition_grades": {
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Димитър Костадинов Кочев",
    "grade": 9,
    "school": "НПГПТО \"М. В. Ломоносов\"",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 2.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0
    }
  },
  {
    "name": "Даниел Ивайлов Целяшки",
    "grade": 9,
    "school": "Професионална гимназия Велизар Пеев",
    "city": "Своге",
    "competitions": {
      "Есенни 2023": 7.9
    },
    "competition_grades": {
      "Есенни 2023": 2.0
    }
  },
  {
    "name": "Георги Стоянов Димитров",
    "grade": 9,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2023": 14.0
    },
    "competition_grades": {
      "Пролетни 2023": 1.0
    }
  },
  {
    "name": "Константин Пламенов Атанасов",
    "grade": 9,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2023": 10.0,
      "Есенни 2022": 5.0
    },
    "competition_grades": {
      "Пролетни 2023": 1.0,
      "Есенни 2022": 1.0
    }
  },
  {
    "name": "Емил Стоянов Досев",
    "grade": 9,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Есенни 2024": 3.0
    },
    "competition_grades": {
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Цветомир Ивайлов Цандев",
    "grade": 9,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2023": 12.5
    },
    "competition_grades": {
      "Пролетни 2023": 1.0
    }
  },
  {
    "name": "Красимир Иванов Донков",
    "grade": 9,
    "school": "ППМГ",
    "city": "Ловеч",
    "competitions": {
      "Пролетни 2025": 2.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0
    }
  },
  {
    "name": "Мирослав Георгиев Алексиев",
    "grade": 9,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетни 2025": 2.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0
    }
  },
  {
    "name": "Велко Атанасов Кожухаров",
    "grade": 9,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Есенни 2024": 2.5
    },
    "competition_grades": {
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Герасим Павел Каназирев",
    "grade": 9,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Есенни 2024": 2.5
    },
    "competition_grades": {
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Йованин Атанасов Петков",
    "grade": 9,
    "school": "ПГСАГ \"Кольо Фичето\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2024": 2.5
    },
    "competition_grades": {
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Константин Катеринов Хаджидимитров",
    "grade": 9,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Есенни 2024": 2.5
    },
    "competition_grades": {
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Мая Божидарова Шуманова",
    "grade": 9,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Есенни 2024": 2.5
    },
    "competition_grades": {
      "Есенни 2024": 3.0
    }
  },
  {
    "name": "Боян Искренов Маринов",
    "grade": 9,
    "school": "21 СУ",
    "city": "София",
    "competitions": {
      "Пролетни 2023": 10.5
    },
    "competition_grades": {
      "Пролетни 2023": 1.0
    }
  },
  {
    "name": "Рая Иванова Иванова",
    "grade": 9,
    "school": "ОУ\"Св.Патриарх",
    "city": "Варна",
    "competitions": {
      "Пролетни 2023": 9.5
    },
    "competition_grades": {
      "Пролетни 2023": 1.0
    }
  },
  {
    "name": "Борис Симеонов Петранов",
    "grade": 9,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2023": 7.0,
      "Есенни 2022": 2.5
    },
    "competition_grades": {
      "Пролетни 2023": 1.0,
      "Есенни 2022": 1.0
    }
  },
  {
    "name": "Никола Димитров Козаров",
    "grade": 9,
    "school": "СУ",
    "city": "Варна",
    "competitions": {
      "Пролетни 2023": 8.5
    },
    "competition_grades": {
      "Пролетни 2023": 1.0
    }
  },
  {
    "name": "Моника Красимирова Кръстева",
    "grade": 9,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 1.5
    },
    "competition_grades": {
      "Пролетни 2025": 3.0
    }
  },
  {
    "name": "Невена Христова Сановска",
    "grade": 9,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2023": 7.0
    },
    "competition_grades": {
      "Пролетни 2023": 1.0
    }
  },
  {
    "name": "Владимир Мирославов Господинов",
    "grade": 9,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2023": 5.5
    },
    "competition_grades": {
      "Пролетни 2023": 1.0
    }
  },
  {
    "name": "Данаил Атанасов Андреев",
    "grade": 9,
    "school": "СУ",
    "city": "Варна",
    "competitions": {
      "Пролетни 2023": 5.5
    },
    "competition_grades": {
      "Пролетни 2023": 1.0
    }
  },
  {
    "name": "Никълъс Михайлов Михайлов",
    "grade": 9,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2022": 7.25
    },
    "competition_grades": {
      "Есенни 2022": 1.0
    }
  },
  {
    "name": "Владислав Александров Грозданов",
    "grade": 9,
    "school": "Професионална гимназия Велизар Пеев",
    "city": "Своге",
    "competitions": {
      "Есенни 2023": 3.0
    },
    "competition_grades": {
      "Есенни 2023": 2.0
    }
  },
  {
    "name": "Людмил Денчо Банков",
    "grade": 9,
    "school": "ЧСУ \"Наука за деца\"",
    "city": "София",
    "competitions": {
      "Пролетни 2024": 2.0
    },
    "competition_grades": {
      "Пролетни 2024": 2.0
    }
  },
  {
    "name": "Александър Станимир Събев",
    "grade": 9,
    "school": "ОУ\"Св.Патриарх",
    "city": "Варна",
    "competitions": {
      "Пролетни 2023": 4.5
    },
    "competition_grades": {
      "Пролетни 2023": 1.0
    }
  },
  {
    "name": "Богомил Миленов Нелковски",
    "grade": 9,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2022": 5.5
    },
    "competition_grades": {
      "Есенни 2022": 1.0
    }
  },
  {
    "name": "Нина Владимирова Петрова",
    "grade": 9,
    "school": "ОУ",
    "city": "Варна",
    "competitions": {
      "Пролетни 2023": 4.0
    },
    "competition_grades": {
      "Пролетни 2023": 1.0
    }
  },
  {
    "name": "Александър Боянов Калчев",
    "grade": 9,
    "school": "СУ",
    "city": "Варна",
    "competitions": {
      "Пролетни 2023": 3.5
    },
    "competition_grades": {
      "Пролетни 2023": 1.0
    }
  },
  {
    "name": "Симона Свиленова Петрова",
    "grade": 9,
    "school": "ОУ",
    "city": "Варна",
    "competitions": {
      "Пролетни 2023": 3.0
    },
    "competition_grades": {
      "Пролетни 2023": 1.0
    }
  },
  {
    "name": "Владислав Владиславов Пенчев",
    "grade": 9,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2022": 3.5
    },
    "competition_grades": {
      "Есенни 2022": 1.0
    }
  },
  {
    "name": "Кристиян Яворов Янакиев",
    "grade": 9,
    "school": "ОУ",
    "city": "Варна",
    "competitions": {
      "Пролетни 2023": 1.5
    },
    "competition_grades": {
      "Пролетни 2023": 1.0
    }
  },
  {
    "name": "Мария Даниелова Филкова",
    "grade": 9,
    "school": "ОУ",
    "city": "Варна",
    "competitions": {
      "Пролетни 2023": 0.5
    },
    "competition_grades": {
      "Пролетни 2023": 1.0
    }
  },
  {
    "name": "Александър Емилов Костадинов",
    "grade": 9,
    "school": "НПГПТО \"М. В. Ломоносов\"",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 0.0
    },
    "competition_grades": {
      "Пролетни 2025": 3.0
    }
  },
  {
    "name": "Раян Деянов Камаринчев",
    "grade": 10,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Пролетни 2025": 28.5,
      "Есенни 2024": 28.5,
      "Олимпиада 2024": 28.0,
      "Пролетни 2024": 19.0,
      "Есенни 2023": 25.5,
      "Олимпиада 2023": 15.0,
      "Есенни 2022": 12.0,
      "Олимпиада 2022": 19.4,
      "Пролетни 2022": 22.0,
      "Есенни 2021": 23.0
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Есенни 2022": 2.0,
      "Олимпиада 2022": 1.0,
      "Пролетни 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Стоян Йорданов Милев",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 29.25,
      "Есенни 2024": 18.0,
      "Олимпиада 2024": 25.0,
      "Пролетни 2024": 28.0,
      "Есенни 2023": 27.0,
      "Олимпиада 2023": 20.0,
      "Пролетни 2023": 16.0,
      "Есенни 2022": 29.0
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетни 2023": 2.0,
      "Есенни 2022": 2.0
    }
  },
  {
    "name": "Красимир Делчев Тухчиев",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 29.5,
      "Есенни 2024": 24.5,
      "Олимпиада 2024": 23.0,
      "Пролетни 2024": 22.0,
      "Есенни 2023": 27.25,
      "Олимпиада 2023": 18.5,
      "Пролетни 2023": 21.5
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетни 2023": 2.0
    }
  },
  {
    "name": "Мая Янева Минкова",
    "grade": 10,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Пролетни 2025": 20.5,
      "Есенни 2024": 21.0,
      "Олимпиада 2024": 26.0,
      "Пролетни 2024": 26.0,
      "Есенни 2023": 23.0,
      "Олимпиада 2023": 12.0,
      "Пролетни 2023": 13.5,
      "Есенни 2022": 19.5,
      "Пролетни 2022": 26.5
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетни 2023": 2.0,
      "Есенни 2022": 2.0,
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Виктория Тихомирова Данчева",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 27.5,
      "Есенни 2024": 14.0,
      "Олимпиада 2024": 30.0,
      "Пролетни 2024": 14.5,
      "Есенни 2023": 24.0,
      "Олимпиада 2023": 19.0,
      "Пролетни 2023": 17.5,
      "Пролетни 2022": 18.5
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетни 2023": 2.0,
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Теодор Бисеров Петров",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 22.0,
      "Есенни 2024": 16.5,
      "Олимпиада 2024": 22.0,
      "Пролетни 2024": 22.0,
      "Есенни 2023": 26.5,
      "Есенни 2022": 24.5,
      "Олимпиада 2022": 24.6,
      "Есенни 2021": 26.0
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0,
      "Есенни 2022": 2.0,
      "Олимпиада 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Нора Ивайлова Георгиева",
    "grade": 10,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 23.0,
      "Есенни 2024": 10.0,
      "Олимпиада 2024": 23.5,
      "Пролетни 2024": 21.0,
      "Есенни 2023": 21.0,
      "Олимпиада 2023": 19.0,
      "Пролетни 2023": 12.5,
      "Есенни 2022": 15.5,
      "Олимпиада 2022": 16.55,
      "Есенни 2021": 24.5
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетни 2023": 2.0,
      "Есенни 2022": 2.0,
      "Олимпиада 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Светослав Мартинов Цветанов",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 22.5,
      "Есенни 2024": 14.0,
      "Олимпиада 2024": 18.5,
      "Пролетни 2024": 23.0,
      "Есенни 2023": 27.75,
      "Пролетни 2023": 19.0,
      "Есенни 2022": 21.0,
      "Олимпиада 2022": 15.4,
      "Есенни 2021": 25.5
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0,
      "Пролетни 2023": 2.0,
      "Есенни 2022": 2.0,
      "Олимпиада 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Аделина Цветкова Доровска",
    "grade": 10,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 5.5,
      "Есенни 2024": 23.0,
      "Олимпиада 2024": 27.0,
      "Пролетни 2024": 27.0,
      "Есенни 2023": 24.75,
      "Олимпиада 2023": 19.0,
      "Пролетни 2023": 12.5,
      "Есенни 2022": 25.5,
      "Олимпиада 2022": 19.4,
      "Есенни 2021": 24.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетни 2023": 2.0,
      "Есенни 2022": 2.0,
      "Олимпиада 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Миглена Момчилова Меркулова",
    "grade": 10,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 23.0,
      "Есенни 2024": 25.5,
      "Пролетни 2024": 20.0,
      "Есенни 2023": 24.0,
      "Олимпиада 2023": 8.0,
      "Пролетни 2023": 15.5,
      "Есенни 2022": 8.0
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетни 2023": 2.0,
      "Есенни 2022": 2.0
    }
  },
  {
    "name": "Ирина Йорданова Йорданова",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 22.5,
      "Есенни 2024": 17.0,
      "Пролетни 2024": 22.5,
      "Есенни 2023": 23.0,
      "Олимпиада 2023": 14.0,
      "Пролетни 2023": 26.0
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетни 2023": 2.0
    }
  },
  {
    "name": "Борис Димитров Ангелов",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 29.0,
      "Есенни 2024": 19.5,
      "Олимпиада 2024": 22.5,
      "Олимпиада 2022": 11.5,
      "Есенни 2021": 23.0
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Олимпиада 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Красимир Станиславов Станков",
    "grade": 10,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2025": 19.75,
      "Есенни 2024": 16.0,
      "Олимпиада 2024": 17.0,
      "Пролетни 2024": 15.5,
      "Есенни 2023": 21.0,
      "Пролетни 2023": 12.0,
      "Есенни 2022": 8.5
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0,
      "Пролетни 2023": 2.0,
      "Есенни 2022": 2.0
    }
  },
  {
    "name": "Владимир Мартинов Цветанов",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 20.0,
      "Есенни 2024": 11.5,
      "Олимпиада 2024": 22.5,
      "Пролетни 2024": 7.0,
      "Есенни 2023": 16.5,
      "Олимпиада 2023": 17.5,
      "Пролетни 2023": 19.5
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетни 2023": 2.0
    }
  },
  {
    "name": "Алекс Мартинов Киричев",
    "grade": 10,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 16.25,
      "Есенни 2024": 6.5,
      "Олимпиада 2024": 17.5,
      "Пролетни 2024": 11.0,
      "Есенни 2023": 19.0,
      "Олимпиада 2023": 13.0,
      "Пролетни 2023": 7.5,
      "Есенни 2022": 20.25,
      "Олимпиада 2022": 17.8,
      "Пролетни 2022": 19.0,
      "Есенни 2021": 22.5
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетни 2023": 2.0,
      "Есенни 2022": 2.0,
      "Олимпиада 2022": 1.0,
      "Пролетни 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Теодор Свиленов Илев",
    "grade": 10,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 26.0,
      "Есенни 2024": 15.5,
      "Пролетни 2024": 15.0,
      "Есенни 2023": 22.0
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0
    }
  },
  {
    "name": "Дона Иванова Димова",
    "grade": 10,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 16.25,
      "Есенни 2024": 7.5,
      "Олимпиада 2024": 21.5,
      "Пролетни 2024": 17.0,
      "Есенни 2023": 12.0,
      "Пролетни 2023": 10.5,
      "Есенни 2022": 7.5
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0,
      "Пролетни 2023": 2.0,
      "Есенни 2022": 2.0
    }
  },
  {
    "name": "Искрен Христов Нинов",
    "grade": 10,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2025": 18.75,
      "Есенни 2024": 19.5,
      "Пролетни 2024": 15.5,
      "Олимпиада 2022": 18.1,
      "Пролетни 2022": 25.5,
      "Есенни 2021": 22.5
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Пролетни 2024": 3.0,
      "Олимпиада 2022": 1.0,
      "Пролетни 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Цветелина Иванова Бакалова",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 28.5,
      "Олимпиада 2024": 23.0,
      "Пролетни 2022": 17.0
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Олимпиада 2024": 3.0,
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Никола Димитров Лилов",
    "grade": 10,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенни 2024": 10.5,
      "Олимпиада 2024": 20.5,
      "Есенни 2023": 23.0,
      "Пролетни 2023": 11.0,
      "Есенни 2022": 17.0,
      "Олимпиада 2022": 21.0,
      "Пролетни 2022": 23.5,
      "Есенни 2021": 26.0
    },
    "competition_grades": {
      "Есенни 2024": 4.0,
      "Олимпиада 2024": 3.0,
      "Есенни 2023": 3.0,
      "Пролетни 2023": 2.0,
      "Есенни 2022": 2.0,
      "Олимпиада 2022": 1.0,
      "Пролетни 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Димитър Росенов Йовчев",
    "grade": 10,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 15.0,
      "Есенни 2024": 11.0,
      "Пролетни 2024": 10.5,
      "Есенни 2023": 18.5
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0
    }
  },
  {
    "name": "Ярослав Михайлович Басков",
    "grade": 10,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2024": 27.0,
      "Пролетни 2024": 17.5,
      "Есенни 2023": 18.5
    },
    "competition_grades": {
      "Есенни 2024": 4.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0
    }
  },
  {
    "name": "Калин Христов Кирилов",
    "grade": 10,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 10.5,
      "Есенни 2024": 13.0,
      "Есенни 2023": 24.0,
      "Есенни 2022": 21.5,
      "Олимпиада 2022": 12.0,
      "Есенни 2021": 22.5
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 4.0,
      "Есенни 2023": 3.0,
      "Есенни 2022": 2.0,
      "Олимпиада 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Станислав Каменов Янков",
    "grade": 10,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2024": 20.0,
      "Есенни 2023": 22.0,
      "Олимпиада 2023": 22.0,
      "Пролетни 2023": 18.0,
      "Есенни 2022": 22.0,
      "Олимпиада 2022": 18.5,
      "Пролетни 2022": 26.0,
      "Есенни 2021": 23.0
    },
    "competition_grades": {
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетни 2023": 2.0,
      "Есенни 2022": 2.0,
      "Олимпиада 2022": 1.0,
      "Пролетни 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Йоан Димитров Димитров",
    "grade": 10,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 12.5,
      "Есенни 2024": 11.5,
      "Есенни 2023": 21.75,
      "Пролетни 2023": 8.5
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Есенни 2023": 3.0,
      "Пролетни 2023": 2.0
    }
  },
  {
    "name": "Георги Минчев Калбаков",
    "grade": 10,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 24.5,
      "Пролетни 2024": 11.5
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Пролетни 2024": 3.0
    }
  },
  {
    "name": "Ева Иво Николова",
    "grade": 10,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 15.0,
      "Пролетни 2024": 13.5,
      "Есенни 2023": 11.0,
      "Пролетни 2023": 12.5,
      "Есенни 2022": 6.5
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0,
      "Пролетни 2023": 2.0,
      "Есенни 2022": 2.0
    }
  },
  {
    "name": "Бисер Бисеров Дойчинов",
    "grade": 10,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 10.7,
      "Есенни 2024": 5.5,
      "Пролетни 2024": 9.5,
      "Есенни 2023": 19.0,
      "Есенни 2022": 7.5,
      "Пролетни 2022": 15.0
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0,
      "Есенни 2022": 2.0,
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Калоян Панчов Панчовски",
    "grade": 10,
    "school": "Първа езикова гимназия",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 21.5,
      "Есенни 2024": 6.5
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0
    }
  },
  {
    "name": "Мартин Иванов Димов",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 21.5,
      "Есенни 2023": 18.0,
      "Пролетни 2023": 14.5,
      "Есенни 2022": 17.0,
      "Олимпиада 2022": 14.2,
      "Есенни 2021": 26.0
    },
    "competition_grades": {
      "Олимпиада 2024": 3.0,
      "Есенни 2023": 3.0,
      "Пролетни 2023": 2.0,
      "Есенни 2022": 2.0,
      "Олимпиада 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Яна Павлинова Вутова",
    "grade": 10,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 8.75,
      "Есенни 2024": 12.5,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 11.5
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0
    }
  },
  {
    "name": "Даниел Валентинов Узунов",
    "grade": 10,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2024": 15.0,
      "Пролетни 2024": 12.5,
      "Есенни 2023": 21.0
    },
    "competition_grades": {
      "Есенни 2024": 4.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0
    }
  },
  {
    "name": "Иван Антониев Дойчев",
    "grade": 10,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 8.5,
      "Пролетни 2024": 17.0,
      "Олимпиада 2023": 5.0,
      "Есенни 2022": 20.0
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Пролетни 2024": 3.0,
      "Олимпиада 2023": 2.0,
      "Есенни 2022": 2.0
    }
  },
  {
    "name": "Велизар Николаев Ангелов",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2024": 18.0,
      "Есенни 2023": 18.5,
      "Олимпиада 2023": 8.5,
      "Пролетни 2023": 13.0
    },
    "competition_grades": {
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0,
      "Олимпиада 2023": 2.0,
      "Пролетни 2023": 2.0
    }
  },
  {
    "name": "Мирослава Мирославова Венелинова",
    "grade": 10,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 4.75,
      "Есенни 2024": 4.0,
      "Пролетни 2024": 10.0,
      "Есенни 2023": 15.0,
      "Есенни 2022": 2.0
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0,
      "Есенни 2022": 2.0
    }
  },
  {
    "name": "Георги Георгиев Шиндаров",
    "grade": 10,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 8.2,
      "Есенни 2024": 9.0
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0
    }
  },
  {
    "name": "Александра Пламенова Попова",
    "grade": 10,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2024": 13.5,
      "Есенни 2023": 9.5,
      "Пролетни 2023": 14.5,
      "Есенни 2022": 12.0,
      "Пролетни 2022": 24.5
    },
    "competition_grades": {
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0,
      "Пролетни 2023": 2.0,
      "Есенни 2022": 2.0,
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Валентин Кирилов Кирилов",
    "grade": 10,
    "school": "ППМГ \"Никола Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Есенни 2024": 12.5,
      "Пролетни 2024": 10.0
    },
    "competition_grades": {
      "Есенни 2024": 4.0,
      "Пролетни 2024": 3.0
    }
  },
  {
    "name": "Андрей Здравков Стефанов",
    "grade": 10,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 16.5,
      "Олимпиада 2023": 18.0
    },
    "competition_grades": {
      "Олимпиада 2024": 3.0,
      "Олимпиада 2023": 2.0
    }
  },
  {
    "name": "Даниел Николаев Гетов",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2023": 25.75,
      "Олимпиада 2023": 21.5
    },
    "competition_grades": {
      "Есенни 2023": 3.0,
      "Олимпиада 2023": 2.0
    }
  },
  {
    "name": "Александър Атанасов Бангачев",
    "grade": 10,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2024": 19.5,
      "Олимпиада 2023": 12.0,
      "Есенни 2022": 11.0
    },
    "competition_grades": {
      "Пролетни 2024": 3.0,
      "Олимпиада 2023": 2.0,
      "Есенни 2022": 2.0
    }
  },
  {
    "name": "Олександр Олександров Виниченко",
    "grade": 10,
    "school": "ПГКПИ",
    "city": "Бургас",
    "competitions": {
      "Есенни 2024": 16.5
    },
    "competition_grades": {
      "Есенни 2024": 4.0
    }
  },
  {
    "name": "Росен Светлинов Манов",
    "grade": 10,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 11.5
    },
    "competition_grades": {
      "Пролетни 2025": 4.0
    }
  },
  {
    "name": "Лазар Боянов Цветков",
    "grade": 10,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2024": 11.0,
      "Пролетни 2024": 6.0
    },
    "competition_grades": {
      "Есенни 2024": 4.0,
      "Пролетни 2024": 3.0
    }
  },
  {
    "name": "Алекс Бисеров Иванов",
    "grade": 10,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2025": 6.7,
      "Пролетни 2024": 5.5,
      "Есенни 2023": 5.0
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0
    }
  },
  {
    "name": "Никола Венциславов Гашев",
    "grade": 10,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 3.5,
      "Пролетни 2024": 11.5,
      "Пролетни 2022": 25.0
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Пролетни 2024": 3.0,
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Димитър Тихомиров Данчев",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2023": 20.0,
      "Пролетни 2023": 10.5,
      "Пролетни 2022": 19.5
    },
    "competition_grades": {
      "Есенни 2023": 3.0,
      "Пролетни 2023": 2.0,
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Мария Касия Людмилова Петрова",
    "grade": 10,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2023": 11.5,
      "Есенни 2022": 17.75,
      "Олимпиада 2022": 15.5,
      "Пролетни 2022": 25.0,
      "Есенни 2021": 26.0
    },
    "competition_grades": {
      "Пролетни 2023": 2.0,
      "Есенни 2022": 2.0,
      "Олимпиада 2022": 1.0,
      "Пролетни 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Симеон Цветомиртов Цановски",
    "grade": 10,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 9.25
    },
    "competition_grades": {
      "Пролетни 2025": 4.0
    }
  },
  {
    "name": "Лъчезар Красимиров Точев",
    "grade": 10,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 3.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 2.0
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0,
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0
    }
  },
  {
    "name": "Валерия Павлинова Петрова",
    "grade": 10,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2024": 11.5,
      "Есенни 2023": 13.5
    },
    "competition_grades": {
      "Пролетни 2024": 3.0,
      "Есенни 2023": 3.0
    }
  },
  {
    "name": "Калоян Милен Драганов",
    "grade": 10,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Есенни 2023": 14.0,
      "Олимпиада 2022": 16.5,
      "Пролетни 2022": 20.5,
      "Есенни 2021": 25.0
    },
    "competition_grades": {
      "Есенни 2023": 3.0,
      "Олимпиада 2022": 1.0,
      "Пролетни 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Антоан Антоан Богданов",
    "grade": 10,
    "school": "МГ,, Акад. Кирил Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2024": 6.5,
      "Пролетни 2024": 5.0
    },
    "competition_grades": {
      "Есенни 2024": 4.0,
      "Пролетни 2024": 3.0
    }
  },
  {
    "name": "Ана-Мария Тончо Добрева",
    "grade": 10,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетни 2025": 3.5,
      "Пролетни 2024": 7.5
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Пролетни 2024": 3.0
    }
  },
  {
    "name": "Максимилиан Станиславов Хайдутов",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 19.0,
      "Есенни 2022": 15.5
    },
    "competition_grades": {
      "Олимпиада 2023": 2.0,
      "Есенни 2022": 2.0
    }
  },
  {
    "name": "Божидар Десиславов Станев",
    "grade": 10,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2024": 8.5,
      "Пролетни 2022": 22.0
    },
    "competition_grades": {
      "Пролетни 2024": 3.0,
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Божидар Цветанов Дончев",
    "grade": 10,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетни 2023": 9.5,
      "Есенни 2022": 14.5,
      "Пролетни 2022": 21.0
    },
    "competition_grades": {
      "Пролетни 2023": 2.0,
      "Есенни 2022": 2.0,
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Явор Тошков Василев",
    "grade": 10,
    "school": "ППМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Есенни 2024": 6.0
    },
    "competition_grades": {
      "Есенни 2024": 4.0
    }
  },
  {
    "name": "Анна Томова Янакиева",
    "grade": 10,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 18.0
    },
    "competition_grades": {
      "Олимпиада 2023": 2.0
    }
  },
  {
    "name": "Константин Николов Младенов",
    "grade": 10,
    "school": "ЕГ \"Акад. Л. Стоянов\"",
    "city": "Благоевград",
    "competitions": {
      "Есенни 2024": 5.5
    },
    "competition_grades": {
      "Есенни 2024": 4.0
    }
  },
  {
    "name": "Цветомир Василев Смилов",
    "grade": 10,
    "school": "ППМГ \"Никола Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Есенни 2024": 5.5
    },
    "competition_grades": {
      "Есенни 2024": 4.0
    }
  },
  {
    "name": "Георгиос Ефстатиос Титопулос",
    "grade": 10,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Есенни 2023": 13.0
    },
    "competition_grades": {
      "Есенни 2023": 3.0
    }
  },
  {
    "name": "Лисалоте Пейтърова Бонсма",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2023": 12.0
    },
    "competition_grades": {
      "Есенни 2023": 3.0
    }
  },
  {
    "name": "Мария Калинова Ганева",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 22.8,
      "Есенни 2021": 25.0
    },
    "competition_grades": {
      "Олимпиада 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Иван Стоилов Стоилов",
    "grade": 10,
    "school": "ЕГ \"Хр. Ботев\"",
    "city": "Кърджали",
    "competitions": {
      "Пролетни 2024": 8.0
    },
    "competition_grades": {
      "Пролетни 2024": 3.0
    }
  },
  {
    "name": "Симеон Иванов Петков",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 17.35,
      "Есенни 2021": 28.0
    },
    "competition_grades": {
      "Олимпиада 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Ния Боянова Иванова",
    "grade": 10,
    "school": "ППМГ \"Никола Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Есенни 2023": 10.0
    },
    "competition_grades": {
      "Есенни 2023": 3.0
    }
  },
  {
    "name": "Християн Маргаритов Маргаритов",
    "grade": 10,
    "school": "ОУ \"П.Р.Славейков\"",
    "city": "Варна",
    "competitions": {
      "Олимпиада 2022": 17.2,
      "Есенни 2021": 23.0
    },
    "competition_grades": {
      "Олимпиада 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Александър Ивов Кръстанов",
    "grade": 10,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 1.5,
      "Есенни 2024": 2.0
    },
    "competition_grades": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 4.0
    }
  },
  {
    "name": "Радост Николова Тошева",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 13.9,
      "Есенни 2021": 26.0
    },
    "competition_grades": {
      "Олимпиада 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Лиор Яков Майер",
    "grade": 10,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2023": 9.0
    },
    "competition_grades": {
      "Есенни 2023": 3.0
    }
  },
  {
    "name": "Васил Ангелов Ангелов",
    "grade": 10,
    "school": "51 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 13.3,
      "Есенни 2021": 25.0
    },
    "competition_grades": {
      "Олимпиада 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Боян Емилов Леондиев",
    "grade": 10,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2023": 10.5,
      "Есенни 2022": 6.5
    },
    "competition_grades": {
      "Пролетни 2023": 2.0,
      "Есенни 2022": 2.0
    }
  },
  {
    "name": "Илина Теодорова Пашкунова",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 12.8,
      "Есенни 2021": 25.0
    },
    "competition_grades": {
      "Олимпиада 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Елица Христова Декова",
    "grade": 10,
    "school": "134 СУ Димчо Дебелянов",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 13.7,
      "Есенни 2021": 22.0
    },
    "competition_grades": {
      "Олимпиада 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Ирина Цветанова Тошева",
    "grade": 10,
    "school": "СУ Васил Левски",
    "city": "Елин Пелин",
    "competitions": {
      "Олимпиада 2022": 11.6,
      "Есенни 2021": 25.5
    },
    "competition_grades": {
      "Олимпиада 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Тео Георгиев Георгиев",
    "grade": 10,
    "school": "107 ОУ \"Хан Крум\"",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 12.2,
      "Есенни 2021": 22.0
    },
    "competition_grades": {
      "Олимпиада 2022": 1.0,
      "Есенни 2021": 1.0
    }
  },
  {
    "name": "Богомил Мирославов Цанков",
    "grade": 10,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенни 2024": 3.0
    },
    "competition_grades": {
      "Есенни 2024": 4.0
    }
  },
  {
    "name": "Виктория Веселинова Горова",
    "grade": 10,
    "school": "СГСАГ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Есенни 2024": 3.0
    },
    "competition_grades": {
      "Есенни 2024": 4.0
    }
  },
  {
    "name": "Дарина Димитрова Кичукова",
    "grade": 10,
    "school": "МГ \"Акад. Кирил Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2024": 3.0
    },
    "competition_grades": {
      "Есенни 2024": 4.0
    }
  },
  {
    "name": "Димитър Мартинов Димитров",
    "grade": 10,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2024": 2.0,
      "Пролетни 2023": 7.0
    },
    "competition_grades": {
      "Пролетни 2024": 3.0,
      "Пролетни 2023": 2.0
    }
  },
  {
    "name": "Теодор Цветославов Петков",
    "grade": 10,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетни 2023": 6.0,
      "Пролетни 2022": 13.5
    },
    "competition_grades": {
      "Пролетни 2023": 2.0,
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Алекс Владимиров Речников",
    "grade": 10,
    "school": "ППМГ \"Васил Левски\"",
    "city": "Смолян",
    "competitions": {
      "Пролетни 2024": 4.5
    },
    "competition_grades": {
      "Пролетни 2024": 3.0
    }
  },
  {
    "name": "Вера Мартинова Дуковска",
    "grade": 10,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2024": 4.5
    },
    "competition_grades": {
      "Пролетни 2024": 3.0
    }
  },
  {
    "name": "Луиза Стоилова Манолова",
    "grade": 10,
    "school": "СУ 'Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Пролетни 2024": 4.5
    },
    "competition_grades": {
      "Пролетни 2024": 3.0
    }
  },
  {
    "name": "Теодора Димитрова Кьосева",
    "grade": 10,
    "school": "ЧЕГ \"Проф. Иван Апостолов\"",
    "city": "София",
    "competitions": {
      "Есенни 2023": 6.0
    },
    "competition_grades": {
      "Есенни 2023": 3.0
    }
  },
  {
    "name": "Евгений Александрович Кашкин",
    "grade": 10,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2023": 5.5
    },
    "competition_grades": {
      "Есенни 2023": 3.0
    }
  },
  {
    "name": "Ана-Никол Ивелинова Златарова",
    "grade": 10,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2024": 4.0
    },
    "competition_grades": {
      "Пролетни 2024": 3.0
    }
  },
  {
    "name": "Лилия Георгиева Димитрова",
    "grade": 10,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2024": 4.0
    },
    "competition_grades": {
      "Пролетни 2024": 3.0
    }
  },
  {
    "name": "Магдалена Петрова Петрова",
    "grade": 10,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2022": 21.5
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Калина Стефанова Колева",
    "grade": 10,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2023": 5.0
    },
    "competition_grades": {
      "Есенни 2023": 3.0
    }
  },
  {
    "name": "Стилян Веселинов Атанасов",
    "grade": 10,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2022": 19.0
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Александър Мартинов Йосифов",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 18.5
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Огнян Огнянов Ганчев",
    "grade": 10,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2022": 18.5
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Кристиан Мариан Неделчев",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 18.0
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Мартин Калинов Филипов",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 18.0
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Димитър Христов Тодоров",
    "grade": 10,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2022": 17.0
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Дарин Ивайлов Димитров",
    "grade": 10,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетни 2022": 15.5
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Томислав Димитров Томов",
    "grade": 10,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2022": 15.5
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Елена Мариянова Димитрова",
    "grade": 10,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2022": 15.0
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Стефан Дениславов Костов",
    "grade": 10,
    "school": "ППМГ \"Васил Левски\"",
    "city": "Смолян",
    "competitions": {
      "Пролетни 2024": 2.5
    },
    "competition_grades": {
      "Пролетни 2024": 3.0
    }
  },
  {
    "name": "Невена Валентинова Гечевска",
    "grade": 10,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2022": 13.5
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Евгени Богданов Димитров",
    "grade": 10,
    "school": "ППМГ",
    "city": "Ловеч",
    "competitions": {
      "Пролетни 2025": 1.0
    },
    "competition_grades": {
      "Пролетни 2025": 4.0
    }
  },
  {
    "name": "Теодор Кирилов Хинков",
    "grade": 10,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2022": 13.0
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Христос Елиас Хенди",
    "grade": 10,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Несебър",
    "competitions": {
      "Есенни 2023": 3.0
    },
    "competition_grades": {
      "Есенни 2023": 3.0
    }
  },
  {
    "name": "Ясен Ясенов Янев",
    "grade": 10,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2022": 7.0
    },
    "competition_grades": {
      "Есенни 2022": 2.0
    }
  },
  {
    "name": "Йоана Велинова Гетова",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 12.0
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Мартин Николаев Василевски",
    "grade": 10,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2023": 5.0
    },
    "competition_grades": {
      "Пролетни 2023": 2.0
    }
  },
  {
    "name": "Стефан Иванов Дончев",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 11.0
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Дарина Николова Караиванова",
    "grade": 10,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2022": 10.5
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Калоян Максимов Кръстев",
    "grade": 10,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2022": 10.5
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Александър Мирославов Колев",
    "grade": 10,
    "school": "ПГКПИ",
    "city": "Бургас",
    "competitions": {
      "Есенни 2024": 1.0
    },
    "competition_grades": {
      "Есенни 2024": 4.0
    }
  },
  {
    "name": "Денислав Ивелинов Димов",
    "grade": 10,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2022": 8.5
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Михаил Михайлов Бояджиев",
    "grade": 10,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Пролетни 2022": 8.5
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Стефани Николаева Коновска",
    "grade": 10,
    "school": "СУ \"Иван Вазов\"",
    "city": "Вършец",
    "competitions": {
      "Пролетни 2022": 8.5
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Невена Валериева Русева",
    "grade": 10,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2023": 2.0
    },
    "competition_grades": {
      "Есенни 2023": 3.0
    }
  },
  {
    "name": "Иван Красен Пенков",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 7.5
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Христомира Христова Иванова",
    "grade": 10,
    "school": "СУ \"Иван Вазов\"",
    "city": "Вършец",
    "competitions": {
      "Пролетни 2022": 7.0
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Йоан Николаев Маджаров",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 6.5
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Габриела Иванова Тенева",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 6.0
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Ива Владимирова Иванова",
    "grade": 10,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2022": 4.5
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Сиян Дафин Кирилов",
    "grade": 10,
    "school": "5 ОУ \"Иван Вазов\"",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 4.5
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Цветияна Бориславова Борисова",
    "grade": 10,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2022": 4.5
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Мария Николаева Цанева",
    "grade": 10,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2023": 1.0
    },
    "competition_grades": {
      "Есенни 2023": 3.0
    }
  },
  {
    "name": "Никол Николаева Станева",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 2.5
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Александър Тодоров Горанов",
    "grade": 10,
    "school": "СУ \"Иван Вазов\"",
    "city": "Вършец",
    "competitions": {
      "Пролетни 2022": 2.0
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Деница Венциславова Стефанова",
    "grade": 10,
    "school": "5 ОУ \"Иван Вазов\"",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 1.0
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Никола Маринов Хубенов",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 0.5
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Николай Светославов Стратиев",
    "grade": 10,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 0.5
    },
    "competition_grades": {
      "Пролетни 2022": 1.0
    }
  },
  {
    "name": "Христо Атанасов Христов",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 29.6,
      "Есенни 2024": 26.5,
      "Олимпиада 2024": 28.5,
      "Пролетни 2024": 28.25,
      "Есенни 2023": 16.0,
      "Олимпиада 2023": 13.0,
      "Пролетни 2023": 30.0,
      "Есенни 2022": 26.5,
      "Олимпиада 2022": 12.0,
      "Пролетни 2022": 23.5,
      "Есенни 2021": 27.5,
      "Олимпиада 2021": 22.5,
      "2  кръг 2021": 25.5
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Олимпиада 2024": 4.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетни 2022": 2.0,
      "Есенни 2021": 2.0,
      "Олимпиада 2021": 1.0,
      "2  кръг 2021": 1.0
    }
  },
  {
    "name": "Калоян Антонов Тодоров",
    "grade": 11,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2025": 25.4,
      "Есенни 2024": 20.0,
      "Олимпиада 2024": 47.0,
      "Пролетни 2024": 11.3,
      "Есенни 2023": 21.5,
      "Олимпиада 2023": 47.0,
      "Пролетни 2023": 9.0,
      "Есенни 2022": 25.0,
      "Олимпиада 2022": 13.5,
      "Пролетни 2022": 29.0,
      "Есенни 2021": 30.0,
      "Пролетни 2021": 20.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 7.0,
      "Есенни 2023": 7.0,
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 7.0,
      "Есенни 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетни 2022": 2.0,
      "Есенни 2021": 2.0,
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Димитър Емилов Бегов",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 19.5,
      "Есенни 2024": 17.5,
      "Олимпиада 2024": 21.5,
      "Пролетни 2024": 29.5,
      "Есенни 2023": 16.0,
      "Олимпиада 2023": 27.0,
      "Пролетни 2023": 29.25,
      "Есенни 2022": 30.0,
      "Олимпиада 2022": 16.0,
      "Пролетни 2022": 30.0,
      "Есенни 2021": 30.0,
      "Олимпиада 2021": 26.0,
      "Пролетни 2021": 30.0,
      "2  кръг 2021": 26.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Олимпиада 2024": 4.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетни 2022": 2.0,
      "Есенни 2021": 2.0,
      "Олимпиада 2021": 1.0,
      "Пролетни 2021": 1.0,
      "2  кръг 2021": 1.0
    }
  },
  {
    "name": "Никола Нинков Нинков",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 26.0,
      "Есенни 2024": 22.25,
      "Олимпиада 2024": 22.5,
      "Пролетни 2024": 28.0,
      "Есенни 2023": 12.5,
      "Олимпиада 2023": 25.5,
      "Пролетни 2023": 29.0,
      "Пролетни 2022": 26.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Олимпиада 2024": 4.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетни 2023": 3.0,
      "Пролетни 2022": 2.0
    }
  },
  {
    "name": "Николай Христов Хранов",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 18.0,
      "Есенни 2024": 19.5,
      "Олимпиада 2024": 23.5,
      "Пролетни 2024": 20.5,
      "Есенни 2023": 23.0,
      "Олимпиада 2023": 21.0,
      "Пролетни 2023": 20.0,
      "Есенни 2022": 25.5,
      "Олимпиада 2022": 10.0,
      "Пролетни 2022": 25.0,
      "Есенни 2021": 26.5,
      "Пролетни 2021": 27.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Олимпиада 2024": 4.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетни 2022": 2.0,
      "Есенни 2021": 2.0,
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Александър Николаев Николов",
    "grade": 11,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 21.9,
      "Есенни 2024": 21.0,
      "Олимпиада 2024": 27.5,
      "Пролетни 2024": 3.8,
      "Есенни 2023": 30.0,
      "Пролетни 2023": 28.5,
      "Есенни 2022": 26.5,
      "Олимпиада 2022": 14.5,
      "Есенни 2021": 30.0,
      "Олимпиада 2021": 27.0,
      "2  кръг 2021": 28.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Олимпиада 2024": 4.0,
      "Пролетни 2024": 7.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Есенни 2021": 2.0,
      "Олимпиада 2021": 1.0,
      "2  кръг 2021": 1.0
    }
  },
  {
    "name": "Васил Ангелов Цикалов",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 14.0,
      "Есенни 2024": 13.5,
      "Олимпиада 2024": 29.0,
      "Пролетни 2024": 28.0,
      "Есенни 2023": 17.0,
      "Олимпиада 2023": 15.5,
      "Пролетни 2023": 28.0,
      "Есенни 2022": 28.5,
      "Олимпиада 2022": 0.0,
      "Пролетни 2022": 20.0,
      "Есенни 2021": 30.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Олимпиада 2024": 4.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетни 2022": 2.0,
      "Есенни 2021": 2.0
    }
  },
  {
    "name": "Богдан Добромиров Георгиев",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 22.5,
      "Есенни 2024": 12.5,
      "Олимпиада 2024": 26.0,
      "Пролетни 2024": 28.0,
      "Олимпиада 2023": 9.0,
      "Пролетни 2021": 28.5
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Олимпиада 2024": 4.0,
      "Пролетни 2024": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Михаил Георгиев Гочев",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 14.2,
      "Есенни 2024": 12.5,
      "Олимпиада 2024": 14.0,
      "Пролетни 2024": 25.5,
      "Есенни 2023": 22.0,
      "Пролетни 2023": 29.0,
      "Есенни 2022": 18.0,
      "Олимпиада 2022": 6.0,
      "Пролетни 2022": 18.0,
      "Есенни 2021": 27.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетни 2022": 2.0,
      "Есенни 2021": 2.0
    }
  },
  {
    "name": "Михаела Деянова Колева",
    "grade": 11,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2025": 13.4,
      "Есенни 2024": 4.0,
      "Олимпиада 2024": 28.0,
      "Пролетни 2024": 21.5,
      "Есенни 2023": 15.0,
      "Олимпиада 2023": 18.0,
      "Пролетни 2023": 28.75,
      "Есенни 2022": 29.5
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Олимпиада 2024": 4.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Атанас Георгиев Гочев",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 7.6,
      "Есенни 2024": 13.0,
      "Олимпиада 2024": 16.25,
      "Пролетни 2024": 26.0,
      "Есенни 2023": 27.25,
      "Пролетни 2023": 28.75,
      "Есенни 2022": 21.0,
      "Олимпиада 2022": 10.0,
      "Пролетни 2022": 19.0,
      "Есенни 2021": 28.5
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетни 2022": 2.0,
      "Есенни 2021": 2.0
    }
  },
  {
    "name": "Калоян Тодоров Стефанов",
    "grade": 11,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 14.5,
      "Есенни 2024": 15.0,
      "Олимпиада 2024": 21.5,
      "Пролетни 2024": 28.5,
      "Есенни 2023": 17.5
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Олимпиада 2024": 4.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0
    }
  },
  {
    "name": "Владимира Владимирова Георгиева",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 21.5,
      "Есенни 2024": 11.5,
      "Олимпиада 2024": 24.0,
      "Пролетни 2024": 26.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Олимпиада 2024": 4.0,
      "Пролетни 2024": 4.0
    }
  },
  {
    "name": "Александър Росенов Ненов",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 18.0,
      "Есенни 2024": 6.0,
      "Пролетни 2024": 28.5,
      "Есенни 2023": 14.5,
      "Олимпиада 2023": 21.5,
      "Пролетни 2023": 25.0,
      "Есенни 2022": 21.5,
      "Пролетни 2022": 25.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0,
      "Пролетни 2022": 2.0
    }
  },
  {
    "name": "Константин Константинов Стойчев",
    "grade": 11,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 17.0,
      "Есенни 2024": 11.5,
      "Олимпиада 2024": 17.0,
      "Пролетни 2024": 20.0,
      "Есенни 2023": 15.5,
      "Есенни 2022": 20.0,
      "Олимпиада 2021": 20.0,
      "2  кръг 2021": 23.5
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Олимпиада 2024": 4.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Есенни 2022": 3.0,
      "Олимпиада 2021": 1.0,
      "2  кръг 2021": 1.0
    }
  },
  {
    "name": "Марио Величков Борилов",
    "grade": 11,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Пролетни 2025": 20.5,
      "Есенни 2024": 18.0,
      "Пролетни 2024": 26.5,
      "Есенни 2023": 11.0,
      "Пролетни 2023": 21.5
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0
    }
  },
  {
    "name": "Боян Иванов Иванов",
    "grade": 11,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2025": 25.0,
      "Есенни 2024": 12.5,
      "Пролетни 2024": 23.0,
      "Пролетни 2023": 16.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Пролетни 2024": 4.0,
      "Пролетни 2023": 3.0
    }
  },
  {
    "name": "Дамян Калинов Петров",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 2.0,
      "Есенни 2024": 4.0,
      "Олимпиада 2024": 26.5,
      "Пролетни 2024": 28.75,
      "Есенни 2023": 10.0,
      "Пролетни 2023": 28.0,
      "Есенни 2022": 17.0,
      "Олимпиада 2022": 1.0,
      "Пролетни 2022": 25.5,
      "Есенни 2021": 27.0,
      "Пролетни 2021": 11.5
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Олимпиада 2024": 4.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетни 2022": 2.0,
      "Есенни 2021": 2.0,
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Пресиян Петров Петров",
    "grade": 11,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2025": 8.0,
      "Есенни 2024": 12.5,
      "Олимпиада 2024": 27.5,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 25.0,
      "Есенни 2022": 20.5,
      "Олимпиада 2022": 8.0,
      "Пролетни 2022": 14.0,
      "Есенни 2021": 29.5
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Олимпиада 2024": 4.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетни 2022": 2.0,
      "Есенни 2021": 2.0
    }
  },
  {
    "name": "Валентин Николаев Филипов",
    "grade": 11,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2025": 10.5,
      "Есенни 2024": 10.25,
      "Олимпиада 2024": 27.5,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 26.0,
      "Есенни 2022": 26.0,
      "Олимпиада 2021": 23.0,
      "2  кръг 2021": 20.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Олимпиада 2024": 4.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0,
      "Олимпиада 2021": 1.0,
      "2  кръг 2021": 1.0
    }
  },
  {
    "name": "Георги Кирилов Момчилов",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 14.0,
      "Есенни 2024": 12.0,
      "Пролетни 2024": 22.0,
      "Есенни 2023": 9.0,
      "Пролетни 2023": 27.0,
      "Пролетни 2022": 25.0,
      "Пролетни 2021": 17.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Пролетни 2022": 2.0,
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Стефан Ивов Радославов",
    "grade": 11,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 10.5,
      "Есенни 2024": 4.0,
      "Пролетни 2024": 18.5,
      "Есенни 2023": 18.75,
      "Олимпиада 2023": 22.5,
      "Пролетни 2023": 28.0,
      "Есенни 2022": 24.0,
      "Пролетни 2022": 14.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 7.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0,
      "Пролетни 2022": 2.0
    }
  },
  {
    "name": "Теодор Спасов Златанов",
    "grade": 11,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2025": 16.5,
      "Есенни 2024": 9.5,
      "Пролетни 2024": 26.5,
      "Пролетни 2023": 28.5
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Пролетни 2024": 4.0,
      "Пролетни 2023": 3.0
    }
  },
  {
    "name": "Петър Мирчев Попов",
    "grade": 11,
    "school": "ПМГ \"Яне Сандански\"",
    "city": "Гоце Делчев",
    "competitions": {
      "Пролетни 2025": 4.0,
      "Есенни 2024": 10.0,
      "Олимпиада 2024": 29.5,
      "Есенни 2023": 11.0,
      "Пролетни 2023": 26.5,
      "Пролетни 2022": 20.0,
      "Пролетни 2021": 21.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Олимпиада 2024": 4.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Пролетни 2022": 2.0,
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Калоян Иванов Иванов",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 13.0,
      "Есенни 2024": 17.0,
      "Пролетни 2024": 13.0,
      "Есенни 2023": 5.0,
      "Пролетни 2023": 19.0,
      "Есенни 2022": 9.5
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Игнат Валери Матеев",
    "grade": 11,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2025": 16.0,
      "Есенни 2024": 9.0,
      "Пролетни 2024": 15.0,
      "Есенни 2023": 7.5,
      "Пролетни 2023": 19.0,
      "Есенни 2022": 11.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Максим Александър Дерижан",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 8.0,
      "Есенни 2024": 7.75,
      "Пролетни 2024": 25.5,
      "Есенни 2023": 17.75,
      "Есенни 2022": 6.5,
      "Олимпиада 2022": 11.0,
      "Пролетни 2022": 17.5,
      "Есенни 2021": 27.5
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Есенни 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетни 2022": 2.0,
      "Есенни 2021": 2.0
    }
  },
  {
    "name": "Атанас Руменов Василев",
    "grade": 11,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2025": 9.0,
      "Есенни 2024": 10.0,
      "Пролетни 2024": 16.0,
      "Есенни 2023": 12.5,
      "Пролетни 2023": 26.0,
      "Есенни 2022": 20.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Адел Бохос Карагьозян",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 10.5,
      "Есенни 2024": 16.5,
      "Пролетни 2024": 11.0,
      "Есенни 2023": 11.25,
      "Пролетни 2023": 19.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0
    }
  },
  {
    "name": "Пламен Тодоров Тодоров",
    "grade": 11,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2024": 17.25,
      "Олимпиада 2024": 25.0,
      "Олимпиада 2023": 16.5,
      "Есенни 2022": 21.5
    },
    "competition_grades": {
      "Есенни 2024": 5.0,
      "Олимпиада 2024": 4.0,
      "Олимпиада 2023": 3.0,
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Калоян Тодоров Върбанов",
    "grade": 11,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2025": 14.5,
      "Есенни 2024": 14.25,
      "Есенни 2023": 7.0,
      "Пролетни 2023": 21.5,
      "Есенни 2022": 18.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Крум Крумов Стоименов",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 11.0,
      "Есенни 2024": 10.0,
      "Пролетни 2024": 18.5,
      "Есенни 2023": 10.25,
      "Олимпиада 2023": 6.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Олимпиада 2023": 3.0
    }
  },
  {
    "name": "Кристиян Йорданов Вълков",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 17.5,
      "Есенни 2024": 11.5,
      "Есенни 2022": 25.0,
      "Пролетни 2022": 20.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Есенни 2022": 3.0,
      "Пролетни 2022": 2.0
    }
  },
  {
    "name": "Валентин Чавдарев Христев",
    "grade": 11,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2025": 15.0,
      "Есенни 2024": 8.0,
      "Пролетни 2024": 16.5,
      "Есенни 2023": 7.5
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0
    }
  },
  {
    "name": "Виктория Янкова Тумбева",
    "grade": 11,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 6.25,
      "Пролетни 2024": 23.5,
      "Есенни 2023": 10.5,
      "Пролетни 2023": 18.5,
      "Есенни 2022": 19.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Преслав Митков Тошев",
    "grade": 11,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2025": 9.5,
      "Есенни 2024": 11.5,
      "Есенни 2023": 9.0,
      "Пролетни 2023": 26.0,
      "Есенни 2022": 20.5
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Михаела Цанкова Карацанова",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 6.5,
      "Есенни 2024": 8.5,
      "Олимпиада 2024": 12.0,
      "Есенни 2023": 6.0,
      "Пролетни 2023": 20.0,
      "Пролетни 2022": 23.5
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Олимпиада 2024": 4.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Пролетни 2022": 2.0
    }
  },
  {
    "name": "Здравко Светлозаров Николов",
    "grade": 11,
    "school": "ППМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Пролетни 2025": 16.0,
      "Есенни 2024": 10.75,
      "Есенни 2023": 8.5
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Есенни 2023": 4.0
    }
  },
  {
    "name": "Диляна Иванова Тодорова",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2024": 17.0,
      "Олимпиада 2024": 24.5
    },
    "competition_grades": {
      "Есенни 2024": 5.0,
      "Олимпиада 2024": 4.0
    }
  },
  {
    "name": "Константин Ивайлов Божков",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 6.0,
      "Есенни 2024": 7.25,
      "Пролетни 2024": 23.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 13.5,
      "Есенни 2022": 8.5
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Мартин Петров Андреев",
    "grade": 11,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Олимпиада 2024": 28.0,
      "Олимпиада 2023": 15.5,
      "Пролетни 2023": 20.0,
      "Есенни 2022": 20.5
    },
    "competition_grades": {
      "Олимпиада 2024": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Атанас Мирославов Митрев",
    "grade": 11,
    "school": "ЕГ \"Хр. Ботев\"",
    "city": "Кърджали",
    "competitions": {
      "Пролетни 2025": 3.8,
      "Есенни 2024": 5.5,
      "Пролетни 2024": 29.0,
      "Есенни 2023": 12.5
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0
    }
  },
  {
    "name": "Диана Найденова Начева",
    "grade": 11,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 11.0,
      "Пролетни 2024": 13.0,
      "Есенни 2023": 6.0,
      "Пролетни 2023": 8.0,
      "Есенни 2022": 10.5
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "София Николаева",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 8.0,
      "Есенни 2024": 9.25,
      "Пролетни 2024": 12.5,
      "Есенни 2023": 10.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0
    }
  },
  {
    "name": "Виктор Калинов Мончев",
    "grade": 11,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2025": 9.0,
      "Есенни 2024": 9.0,
      "Пролетни 2024": 15.5,
      "Есенни 2023": 3.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0
    }
  },
  {
    "name": "Елена Даринова Йорданова",
    "grade": 11,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2024": 28.25,
      "Есенни 2023": 7.5,
      "Пролетни 2023": 29.5,
      "Есенни 2022": 23.5
    },
    "competition_grades": {
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Аркадий Николаевич Каленников",
    "grade": 11,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Пролетни 2025": 12.0,
      "Есенни 2024": 14.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0
    }
  },
  {
    "name": "Борислав Митков Димитров",
    "grade": 11,
    "school": "ЕГ \"Хр. Ботев\"",
    "city": "Кърджали",
    "competitions": {
      "Олимпиада 2024": 25.0,
      "Пролетни 2024": 11.5,
      "Есенни 2023": 6.5
    },
    "competition_grades": {
      "Олимпиада 2024": 4.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0
    }
  },
  {
    "name": "Боряна Димитрова Манолова",
    "grade": 11,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2024": 9.5,
      "Пролетни 2024": 17.0,
      "Есенни 2023": 6.0,
      "Пролетни 2023": 15.5,
      "Есенни 2022": 10.5
    },
    "competition_grades": {
      "Есенни 2024": 5.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Сара Красимирова Илиева",
    "grade": 11,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2024": 11.0,
      "Олимпиада 2023": 12.0,
      "Пролетни 2023": 28.0,
      "Есенни 2022": 26.5,
      "Пролетни 2022": 24.0,
      "Олимпиада 2021": 24.5,
      "2  кръг 2021": 24.0
    },
    "competition_grades": {
      "Пролетни 2024": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0,
      "Пролетни 2022": 2.0,
      "Олимпиада 2021": 1.0,
      "2  кръг 2021": 1.0
    }
  },
  {
    "name": "Ралица Мартинова Тончева",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2024": 26.0,
      "Есенни 2023": 7.0,
      "Есенни 2022": 24.0,
      "Пролетни 2022": 26.0
    },
    "competition_grades": {
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Есенни 2022": 3.0,
      "Пролетни 2022": 2.0
    }
  },
  {
    "name": "Октавиан Недков Вацов",
    "grade": 11,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 13.0,
      "Есенни 2024": 7.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0
    }
  },
  {
    "name": "Александър Руменов Желязков",
    "grade": 11,
    "school": "Трета ПМГ",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 6.0,
      "Есенни 2024": 9.0,
      "Пролетни 2024": 13.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Пролетни 2024": 4.0
    }
  },
  {
    "name": "Александра Петрова Касърова",
    "grade": 11,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2024": 6.75,
      "Пролетни 2024": 13.0,
      "Пролетни 2023": 21.0,
      "Есенни 2022": 21.5,
      "Пролетни 2021": 20.5
    },
    "competition_grades": {
      "Есенни 2024": 5.0,
      "Пролетни 2024": 4.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0,
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Ема Ясенова Станкова",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 4.5,
      "Есенни 2024": 5.5,
      "Пролетни 2024": 11.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 16.5
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0,
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0
    }
  },
  {
    "name": "Борис Иванов Джурков",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2023": 9.0,
      "Олимпиада 2023": 23.5,
      "Пролетни 2023": 18.0,
      "Есенни 2022": 19.5,
      "Пролетни 2022": 29.5,
      "Пролетни 2021": 29.0
    },
    "competition_grades": {
      "Есенни 2023": 4.0,
      "Олимпиада 2023": 3.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0,
      "Пролетни 2022": 2.0,
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Иван Севдалинов Димитров",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 12.25
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2024": 5.0
    }
  },
  {
    "name": "Йоан Климентов Кирилов",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2024": 9.0,
      "Есенни 2023": 8.5,
      "Пролетни 2023": 9.0,
      "Есенни 2022": 20.5,
      "Олимпиада 2022": 4.5,
      "Есенни 2021": 26.5
    },
    "competition_grades": {
      "Есенни 2024": 5.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Есенни 2021": 2.0
    }
  },
  {
    "name": "Венцислав Атанасов Мавродиев",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 11.5,
      "Пролетни 2024": 8.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Пролетни 2024": 4.0
    }
  },
  {
    "name": "Константин Георгиев Нешков",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2024": 18.0,
      "Пролетни 2023": 19.0,
      "Есенни 2022": 12.0,
      "Пролетни 2022": 22.0
    },
    "competition_grades": {
      "Пролетни 2024": 4.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0,
      "Пролетни 2022": 2.0
    }
  },
  {
    "name": "Никола Ангелов Цикалов",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 12.0,
      "Олимпиада 2023": 5.5,
      "Пролетни 2022": 7.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Олимпиада 2023": 3.0,
      "Пролетни 2022": 2.0
    }
  },
  {
    "name": "Сияна Любомирова Павлова",
    "grade": 11,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2023": 24.0,
      "Есенни 2022": 28.0,
      "Олимпиада 2022": 7.0,
      "Пролетни 2022": 14.5,
      "Есенни 2021": 30.0,
      "Олимпиада 2021": 22.0,
      "2  кръг 2021": 26.5
    },
    "competition_grades": {
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетни 2022": 2.0,
      "Есенни 2021": 2.0,
      "Олимпиада 2021": 1.0,
      "2  кръг 2021": 1.0
    }
  },
  {
    "name": "Петър Петров Вълков",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2024": 8.75,
      "Пролетни 2023": 14.0,
      "Есенни 2022": 24.5
    },
    "competition_grades": {
      "Есенни 2024": 5.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "София Радославова Илчева",
    "grade": 11,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 6.0,
      "Есенни 2023": 6.5,
      "Пролетни 2023": 13.5,
      "Есенни 2022": 11.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Денислава Дойчинова Бонджева",
    "grade": 11,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2024": 12.0,
      "Есенни 2023": 8.25,
      "Пролетни 2023": 22.0
    },
    "competition_grades": {
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0
    }
  },
  {
    "name": "Валентин Найденов Митев",
    "grade": 11,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2023": 5.5,
      "Пролетни 2023": 26.0,
      "Есенни 2022": 27.0,
      "Пролетни 2021": 18.0
    },
    "competition_grades": {
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0,
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Ерик Ивайлов Иванов",
    "grade": 11,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 10.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0
    }
  },
  {
    "name": "Тимур Севал Ахмед",
    "grade": 11,
    "school": "ПМГ \"Акад. Боян Петканчин\"",
    "city": "Хасково",
    "competitions": {
      "Есенни 2024": 12.5
    },
    "competition_grades": {
      "Есенни 2024": 5.0
    }
  },
  {
    "name": "Нермин Хюсмен Идириз",
    "grade": 11,
    "school": "ППМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Пролетни 2025": 6.5,
      "Есенни 2023": 8.0
    },
    "competition_grades": {
      "Пролетни 2025": 5.0,
      "Есенни 2023": 4.0
    }
  },
  {
    "name": "Данаил Адрианов Ангелов",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2024": 11.5
    },
    "competition_grades": {
      "Есенни 2024": 5.0
    }
  },
  {
    "name": "Анастасия Артьомова Горская",
    "grade": 11,
    "school": "ПГКПИ",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2024": 13.0,
      "Есенни 2023": 8.0
    },
    "competition_grades": {
      "Пролетни 2024": 4.0,
      "Есенни 2023": 4.0
    }
  },
  {
    "name": "Светослав Станиславов Пенков",
    "grade": 11,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Есенни 2023": 3.0,
      "Пролетни 2023": 16.5,
      "Есенни 2022": 22.0,
      "Пролетни 2021": 23.5
    },
    "competition_grades": {
      "Есенни 2023": 4.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0,
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Петко Свиленов Петков",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2024": 6.0,
      "Есенни 2023": 9.0
    },
    "competition_grades": {
      "Есенни 2024": 5.0,
      "Есенни 2023": 4.0
    }
  },
  {
    "name": "Георги Ставрев Николов",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 7.0,
      "Олимпиада 2022": 4.0,
      "Пролетни 2022": 13.5,
      "Есенни 2021": 28.5
    },
    "competition_grades": {
      "Олимпиада 2023": 3.0,
      "Олимпиада 2022": 2.0,
      "Пролетни 2022": 2.0,
      "Есенни 2021": 2.0
    }
  },
  {
    "name": "Николай Илиянов Цачев",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2024": 5.0
    },
    "competition_grades": {
      "Есенни 2024": 5.0
    }
  },
  {
    "name": "Алекс Стефанов Чолаков",
    "grade": 11,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Есенни 2022": 27.0
    },
    "competition_grades": {
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Ивайло Борисов Василев",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 22.0,
      "Олимпиада 2021": 14.5,
      "Пролетни 2021": 26.0,
      "2  кръг 2021": 21.5
    },
    "competition_grades": {
      "Пролетни 2022": 2.0,
      "Олимпиада 2021": 1.0,
      "Пролетни 2021": 1.0,
      "2  кръг 2021": 1.0
    }
  },
  {
    "name": "Иво Дойнов Янев",
    "grade": 11,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2022": 14.0,
      "Пролетни 2022": 14.5,
      "Пролетни 2021": 18.5
    },
    "competition_grades": {
      "Есенни 2022": 3.0,
      "Пролетни 2022": 2.0,
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Боян Велизаров Руженов",
    "grade": 11,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2022": 24.0
    },
    "competition_grades": {
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Калин Ивелинов Иванов",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2023": 18.0
    },
    "competition_grades": {
      "Пролетни 2023": 3.0
    }
  },
  {
    "name": "Христо Йорданов Коев",
    "grade": 11,
    "school": "ПМГ\"Атанас Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Пролетни 2024": 7.5
    },
    "competition_grades": {
      "Пролетни 2024": 4.0
    }
  },
  {
    "name": "Лиа Красимирова Боянова",
    "grade": 11,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2023": 17.5
    },
    "competition_grades": {
      "Пролетни 2023": 3.0
    }
  },
  {
    "name": "Денис Росенов Карабашев",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 1.0,
      "Пролетни 2022": 19.0,
      "Есенни 2021": 27.0
    },
    "competition_grades": {
      "Олимпиада 2022": 2.0,
      "Пролетни 2022": 2.0,
      "Есенни 2021": 2.0
    }
  },
  {
    "name": "Себастиян Стоянов Киров",
    "grade": 11,
    "school": "ПГМЕЕ",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2024": 7.0
    },
    "competition_grades": {
      "Пролетни 2024": 4.0
    }
  },
  {
    "name": "Калина Радостинова Железчева",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 28.0,
      "Пролетни 2021": 26.5
    },
    "competition_grades": {
      "Пролетни 2022": 2.0,
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Никола Бенчев Бенчев",
    "grade": 11,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2022": 17.0,
      "Пролетни 2021": 20.0
    },
    "competition_grades": {
      "Есенни 2022": 3.0,
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Захариева София Николаева",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2023": 16.0
    },
    "competition_grades": {
      "Пролетни 2023": 3.0
    }
  },
  {
    "name": "Денис Николаев Сираков",
    "grade": 11,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2022": 20.0
    },
    "competition_grades": {
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Виктор Красимиров Аврамски",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 14.5,
      "Есенни 2021": 27.0
    },
    "competition_grades": {
      "Пролетни 2022": 2.0,
      "Есенни 2021": 2.0
    }
  },
  {
    "name": "Жанета Димитрова Калева",
    "grade": 11,
    "school": "ПМГ \"Ат. Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Пролетни 2024": 3.0,
      "Есенни 2022": 9.5
    },
    "competition_grades": {
      "Пролетни 2024": 4.0,
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Тервел Добринов Енчев",
    "grade": 11,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2023": 7.75
    },
    "competition_grades": {
      "Есенни 2023": 4.0
    }
  },
  {
    "name": "Христо Младенов Младенов",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 8.0,
      "Есенни 2021": 28.5
    },
    "competition_grades": {
      "Олимпиада 2022": 2.0,
      "Есенни 2021": 2.0
    }
  },
  {
    "name": "Теодора Светломирова Желязкова",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2022": 18.0
    },
    "competition_grades": {
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Димана Мирославова Праматарова",
    "grade": 11,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Олимпиада 2023": 10.0
    },
    "competition_grades": {
      "Олимпиада 2023": 3.0
    }
  },
  {
    "name": "Николай Емилов Рогов",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 7.5,
      "Есенни 2021": 28.0
    },
    "competition_grades": {
      "Олимпиада 2022": 2.0,
      "Есенни 2021": 2.0
    }
  },
  {
    "name": "Алекс Петров Матеев",
    "grade": 11,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетни 2024": 5.5
    },
    "competition_grades": {
      "Пролетни 2024": 4.0
    }
  },
  {
    "name": "Алмира Ибрахим Емин",
    "grade": 11,
    "school": "ЕГ \"Хр. Ботев\"",
    "city": "Кърджали",
    "competitions": {
      "Пролетни 2024": 5.5
    },
    "competition_grades": {
      "Пролетни 2024": 4.0
    }
  },
  {
    "name": "Виктория Иванова Стоянова",
    "grade": 11,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2023": 5.0,
      "Есенни 2022": 10.5
    },
    "competition_grades": {
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Катерина Бисерова Симеонова",
    "grade": 11,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетни 2023": 11.0,
      "Есенни 2022": 2.0
    },
    "competition_grades": {
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Марина Николаева Кънева",
    "grade": 11,
    "school": "ПМГ \"Ат. Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Пролетни 2024": 3.5,
      "Есенни 2022": 3.5
    },
    "competition_grades": {
      "Пролетни 2024": 4.0,
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Йордан Ивайлов Илиев",
    "grade": 11,
    "school": "ППМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Есенни 2023": 6.0
    },
    "competition_grades": {
      "Есенни 2023": 4.0
    }
  },
  {
    "name": "Георги Стоилов Колевски",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 3.0,
      "Есенни 2021": 27.5
    },
    "competition_grades": {
      "Олимпиада 2022": 2.0,
      "Есенни 2021": 2.0
    }
  },
  {
    "name": "Преслава Добринова Добрева",
    "grade": 11,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2022": 13.5
    },
    "competition_grades": {
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Стефан Христов Енев",
    "grade": 11,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 23.5
    },
    "competition_grades": {
      "Пролетни 2022": 2.0
    }
  },
  {
    "name": "Селин Сайди Имамова",
    "grade": 11,
    "school": "ПМГ \"Яне Сандански\"",
    "city": "Гоце Делчев",
    "competitions": {
      "Пролетни 2022": 15.0,
      "Пролетни 2021": 16.0
    },
    "competition_grades": {
      "Пролетни 2022": 2.0,
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Симона Николаева Христова",
    "grade": 11,
    "school": "ППМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Есенни 2023": 5.0
    },
    "competition_grades": {
      "Есенни 2023": 4.0
    }
  },
  {
    "name": "Ефе Енвер Мехмедали",
    "grade": 11,
    "school": "ЕГ \"Хр. Ботев\"",
    "city": "Кърджали",
    "competitions": {
      "Пролетни 2024": 3.5
    },
    "competition_grades": {
      "Пролетни 2024": 4.0
    }
  },
  {
    "name": "Михаил Михайлов Бошов",
    "grade": 11,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 19.0,
      "2  кръг 2021": 21.0
    },
    "competition_grades": {
      "Олимпиада 2021": 1.0,
      "2  кръг 2021": 1.0
    }
  },
  {
    "name": "Алекс Александров Андреев",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2022": 9.5
    },
    "competition_grades": {
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Теодора Даниелова Петрова",
    "grade": 11,
    "school": "55 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 18.0,
      "2  кръг 2021": 20.0
    },
    "competition_grades": {
      "Олимпиада 2021": 1.0,
      "2  кръг 2021": 1.0
    }
  },
  {
    "name": "Крум Василев Станев",
    "grade": 11,
    "school": "ПТГ",
    "city": "Габрово",
    "competitions": {
      "Пролетни 2023": 6.5
    },
    "competition_grades": {
      "Пролетни 2023": 3.0
    }
  },
  {
    "name": "Малина Калинова Гладнишка",
    "grade": 11,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетни 2023": 6.5
    },
    "competition_grades": {
      "Пролетни 2023": 3.0
    }
  },
  {
    "name": "Елизабет Славчева Славова",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2022": 15.0
    },
    "competition_grades": {
      "Пролетни 2022": 2.0
    }
  },
  {
    "name": "Велимир Господинов Гочков",
    "grade": 11,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 13.0,
      "2  кръг 2021": 24.0
    },
    "competition_grades": {
      "Олимпиада 2021": 1.0,
      "2  кръг 2021": 1.0
    }
  },
  {
    "name": "Атанас Манолов Ружинов",
    "grade": 11,
    "school": "126 ОУ „П. Ю. Тодоров“",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 12.0,
      "2  кръг 2021": 24.5
    },
    "competition_grades": {
      "Олимпиада 2021": 1.0,
      "2  кръг 2021": 1.0
    }
  },
  {
    "name": "Кристин Спасова Костадинова",
    "grade": 11,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2022": 8.0
    },
    "competition_grades": {
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Мартин Димитров Белчев",
    "grade": 11,
    "school": "ПГКПИ",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2023": 6.0
    },
    "competition_grades": {
      "Пролетни 2023": 3.0
    }
  },
  {
    "name": "Божидара Филипова Пухалева",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 14.0
    },
    "competition_grades": {
      "Пролетни 2022": 2.0
    }
  },
  {
    "name": "Ема Мариянова Великова",
    "grade": 11,
    "school": "ППМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Есенни 2023": 3.0
    },
    "competition_grades": {
      "Есенни 2023": 4.0
    }
  },
  {
    "name": "Филип Чавдаров Сербезов",
    "grade": 11,
    "school": "38 ОУ „Васил Априлов“",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 11.0,
      "2  кръг 2021": 20.0
    },
    "competition_grades": {
      "Олимпиада 2021": 1.0,
      "2  кръг 2021": 1.0
    }
  },
  {
    "name": "Румяна Георгиева Лазарова",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2022": 7.0
    },
    "competition_grades": {
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Дара Томова Георгиева",
    "grade": 11,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2023": 4.0,
      "Есенни 2022": 1.0
    },
    "competition_grades": {
      "Пролетни 2023": 3.0,
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Ивайло Стефанов Ламбуров",
    "grade": 11,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Пролетни 2021": 26.0
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Ная Красимирова Юрукова",
    "grade": 11,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 26.0
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Мария Георгиева Николова",
    "grade": 11,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Есенни 2022": 6.0
    },
    "competition_grades": {
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Теоман Мехмед Ахмед",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2021": 25.0
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Николай Цветомиров Цолов",
    "grade": 11,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенни 2023": 2.5
    },
    "competition_grades": {
      "Есенни 2023": 4.0
    }
  },
  {
    "name": "Георги Здравков Примов",
    "grade": 11,
    "school": "ОМГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2022": 10.5
    },
    "competition_grades": {
      "Пролетни 2022": 2.0
    }
  },
  {
    "name": "Мартин Антонов Дойчев",
    "grade": 11,
    "school": "ПМГ \"Ат. Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Есенни 2022": 5.5
    },
    "competition_grades": {
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Стоян Иванов Дражев",
    "grade": 11,
    "school": "ПМГ \"Ат. Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Есенни 2022": 5.5
    },
    "competition_grades": {
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Рая Красимирова Савова",
    "grade": 11,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2022": 3.0,
      "Пролетни 2021": 15.5
    },
    "competition_grades": {
      "Пролетни 2022": 2.0,
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Никола Христов Дойнов",
    "grade": 11,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 22.5
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Ивайла Ивайлова Илиева",
    "grade": 11,
    "school": "ПТГ",
    "city": "Габрово",
    "competitions": {
      "Пролетни 2023": 4.0
    },
    "competition_grades": {
      "Пролетни 2023": 3.0
    }
  },
  {
    "name": "Лора Николаева Апостолова",
    "grade": 11,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 21.5
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Атанас Мариянов Найденов",
    "grade": 11,
    "school": "134 ОУ \"Димчо Дебелянов\"",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 20.0
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Ивайла Драгомирова Радева",
    "grade": 11,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2024": 1.5
    },
    "competition_grades": {
      "Пролетни 2024": 4.0
    }
  },
  {
    "name": "Траян Парушев Василев",
    "grade": 11,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2023": 3.5
    },
    "competition_grades": {
      "Пролетни 2023": 3.0
    }
  },
  {
    "name": "Андон Димитров Такев",
    "grade": 11,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2022": 4.5
    },
    "competition_grades": {
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Алексанър Любомиров Малчев",
    "grade": 11,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 7.0
    },
    "competition_grades": {
      "Пролетни 2022": 2.0
    }
  },
  {
    "name": "Андреа Людмилова Неделчева",
    "grade": 11,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2021": 15.5
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Мартин Матеев Панчаревски",
    "grade": 11,
    "school": "107 ОУ \"Хан Крум\"",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 15.5
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Кая Христова Колева",
    "grade": 11,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "2  кръг 2021": 20.0
    },
    "competition_grades": {
      "2  кръг 2021": 1.0
    }
  },
  {
    "name": "Християн Любомиров Божинов",
    "grade": 11,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2022": 3.5
    },
    "competition_grades": {
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Йордан Йорданов Митев",
    "grade": 11,
    "school": "ПГМЕЕ",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2024": 1.0
    },
    "competition_grades": {
      "Пролетни 2024": 4.0
    }
  },
  {
    "name": "Роман  Мартинов",
    "grade": 11,
    "school": "ПГМЕЕ",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2024": 1.0
    },
    "competition_grades": {
      "Пролетни 2024": 4.0
    }
  },
  {
    "name": "Абдула Абдула Кичуков",
    "grade": 11,
    "school": "ПМГ \"Яне Сандански\"",
    "city": "Гоце Делчев",
    "competitions": {
      "Пролетни 2021": 13.0
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Давид Стефанов Рекинов",
    "grade": 11,
    "school": "134 ОУ \"Димчо Дебелянов\"",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 13.0
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Николай Николаев Тонков",
    "grade": 11,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2021": 13.0
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Божидара Георгиева Амуджиева",
    "grade": 11,
    "school": "ПМГ \"Ат. Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Есенни 2022": 3.0
    },
    "competition_grades": {
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Калина Тихомирова Трифонова",
    "grade": 11,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенни 2022": 3.0
    },
    "competition_grades": {
      "Есенни 2022": 3.0
    }
  },
  {
    "name": "Виктория Момчилова Георгиева",
    "grade": 11,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 12.5
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Деян Красимиров Минев",
    "grade": 11,
    "school": "ППМГ \":Акад.проф.д-р Асен Златаров”",
    "city": "Ботевград",
    "competitions": {
      "Есенни 2023": 1.25
    },
    "competition_grades": {
      "Есенни 2023": 4.0
    }
  },
  {
    "name": "Момчил Момчилов Пенев",
    "grade": 11,
    "school": "ППМГ \":Акад.проф.д-р Асен Златаров”",
    "city": "Ботевград",
    "competitions": {
      "Есенни 2023": 1.0
    },
    "competition_grades": {
      "Есенни 2023": 4.0
    }
  },
  {
    "name": "Тома Марио Давидов",
    "grade": 11,
    "school": "ППМГ \":Акад.проф.д-р Асен Златаров”",
    "city": "Ботевград",
    "competitions": {
      "Есенни 2023": 1.0
    },
    "competition_grades": {
      "Есенни 2023": 4.0
    }
  },
  {
    "name": "Борис Иванов Георгиев",
    "grade": 11,
    "school": "21 СУ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 9.0
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Илиан Ивайлов Илиев",
    "grade": 11,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2021": 9.0
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Раян Иванов Иванов",
    "grade": 11,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 9.0
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Крум Красимиров Митев",
    "grade": 11,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 8.5
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Анна Красен Александрова",
    "grade": 11,
    "school": "ПТГ",
    "city": "Габрово",
    "competitions": {
      "Пролетни 2023": 1.5
    },
    "competition_grades": {
      "Пролетни 2023": 3.0
    }
  },
  {
    "name": "Ива Светославова Цветкова",
    "grade": 11,
    "school": "ОУ \"Димитър Талев\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2021": 7.5
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Мартин Евгениев Аронов",
    "grade": 11,
    "school": "134 ОУ \"Димчо Дебелянов\"",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 7.5
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Павел Асенов Жилков",
    "grade": 11,
    "school": "ППМГ \"Васил Левски\"",
    "city": "Смолян",
    "competitions": {
      "Пролетни 2021": 7.5
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Стамен Николов Дамянов",
    "grade": 11,
    "school": "21 СУ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 7.5
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Венцислав Красимиров Марев",
    "grade": 11,
    "school": "ОУ \"Димитър Талев\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2021": 7.0
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Даниел Пламенов Янчев",
    "grade": 11,
    "school": "21 СУ \"Христо Ботев\"",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 6.0
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Калоян Божидаров Кожухаров",
    "grade": 11,
    "school": "ПМГ",
    "city": "Перник",
    "competitions": {
      "Пролетни 2023": 1.0
    },
    "competition_grades": {
      "Пролетни 2023": 3.0
    }
  },
  {
    "name": "Борислава Асенова Хаджиева",
    "grade": 11,
    "school": "ОУ \"Димитър Талев\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2021": 5.0
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Имануел Тодоров Горанов",
    "grade": 11,
    "school": "СУ \"Иван Вазов\"",
    "city": "Вършец",
    "competitions": {
      "Пролетни 2021": 5.0
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Вероника Христова Костова",
    "grade": 11,
    "school": "ОУ \"Димитър Талев\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2021": 4.0
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Антоанета Тодорова Стоянова",
    "grade": 11,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2021": 1.5
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Стефан Миленов Димитров",
    "grade": 11,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетни 2021": 1.5
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Теодор Радостинов Пенев",
    "grade": 11,
    "school": "ОУ \"Димитър Талев\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2021": 1.0
    },
    "competition_grades": {
      "Пролетни 2021": 1.0
    }
  },
  {
    "name": "Илия Генчев Ников",
    "grade": 12,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2025": 27.1,
      "Есенни 2024": 17.0,
      "Олимпиада 2024": 70.5,
      "Пролетни 2024": 19.2,
      "Есенни 2023": 26.7,
      "Олимпиада 2023": 52.3,
      "Пролетни 2023": 19.9,
      "Есенни 2022": 11.95,
      "Олимпиада 2022": 25.75,
      "Пролетни 2022": 29.0,
      "Есенни 2021": 28.0,
      "Олимпиада 2021": 12.5,
      "Пролетни 2021": 25.25,
      "2  кръг 2021": 29.5,
      "Есенни 2019": 18.95
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 7.0,
      "Есенни 2023": 7.0,
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 7.0,
      "Есенни 2022": 7.0,
      "Олимпиада 2022": 3.0,
      "Пролетни 2022": 3.0,
      "Есенни 2021": 3.0,
      "Олимпиада 2021": 2.0,
      "Пролетни 2021": 2.0,
      "2  кръг 2021": 2.0,
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Юнсин Ху",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 19.6,
      "Есенни 2024": 21.0,
      "Олимпиада 2024": 61.45,
      "Пролетни 2024": 14.1,
      "Есенни 2023": 23.0,
      "Олимпиада 2023": 24.5,
      "Пролетни 2023": 24.5,
      "Есенни 2022": 27.5,
      "Олимпиада 2022": 18.5,
      "Пролетни 2022": 27.5,
      "Есенни 2021": 23.0,
      "Олимпиада 2021": 20.0,
      "2  кръг 2021": 30.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 7.0,
      "Есенни 2023": 7.0,
      "Олимпиада 2023": 4.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетни 2022": 3.0,
      "Есенни 2021": 3.0,
      "Олимпиада 2021": 2.0,
      "2  кръг 2021": 2.0
    }
  },
  {
    "name": "Петър Желязков Петров",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 23.3,
      "Есенни 2024": 21.5,
      "Олимпиада 2024": 56.25,
      "Пролетни 2024": 8.4,
      "Есенни 2023": 16.0,
      "Олимпиада 2023": 26.0,
      "Пролетни 2023": 9.5,
      "Есенни 2022": 24.5,
      "Олимпиада 2022": 17.0,
      "Пролетни 2022": 28.75,
      "Есенни 2021": 28.0,
      "Олимпиада 2021": 6.0,
      "Пролетни 2021": 19.0,
      "2  кръг 2021": 30.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 7.0,
      "Есенни 2023": 7.0,
      "Олимпиада 2023": 4.0,
      "Пролетни 2023": 7.0,
      "Есенни 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетни 2022": 3.0,
      "Есенни 2021": 3.0,
      "Олимпиада 2021": 2.0,
      "Пролетни 2021": 2.0,
      "2  кръг 2021": 2.0
    }
  },
  {
    "name": "Илия Константинов Василев",
    "grade": 12,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 29.0,
      "Есенни 2024": 14.5,
      "Олимпиада 2024": 62.25,
      "Пролетни 2024": 14.4,
      "Есенни 2023": 18.5,
      "Пролетни 2023": 11.8,
      "Есенни 2022": 1.2,
      "Олимпиада 2022": 20.0,
      "Пролетни 2022": 25.0,
      "Есенни 2021": 22.0,
      "Пролетни 2021": 29.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 7.0,
      "Есенни 2023": 7.0,
      "Пролетни 2023": 7.0,
      "Есенни 2022": 7.0,
      "Олимпиада 2022": 3.0,
      "Пролетни 2022": 3.0,
      "Есенни 2021": 3.0,
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Филип Роберт Стефанов",
    "grade": 12,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 16.25,
      "Есенни 2024": 27.0,
      "Олимпиада 2024": 20.0,
      "Пролетни 2024": 14.5,
      "Есенни 2023": 23.5,
      "Олимпиада 2023": 20.0,
      "Пролетни 2023": 26.0,
      "Есенни 2022": 29.5,
      "Пролетни 2022": 29.5,
      "Пролетни 2021": 21.5
    },
    "competition_grades": {
      "Пролетни 2025": 6.0,
      "Есенни 2024": 6.0,
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 5.0,
      "Есенни 2023": 5.0,
      "Олимпиада 2023": 4.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Пролетни 2022": 3.0,
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Стефан Николаев Спасов",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 28.0,
      "Есенни 2024": 17.5,
      "Пролетни 2024": 20.5,
      "Есенни 2023": 20.5,
      "Олимпиада 2023": 27.0,
      "Пролетни 2023": 22.0,
      "Есенни 2022": 27.5,
      "Олимпиада 2022": 23.0,
      "Пролетни 2022": 26.5,
      "Есенни 2021": 22.0,
      "Пролетни 2021": 26.5,
      "Олимпиада 2020": 21.0,
      "2 кръг 2020": 30.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Пролетни 2024": 7.0,
      "Есенни 2023": 7.0,
      "Олимпиада 2023": 4.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетни 2022": 3.0,
      "Есенни 2021": 3.0,
      "Пролетни 2021": 2.0,
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Димитър Методи Лазов",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 22.0,
      "Есенни 2024": 22.0,
      "Олимпиада 2024": 15.5,
      "Есенни 2023": 21.5,
      "Олимпиада 2023": 26.0,
      "Пролетни 2023": 24.5,
      "Есенни 2022": 26.9,
      "Олимпиада 2021": 14.5,
      "Пролетни 2021": 23.5,
      "2  кръг 2021": 30.0
    },
    "competition_grades": {
      "Пролетни 2025": 6.0,
      "Есенни 2024": 6.0,
      "Олимпиада 2024": 5.0,
      "Есенни 2023": 5.0,
      "Олимпиада 2023": 4.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Олимпиада 2021": 2.0,
      "Пролетни 2021": 2.0,
      "2  кръг 2021": 2.0
    }
  },
  {
    "name": "Чавдар Дамянов Ненов",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 13.5,
      "Есенни 2024": 8.5,
      "Олимпиада 2024": 52.9,
      "Пролетни 2024": 14.0,
      "Есенни 2023": 15.5,
      "Олимпиада 2023": 15.5,
      "Пролетни 2023": 18.0,
      "Пролетни 2021": 19.75
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 5.0,
      "Есенни 2023": 5.0,
      "Олимпиада 2023": 4.0,
      "Пролетни 2023": 4.0,
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Димитър Атанасов Германов",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 28.7,
      "Есенни 2024": 18.5,
      "Пролетни 2024": 26.0,
      "Есенни 2023": 26.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Пролетни 2024": 5.0,
      "Есенни 2023": 5.0
    }
  },
  {
    "name": "Алберт Константин Асенов Иваницов",
    "grade": 12,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 28.5,
      "Есенни 2024": 14.0,
      "Олимпиада 2024": 18.75,
      "Пролетни 2024": 9.9,
      "Есенни 2023": 21.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 7.0,
      "Есенни 2023": 5.0
    }
  },
  {
    "name": "Александър Мирославов Гатев",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 19.25,
      "Есенни 2024": 28.0,
      "Олимпиада 2024": 14.5,
      "Есенни 2023": 22.0,
      "Олимпиада 2023": 17.5
    },
    "competition_grades": {
      "Пролетни 2025": 6.0,
      "Есенни 2024": 6.0,
      "Олимпиада 2024": 5.0,
      "Есенни 2023": 5.0,
      "Олимпиада 2023": 4.0
    }
  },
  {
    "name": "Лора Димитрова Лукманова",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 11.0,
      "Есенни 2024": 12.5,
      "Олимпиада 2024": 16.0,
      "Пролетни 2024": 6.0,
      "Есенни 2023": 13.5,
      "Олимпиада 2023": 21.0,
      "Пролетни 2023": 22.4,
      "Есенни 2022": 30.0,
      "Олимпиада 2022": 27.0,
      "Пролетни 2022": 30.0,
      "Есенни 2021": 29.0,
      "Олимпиада 2021": 19.5,
      "Пролетни 2021": 28.0,
      "2  кръг 2021": 30.0,
      "Олимпиада 2020": 27.0,
      "2 кръг 2020": 30.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 7.0,
      "Есенни 2023": 7.0,
      "Олимпиада 2023": 4.0,
      "Пролетни 2023": 7.0,
      "Есенни 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетни 2022": 3.0,
      "Есенни 2021": 3.0,
      "Олимпиада 2021": 2.0,
      "Пролетни 2021": 2.0,
      "2  кръг 2021": 2.0,
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Ванеса Ангелова Калинкова",
    "grade": 12,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2025": 11.25,
      "Есенни 2024": 24.0,
      "Пролетни 2024": 12.0,
      "Есенни 2023": 19.5,
      "Пролетни 2023": 25.0,
      "Есенни 2022": 29.8,
      "Олимпиада 2022": 22.75,
      "Пролетни 2022": 25.0,
      "Есенни 2021": 26.0,
      "Олимпиада 2021": 13.5,
      "Пролетни 2021": 28.5,
      "2  кръг 2021": 30.0
    },
    "competition_grades": {
      "Пролетни 2025": 6.0,
      "Есенни 2024": 6.0,
      "Пролетни 2024": 5.0,
      "Есенни 2023": 5.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетни 2022": 3.0,
      "Есенни 2021": 3.0,
      "Олимпиада 2021": 2.0,
      "Пролетни 2021": 2.0,
      "2  кръг 2021": 2.0
    }
  },
  {
    "name": "Даниел Илиев Койнов",
    "grade": 12,
    "school": "ППМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Пролетни 2025": 12.9,
      "Олимпиада 2024": 52.25,
      "Есенни 2023": 23.0,
      "Олимпиада 2023": 28.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Олимпиада 2024": 5.0,
      "Есенни 2023": 5.0,
      "Олимпиада 2023": 4.0
    }
  },
  {
    "name": "Никола Бориславов Борисов",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 17.75,
      "Есенни 2024": 0.0,
      "Олимпиада 2024": 16.5,
      "Пролетни 2024": 15.5,
      "Есенни 2023": 17.5,
      "Олимпиада 2023": 27.5,
      "Пролетни 2023": 21.0,
      "Олимпиада 2022": 16.75,
      "Пролетни 2022": 12.5,
      "Есенни 2021": 30.0
    },
    "competition_grades": {
      "Пролетни 2025": 6.0,
      "Есенни 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 5.0,
      "Есенни 2023": 5.0,
      "Олимпиада 2023": 4.0,
      "Пролетни 2023": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетни 2022": 3.0,
      "Есенни 2021": 3.0
    }
  },
  {
    "name": "Людмила Димитрова Канева",
    "grade": 12,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 13.75,
      "Есенни 2024": 25.0,
      "Олимпиада 2024": 13.25,
      "Есенни 2023": 19.0,
      "Пролетни 2023": 20.5
    },
    "competition_grades": {
      "Пролетни 2025": 6.0,
      "Есенни 2024": 6.0,
      "Олимпиада 2024": 5.0,
      "Есенни 2023": 5.0,
      "Пролетни 2023": 4.0
    }
  },
  {
    "name": "Александър Иванов Коджабашийски",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 17.0,
      "Есенни 2024": 20.0,
      "Пролетни 2024": 17.5,
      "Есенни 2023": 19.0,
      "Олимпиада 2023": 16.5
    },
    "competition_grades": {
      "Пролетни 2025": 6.0,
      "Есенни 2024": 6.0,
      "Пролетни 2024": 5.0,
      "Есенни 2023": 5.0,
      "Олимпиада 2023": 4.0
    }
  },
  {
    "name": "Ангел Антонов Христов",
    "grade": 12,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2025": 8.75,
      "Есенни 2024": 20.5,
      "Пролетни 2024": 22.0,
      "Есенни 2023": 18.0,
      "Пролетни 2023": 23.5,
      "Есенни 2022": 20.3,
      "Пролетни 2022": 21.0
    },
    "competition_grades": {
      "Пролетни 2025": 6.0,
      "Есенни 2024": 6.0,
      "Пролетни 2024": 5.0,
      "Есенни 2023": 5.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Димитър Александров Войводов",
    "grade": 12,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Пролетни 2025": 14.25,
      "Есенни 2024": 19.0,
      "Пролетни 2024": 11.5,
      "Есенни 2023": 15.5,
      "Пролетни 2023": 24.0,
      "Есенни 2022": 13.5,
      "Олимпиада 2022": 8.0,
      "Пролетни 2022": 7.5,
      "Есенни 2021": 23.0
    },
    "competition_grades": {
      "Пролетни 2025": 6.0,
      "Есенни 2024": 6.0,
      "Пролетни 2024": 5.0,
      "Есенни 2023": 5.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетни 2022": 3.0,
      "Есенни 2021": 3.0
    }
  },
  {
    "name": "Стела Бисерова Бинева",
    "grade": 12,
    "school": "ПМГ \"Акад. Боян Петканчин\"",
    "city": "Хасково",
    "competitions": {
      "Есенни 2024": 13.0,
      "Олимпиада 2024": 15.25,
      "Пролетни 2024": 20.5,
      "Есенни 2023": 22.5,
      "Олимпиада 2023": 19.0,
      "Пролетни 2023": 23.0,
      "Есенни 2022": 21.5,
      "Олимпиада 2020": 16.0,
      "2 кръг 2020": 28.5
    },
    "competition_grades": {
      "Есенни 2024": 6.0,
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 5.0,
      "Есенни 2023": 5.0,
      "Олимпиада 2023": 4.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Гюрхан Селяхтин Азиз",
    "grade": 12,
    "school": "ЕГ \"Хр. Ботев\"",
    "city": "Кърджали",
    "competitions": {
      "Пролетни 2025": 3.5,
      "Есенни 2024": 12.0,
      "Олимпиада 2024": 15.25,
      "Пролетни 2024": 21.5,
      "Есенни 2023": 21.5,
      "Олимпиада 2023": 26.5,
      "Олимпиада 2022": 5.5,
      "Есенни 2021": 23.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 5.0,
      "Есенни 2023": 5.0,
      "Олимпиада 2023": 4.0,
      "Олимпиада 2022": 3.0,
      "Есенни 2021": 3.0
    }
  },
  {
    "name": "Рая Ивова Шикова",
    "grade": 12,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Пролетни 2024": 18.5,
      "Есенни 2023": 22.0,
      "Олимпиада 2023": 21.0,
      "Пролетни 2023": 23.5,
      "Есенни 2022": 29.9,
      "Олимпиада 2022": 25.5,
      "Пролетни 2022": 28.5,
      "Есенни 2021": 23.0,
      "Олимпиада 2021": 14.5,
      "Пролетни 2021": 29.25,
      "2  кръг 2021": 30.0,
      "Олимпиада 2020": 25.0,
      "2 кръг 2020": 30.0,
      "Есенни 2019": 24.2
    },
    "competition_grades": {
      "Пролетни 2024": 5.0,
      "Есенни 2023": 5.0,
      "Олимпиада 2023": 4.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетни 2022": 3.0,
      "Есенни 2021": 3.0,
      "Олимпиада 2021": 2.0,
      "Пролетни 2021": 2.0,
      "2  кръг 2021": 2.0,
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0,
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Марин Танев Танев",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 9.5,
      "Есенни 2024": 9.0,
      "Пролетни 2024": 8.8,
      "Есенни 2023": 19.0,
      "Пролетни 2023": 20.5,
      "Есенни 2022": 22.0,
      "Пролетни 2022": 22.5,
      "Пролетни 2021": 11.75
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Пролетни 2024": 7.0,
      "Есенни 2023": 5.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Пролетни 2022": 3.0,
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Лазар Делянов Тодоров",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 10.25,
      "Есенни 2024": 18.0,
      "Есенни 2023": 19.5,
      "Олимпиада 2023": 17.5
    },
    "competition_grades": {
      "Пролетни 2025": 6.0,
      "Есенни 2024": 6.0,
      "Есенни 2023": 5.0,
      "Олимпиада 2023": 4.0
    }
  },
  {
    "name": "Абълай Бахътулъ Турганбек",
    "grade": 12,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 10.5,
      "Пролетни 2024": 21.0,
      "Есенни 2023": 16.0,
      "Пролетни 2023": 13.0,
      "Есенни 2022": 16.9,
      "Олимпиада 2022": 18.25,
      "Пролетни 2022": 13.5,
      "Есенни 2021": 23.0,
      "Пролетни 2021": 16.75
    },
    "competition_grades": {
      "Пролетни 2025": 6.0,
      "Пролетни 2024": 5.0,
      "Есенни 2023": 5.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетни 2022": 3.0,
      "Есенни 2021": 3.0,
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Христо Константинов Кисев",
    "grade": 12,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2024": 23.5,
      "Олимпиада 2024": 18.25,
      "Есенни 2023": 15.0
    },
    "competition_grades": {
      "Есенни 2024": 6.0,
      "Олимпиада 2024": 5.0,
      "Есенни 2023": 5.0
    }
  },
  {
    "name": "Калоян Владиславов Цанев",
    "grade": 12,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 8.5,
      "Олимпиада 2024": 17.2,
      "Есенни 2023": 10.0,
      "Олимпиада 2023": 15.0,
      "Пролетни 2023": 9.3,
      "Есенни 2022": 4.95,
      "Пролетни 2022": 23.5,
      "Пролетни 2021": 30.0,
      "Олимпиада 2020": 22.0,
      "2 кръг 2020": 30.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Олимпиада 2024": 5.0,
      "Есенни 2023": 7.0,
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 7.0,
      "Есенни 2022": 7.0,
      "Пролетни 2022": 3.0,
      "Пролетни 2021": 2.0,
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Никола Кирилов Пейчев",
    "grade": 12,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2024": 18.0,
      "Пролетни 2024": 14.0,
      "Есенни 2023": 15.5,
      "Пролетни 2023": 17.0,
      "Есенни 2022": 12.0
    },
    "competition_grades": {
      "Есенни 2024": 6.0,
      "Пролетни 2024": 5.0,
      "Есенни 2023": 5.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0
    }
  },
  {
    "name": "Теодор Николаев Стоянов",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2024": 19.5,
      "Пролетни 2024": 13.0,
      "Пролетни 2023": 13.5,
      "Есенни 2022": 17.0,
      "Олимпиада 2021": 12.5,
      "Пролетни 2021": 18.5,
      "2  кръг 2021": 30.0
    },
    "competition_grades": {
      "Есенни 2024": 6.0,
      "Пролетни 2024": 5.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Олимпиада 2021": 2.0,
      "Пролетни 2021": 2.0,
      "2  кръг 2021": 2.0
    }
  },
  {
    "name": "Калоян Иванов Иванов 0",
    "grade": 12,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2025": 20.75,
      "Пролетни 2024": 11.0,
      "Пролетни 2023": 1.0
    },
    "competition_grades": {
      "Пролетни 2025": 6.0,
      "Пролетни 2024": 5.0,
      "Пролетни 2023": 4.0
    }
  },
  {
    "name": "Мила Красимир Гетова",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенни 2023": 19.0,
      "Олимпиада 2023": 19.0,
      "Пролетни 2023": 21.0,
      "Есенни 2022": 21.5,
      "Олимпиада 2022": 17.0,
      "Пролетни 2022": 26.0,
      "Есенни 2021": 25.0,
      "Олимпиада 2021": 17.5,
      "Пролетни 2021": 14.5,
      "2  кръг 2021": 30.0
    },
    "competition_grades": {
      "Есенни 2023": 5.0,
      "Олимпиада 2023": 4.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетни 2022": 3.0,
      "Есенни 2021": 3.0,
      "Олимпиада 2021": 2.0,
      "Пролетни 2021": 2.0,
      "2  кръг 2021": 2.0
    }
  },
  {
    "name": "Александра Константинова Петкова",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2024": 3.8,
      "Есенни 2023": 7.7,
      "Олимпиада 2023": 20.0,
      "Пролетни 2023": 28.5,
      "Есенни 2022": 29.0,
      "Олимпиада 2022": 19.0,
      "Пролетни 2022": 26.5,
      "Есенни 2021": 23.0
    },
    "competition_grades": {
      "Пролетни 2024": 7.0,
      "Есенни 2023": 7.0,
      "Олимпиада 2023": 4.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетни 2022": 3.0,
      "Есенни 2021": 3.0
    }
  },
  {
    "name": "Деодор Асенов Величков",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2024": 9.0,
      "Есенни 2023": 21.5,
      "Пролетни 2023": 10.5,
      "Есенни 2022": 21.0,
      "Олимпиада 2022": 16.0,
      "Есенни 2021": 22.0,
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 21.5,
      "2  кръг 2021": 29.0
    },
    "competition_grades": {
      "Пролетни 2024": 5.0,
      "Есенни 2023": 5.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Есенни 2021": 3.0,
      "Олимпиада 2021": 2.0,
      "Пролетни 2021": 2.0,
      "2  кръг 2021": 2.0
    }
  },
  {
    "name": "Калоян Августинов Маринов",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 34.75
    },
    "competition_grades": {
      "Олимпиада 2024": 5.0
    }
  },
  {
    "name": "Ема Марин Янева",
    "grade": 12,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 12.25,
      "Пролетни 2024": 12.0,
      "Есенни 2022": 8.0,
      "Пролетни 2022": 10.0
    },
    "competition_grades": {
      "Пролетни 2025": 6.0,
      "Пролетни 2024": 5.0,
      "Есенни 2022": 4.0,
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Калоян Калинов Димитров",
    "grade": 12,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2023": 20.5,
      "Пролетни 2023": 23.25,
      "Есенни 2022": 17.3,
      "Олимпиада 2022": 18.0,
      "Пролетни 2022": 16.5,
      "Есенни 2021": 25.0,
      "Олимпиада 2021": 10.5,
      "2  кръг 2021": 30.0
    },
    "competition_grades": {
      "Есенни 2023": 5.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетни 2022": 3.0,
      "Есенни 2021": 3.0,
      "Олимпиада 2021": 2.0,
      "2  кръг 2021": 2.0
    }
  },
  {
    "name": "Александър Георгиев Иванов",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 11.0,
      "Есенни 2024": 7.0,
      "Пролетни 2024": 5.0
    },
    "competition_grades": {
      "Пролетни 2025": 6.0,
      "Есенни 2024": 6.0,
      "Пролетни 2024": 5.0
    }
  },
  {
    "name": "Кристиан Николаев Велчев",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 2.8,
      "Есенни 2024": 3.5,
      "Пролетни 2024": 7.6,
      "Есенни 2023": 20.0,
      "Пролетни 2023": 10.5,
      "Пролетни 2022": 6.5,
      "Пролетни 2021": 23.5,
      "Есенни 2019": 17.55
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Пролетни 2024": 7.0,
      "Есенни 2023": 5.0,
      "Пролетни 2023": 4.0,
      "Пролетни 2022": 3.0,
      "Пролетни 2021": 2.0,
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Ивайло Станимиров Мъндев",
    "grade": 12,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Пролетни 2025": 6.5,
      "Есенни 2024": 3.5,
      "Пролетни 2024": 9.5,
      "Есенни 2023": 10.5,
      "Есенни 2022": 7.5,
      "Пролетни 2022": 10.0
    },
    "competition_grades": {
      "Пролетни 2025": 7.0,
      "Есенни 2024": 7.0,
      "Пролетни 2024": 5.0,
      "Есенни 2023": 5.0,
      "Есенни 2022": 4.0,
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Балвис Симеонов Пенчев",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2024": 9.0,
      "Пролетни 2024": 10.0,
      "Пролетни 2023": 10.0,
      "Есенни 2022": 19.0,
      "Олимпиада 2022": 9.5,
      "Есенни 2021": 22.0
    },
    "competition_grades": {
      "Есенни 2024": 6.0,
      "Пролетни 2024": 5.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Есенни 2021": 3.0
    }
  },
  {
    "name": "Николета Калинова Стойнова",
    "grade": 12,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2025": 12.0,
      "Пролетни 2023": 9.0,
      "Есенни 2022": 10.4,
      "Пролетни 2022": 13.0,
      "Пролетни 2021": 18.5,
      "Олимпиада 2020": 9.0,
      "2 кръг 2020": 28.5
    },
    "competition_grades": {
      "Пролетни 2025": 6.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Пролетни 2022": 3.0,
      "Пролетни 2021": 2.0,
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Ивайло Илиев Христов",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2024": 3.1,
      "Есенни 2023": 14.5,
      "Пролетни 2023": 21.0,
      "Есенни 2022": 11.5,
      "Олимпиада 2022": 20.5,
      "Пролетни 2022": 21.5,
      "Есенни 2021": 24.0,
      "Пролетни 2021": 20.0
    },
    "competition_grades": {
      "Пролетни 2024": 7.0,
      "Есенни 2023": 5.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетни 2022": 3.0,
      "Есенни 2021": 3.0,
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Рени Огнянова Паскалева",
    "grade": 12,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Есенни 2023": 16.0,
      "Олимпиада 2023": 18.0,
      "Олимпиада 2022": 17.5,
      "Пролетни 2022": 28.0,
      "Есенни 2021": 25.0,
      "Олимпиада 2021": 19.0,
      "2  кръг 2021": 30.0,
      "2 кръг 2020": 28.5,
      "Есенни 2019": 23.0
    },
    "competition_grades": {
      "Есенни 2023": 5.0,
      "Олимпиада 2023": 4.0,
      "Олимпиада 2022": 3.0,
      "Пролетни 2022": 3.0,
      "Есенни 2021": 3.0,
      "Олимпиада 2021": 2.0,
      "2  кръг 2021": 2.0,
      "2 кръг 2020": 1.0,
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Ивайло Емилов Благоев",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2024": 6.5,
      "Пролетни 2024": 13.5,
      "Олимпиада 2023": 11.0
    },
    "competition_grades": {
      "Есенни 2024": 6.0,
      "Пролетни 2024": 5.0,
      "Олимпиада 2023": 4.0
    }
  },
  {
    "name": "Борис Дилянов Биков",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2024": 14.0,
      "Есенни 2023": 16.0,
      "Есенни 2022": 12.5
    },
    "competition_grades": {
      "Пролетни 2024": 5.0,
      "Есенни 2023": 5.0,
      "Есенни 2022": 4.0
    }
  },
  {
    "name": "Димо Симеонов Петков",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2024": 12.5,
      "Пролетни 2023": 14.5,
      "Есенни 2022": 13.5,
      "Пролетни 2022": 12.5,
      "Пролетни 2021": 14.75
    },
    "competition_grades": {
      "Пролетни 2024": 5.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Пролетни 2022": 3.0,
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Николай Красимиров Костадинов",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2025": 8.75,
      "Есенни 2024": 3.0
    },
    "competition_grades": {
      "Пролетни 2025": 6.0,
      "Есенни 2024": 6.0
    }
  },
  {
    "name": "Калина Ивайлова Цонева",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2024": 6.5,
      "Есенни 2023": 15.0
    },
    "competition_grades": {
      "Есенни 2024": 6.0,
      "Есенни 2023": 5.0
    }
  },
  {
    "name": "Михаил Христов Бараков",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенни 2023": 13.0,
      "Пролетни 2023": 10.0,
      "Есенни 2022": 8.0,
      "Пролетни 2022": 19.0,
      "Пролетни 2021": 10.25
    },
    "competition_grades": {
      "Есенни 2023": 5.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Пролетни 2022": 3.0,
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Димитър Пламенов Попов",
    "grade": 12,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2024": 12.0,
      "Пролетни 2023": 13.0,
      "Пролетни 2022": 11.5,
      "Есенни 2019": 8.35
    },
    "competition_grades": {
      "Пролетни 2024": 5.0,
      "Пролетни 2023": 4.0,
      "Пролетни 2022": 3.0,
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Сияна Тодорова Майсторова",
    "grade": 12,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2023": 20.0,
      "Есенни 2022": 10.0,
      "Пролетни 2022": 21.5,
      "Олимпиада 2021": 8.0,
      "Пролетни 2021": 21.75,
      "2  кръг 2021": 29.8
    },
    "competition_grades": {
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Пролетни 2022": 3.0,
      "Олимпиада 2021": 2.0,
      "Пролетни 2021": 2.0,
      "2  кръг 2021": 2.0
    }
  },
  {
    "name": "Димитър Борисов Попов",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2023": 10.5,
      "Пролетни 2023": 16.75,
      "Пролетни 2022": 7.5
    },
    "competition_grades": {
      "Есенни 2023": 5.0,
      "Пролетни 2023": 4.0,
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Симона Петрова Гагарова",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 17.5,
      "Есенни 2022": 19.5
    },
    "competition_grades": {
      "Олимпиада 2023": 4.0,
      "Есенни 2022": 4.0
    }
  },
  {
    "name": "Атанас Проданов Сталев",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2023": 16.5,
      "Есенни 2022": 11.5,
      "Пролетни 2021": 19.25,
      "Олимпиада 2020": 26.0,
      "2 кръг 2020": 30.0,
      "Есенни 2019": 21.0
    },
    "competition_grades": {
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Пролетни 2021": 2.0,
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0,
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Кристиян Даниелов Николов",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2022": 16.0,
      "Олимпиада 2022": 8.0,
      "Есенни 2021": 23.0,
      "Олимпиада 2021": 10.0,
      "Пролетни 2021": 18.0,
      "2  кръг 2021": 29.5
    },
    "competition_grades": {
      "Есенни 2022": 4.0,
      "Олимпиада 2022": 3.0,
      "Есенни 2021": 3.0,
      "Олимпиада 2021": 2.0,
      "Пролетни 2021": 2.0,
      "2  кръг 2021": 2.0
    }
  },
  {
    "name": "Борис Кирилов Велчев",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2024": 13.5
    },
    "competition_grades": {
      "Пролетни 2024": 5.0
    }
  },
  {
    "name": "Даяна Цветелинова Маринова",
    "grade": 12,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2024": 6.5,
      "Есенни 2023": 5.5,
      "Пролетни 2023": 1.5,
      "Есенни 2022": 6.5
    },
    "competition_grades": {
      "Пролетни 2024": 5.0,
      "Есенни 2023": 5.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0
    }
  },
  {
    "name": "Борис Ивайлов Карабойков",
    "grade": 12,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Есенни 2023": 5.0,
      "Пролетни 2023": 4.5,
      "Есенни 2022": 10.5,
      "Пролетни 2022": 9.0,
      "Пролетни 2021": 19.0
    },
    "competition_grades": {
      "Есенни 2023": 5.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Пролетни 2022": 3.0,
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Александра Петрова Кобакова",
    "grade": 12,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2024": 6.5
    },
    "competition_grades": {
      "Есенни 2024": 6.0
    }
  },
  {
    "name": "Ралица Валентинова Йорданова",
    "grade": 12,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетни 2024": 6.0,
      "Есенни 2022": 11.4,
      "Пролетни 2022": 9.5
    },
    "competition_grades": {
      "Пролетни 2024": 5.0,
      "Есенни 2022": 4.0,
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Иван Станимиров Атанасов",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2024": 11.0
    },
    "competition_grades": {
      "Пролетни 2024": 5.0
    }
  },
  {
    "name": "Стефко Тихомиров Николаев",
    "grade": 12,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2024": 6.0,
      "Пролетни 2023": 5.5,
      "Пролетни 2022": 9.5,
      "Есенни 2019": 11.95
    },
    "competition_grades": {
      "Пролетни 2024": 5.0,
      "Пролетни 2023": 4.0,
      "Пролетни 2022": 3.0,
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Никола Николов Пъдарев",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенни 2022": 16.5,
      "Олимпиада 2021": 10.5,
      "Пролетни 2021": 23.5,
      "2  кръг 2021": 30.0
    },
    "competition_grades": {
      "Есенни 2022": 4.0,
      "Олимпиада 2021": 2.0,
      "Пролетни 2021": 2.0,
      "2  кръг 2021": 2.0
    }
  },
  {
    "name": "Светослав Спасов Иванов",
    "grade": 12,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2024": 7.0,
      "Есенни 2022": 7.5
    },
    "competition_grades": {
      "Пролетни 2024": 5.0,
      "Есенни 2022": 4.0
    }
  },
  {
    "name": "Любомир Илианов Стойчев",
    "grade": 12,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2024": 6.5,
      "Пролетни 2023": 6.75
    },
    "competition_grades": {
      "Пролетни 2024": 5.0,
      "Пролетни 2023": 4.0
    }
  },
  {
    "name": "Кристиян Пламен Милтиядов",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2023": 12.0
    },
    "competition_grades": {
      "Есенни 2023": 5.0
    }
  },
  {
    "name": "Теодора Свиленова Мачева",
    "grade": 12,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2023": 8.0,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 4.9
    },
    "competition_grades": {
      "Есенни 2023": 5.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0
    }
  },
  {
    "name": "Виктор Невелинов Василев",
    "grade": 12,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Есенни 2023": 3.5,
      "Пролетни 2023": 9.5,
      "Пролетни 2022": 5.0,
      "Олимпиада 2020": 7.0,
      "2 кръг 2020": 28.5
    },
    "competition_grades": {
      "Есенни 2023": 5.0,
      "Пролетни 2023": 4.0,
      "Пролетни 2022": 3.0,
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Александра Миленова Петкова",
    "grade": 12,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2023": 9.5,
      "Пролетни 2023": 0.0,
      "Есенни 2022": 4.7
    },
    "competition_grades": {
      "Есенни 2023": 5.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0
    }
  },
  {
    "name": "София Георгиева Апостолова",
    "grade": 12,
    "school": "ППМГ \"Никола Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетни 2024": 5.5,
      "Есенни 2023": 3.5,
      "Пролетни 2023": 1.0
    },
    "competition_grades": {
      "Пролетни 2024": 5.0,
      "Есенни 2023": 5.0,
      "Пролетни 2023": 4.0
    }
  },
  {
    "name": "Николай Евгениев Николаев",
    "grade": 12,
    "school": "ППМГ \"Екзарх Антим I\"",
    "city": "Видин",
    "competitions": {
      "Олимпиада 2023": 15.0
    },
    "competition_grades": {
      "Олимпиада 2023": 4.0
    }
  },
  {
    "name": "Нина Недкова Минчева",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2024": 3.0,
      "Есенни 2023": 7.0
    },
    "competition_grades": {
      "Пролетни 2024": 5.0,
      "Есенни 2023": 5.0
    }
  },
  {
    "name": "Александър Танер Тасим",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2022": 16.9,
      "Пролетни 2021": 19.5,
      "Олимпиада 2020": 10.0,
      "2 кръг 2020": 28.5
    },
    "competition_grades": {
      "Есенни 2022": 4.0,
      "Пролетни 2021": 2.0,
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Борис Владимиров Михов",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2024": 4.5
    },
    "competition_grades": {
      "Есенни 2024": 6.0
    }
  },
  {
    "name": "Петко Валериев Лазаров",
    "grade": 12,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2022": 7.0,
      "Пролетни 2022": 15.5,
      "Пролетни 2021": 24.0
    },
    "competition_grades": {
      "Есенни 2022": 4.0,
      "Пролетни 2022": 3.0,
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Георги Данаилов Парушев",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2024": 4.0,
      "Есенни 2023": 3.0
    },
    "competition_grades": {
      "Пролетни 2024": 5.0,
      "Есенни 2023": 5.0
    }
  },
  {
    "name": "Тодор Фаршидов Каракочев",
    "grade": 12,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2022": 9.7,
      "Пролетни 2022": 16.0,
      "Есенни 2019": 12.0
    },
    "competition_grades": {
      "Есенни 2022": 4.0,
      "Пролетни 2022": 3.0,
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Мария Миленова Динкова",
    "grade": 12,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2023": 5.5,
      "Пролетни 2023": 3.0,
      "Есенни 2022": 2.5
    },
    "competition_grades": {
      "Есенни 2023": 5.0,
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0
    }
  },
  {
    "name": "Виктор Георгиев Риджалски",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2024": 5.0
    },
    "competition_grades": {
      "Пролетни 2024": 5.0
    }
  },
  {
    "name": "Тома Спасов Тасев",
    "grade": 12,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетни 2023": 1.5,
      "Есенни 2022": 6.0,
      "Пролетни 2022": 12.5
    },
    "competition_grades": {
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Мира Стаменова Дулевска",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 16.5,
      "Пролетни 2021": 17.0,
      "2  кръг 2021": 30.0
    },
    "competition_grades": {
      "Олимпиада 2021": 2.0,
      "Пролетни 2021": 2.0,
      "2  кръг 2021": 2.0
    }
  },
  {
    "name": "Мартин Михайлов Марковски",
    "grade": 12,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2024": 4.5
    },
    "competition_grades": {
      "Пролетни 2024": 5.0
    }
  },
  {
    "name": "Борис Калинов Азгоров",
    "grade": 12,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 13.0,
      "Пролетни 2021": 28.0
    },
    "competition_grades": {
      "Пролетни 2022": 3.0,
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Йоана Стефанова Станева",
    "grade": 12,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2023": 3.5,
      "Есенни 2022": 6.5,
      "Есенни 2019": 14.9
    },
    "competition_grades": {
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Костадин Жулиенов Граматиков",
    "grade": 12,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Пролетни 2023": 2.5,
      "Есенни 2022": 6.2,
      "Пролетни 2022": 4.5
    },
    "competition_grades": {
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Александър Александров Попвеличков",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2023": 4.5,
      "Есенни 2019": 14.35
    },
    "competition_grades": {
      "Есенни 2023": 5.0,
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Мартин Бориславов Сотиров",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 12.5,
      "Пролетни 2021": 16.5
    },
    "competition_grades": {
      "Пролетни 2022": 3.0,
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Преслав Преславов Петров",
    "grade": 12,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетни 2023": 4.0,
      "Есенни 2022": 3.0,
      "Пролетни 2022": 3.75
    },
    "competition_grades": {
      "Пролетни 2023": 4.0,
      "Есенни 2022": 4.0,
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Райна Георгиева Георгиева",
    "grade": 12,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетни 2023": 4.5,
      "Пролетни 2022": 7.5
    },
    "competition_grades": {
      "Пролетни 2023": 4.0,
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Мария Тервел Павлова",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 15.0,
      "Есенни 2019": 17.13
    },
    "competition_grades": {
      "Пролетни 2022": 3.0,
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Николай Василев Деспотов",
    "grade": 12,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2022": 15.0
    },
    "competition_grades": {
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Веселина Веселинова Василева",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 9.5,
      "Пролетни 2021": 10.5
    },
    "competition_grades": {
      "Пролетни 2022": 3.0,
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Костадин Стефанов Кудев",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 6.0,
      "Пролетни 2021": 18.0
    },
    "competition_grades": {
      "Пролетни 2022": 3.0,
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Росен Иванов Маринов",
    "grade": 12,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 23.0,
      "2 кръг 2020": 30.0,
      "Есенни 2019": 19.68
    },
    "competition_grades": {
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0,
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Далия Адреанова Петрова",
    "grade": 12,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2023": 3.0,
      "Пролетни 2022": 6.25
    },
    "competition_grades": {
      "Пролетни 2023": 4.0,
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Емил Стефанов Стефанов",
    "grade": 12,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Пролетни 2022": 11.0
    },
    "competition_grades": {
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Михаела Георгиева Христова",
    "grade": 12,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2022": 10.75
    },
    "competition_grades": {
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Георгий Валерьевич Можейко",
    "grade": 12,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 23.0,
      "2 кръг 2020": 28.5
    },
    "competition_grades": {
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Емил Руменов Ортомаров",
    "grade": 12,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Пролетни 2022": 10.0
    },
    "competition_grades": {
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Цветослав Цветлинов Попов",
    "grade": 12,
    "school": "ППМГ \"Екзарх Антим I\"",
    "city": "Видин",
    "competitions": {
      "Олимпиада 2020": 19.0,
      "2 кръг 2020": 28.5
    },
    "competition_grades": {
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Валери Тодоров Иванов",
    "grade": 12,
    "school": "ПГКПИ ",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2023": 1.5,
      "Пролетни 2022": 5.5
    },
    "competition_grades": {
      "Пролетни 2023": 4.0,
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Ния Данаилова Господинова",
    "grade": 12,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2022": 5.0
    },
    "competition_grades": {
      "Есенни 2022": 4.0
    }
  },
  {
    "name": "Нора Огнянова Паскалева",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "2 кръг 2020": 28.5,
      "Есенни 2019": 25.75
    },
    "competition_grades": {
      "2 кръг 2020": 1.0,
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Момчил Христов Христов",
    "grade": 12,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2022": 7.0,
      "Есенни 2019": 9.3
    },
    "competition_grades": {
      "Пролетни 2022": 3.0,
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Стефани Илиева Стоянова",
    "grade": 12,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Олимпиада 2020": 13.0,
      "2 кръг 2020": 28.5
    },
    "competition_grades": {
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Руси Миленов Хаджийски",
    "grade": 12,
    "school": "ППМГ \"Васил Левски\"",
    "city": "Смолян",
    "competitions": {
      "Есенни 2022": 4.2
    },
    "competition_grades": {
      "Есенни 2022": 4.0
    }
  },
  {
    "name": "Йоана Викторова Стоянова",
    "grade": 12,
    "school": "33 СОУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 10.0,
      "2 кръг 2020": 28.5
    },
    "competition_grades": {
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Николай Борисов Мутафчиев",
    "grade": 12,
    "school": "55 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 10.0,
      "2 кръг 2020": 28.5
    },
    "competition_grades": {
      "Олимпиада 2020": 1.0,
      "2 кръг 2020": 1.0
    }
  },
  {
    "name": "Яна Бориславова Спасова",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 17.25
    },
    "competition_grades": {
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Биляна Емилова Христова",
    "grade": 12,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2023": 3.0
    },
    "competition_grades": {
      "Пролетни 2023": 4.0
    }
  },
  {
    "name": "Камелия Искренова Тодорова",
    "grade": 12,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2022": 7.0
    },
    "competition_grades": {
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Александра Пламенова Димитрова",
    "grade": 12,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетни 2021": 16.5
    },
    "competition_grades": {
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Данаил Венциславов Маринов",
    "grade": 12,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2021": 16.5
    },
    "competition_grades": {
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Десислава Иванова Гарванова",
    "grade": 12,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 16.45
    },
    "competition_grades": {
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Виктория Йорданова Господинова",
    "grade": 12,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетни 2022": 6.5
    },
    "competition_grades": {
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Кристиан Даниелов Петров",
    "grade": 12,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Есенни 2022": 3.5
    },
    "competition_grades": {
      "Есенни 2022": 4.0
    }
  },
  {
    "name": "Стефани Боянова Найденова",
    "grade": 12,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2022": 3.5
    },
    "competition_grades": {
      "Есенни 2022": 4.0
    }
  },
  {
    "name": "Кристиан Венелинов Василев",
    "grade": 12,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2023": 2.5
    },
    "competition_grades": {
      "Пролетни 2023": 4.0
    }
  },
  {
    "name": "Христиан Мартинов Монев",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2023": 2.5
    },
    "competition_grades": {
      "Пролетни 2023": 4.0
    }
  },
  {
    "name": "Илиян Милков Мурадилов",
    "grade": 12,
    "school": "ППМГ \"Васил Левски\"",
    "city": "Смолян",
    "competitions": {
      "Есенни 2022": 2.1,
      "Пролетни 2022": 2.0
    },
    "competition_grades": {
      "Есенни 2022": 4.0,
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Николас Ерлинг Лунд Нилсен",
    "grade": 12,
    "school": "ГПЧЕ \"Йоан Екзарх\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2022": 5.5
    },
    "competition_grades": {
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Борис Ангелов Калоферов",
    "grade": 12,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2021": 12.5
    },
    "competition_grades": {
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Николай Стефанов Младенов",
    "grade": 12,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2022": 5.25
    },
    "competition_grades": {
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Марина Калинова Димитранова",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2021": 12.0
    },
    "competition_grades": {
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Ивана Иванова Иванова",
    "grade": 12,
    "school": "ЕГ \"Акад. Людмил Стоянов\"",
    "city": "Благоевград",
    "competitions": {
      "Пролетни 2022": 5.0
    },
    "competition_grades": {
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Виктор Светлинов Росенов",
    "grade": 12,
    "school": "ПМГ",
    "city": "Перник",
    "competitions": {
      "Пролетни 2023": 2.0
    },
    "competition_grades": {
      "Пролетни 2023": 4.0
    }
  },
  {
    "name": "Никола Николаев Георгиев",
    "grade": 12,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Пролетни 2021": 11.0
    },
    "competition_grades": {
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Боряна Веселинова Янева",
    "grade": 12,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетни 2022": 4.0
    },
    "competition_grades": {
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Данаил Димчев Недялков",
    "grade": 12,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2023": 1.5
    },
    "competition_grades": {
      "Пролетни 2023": 4.0
    }
  },
  {
    "name": "Марк Владимиров Иванов",
    "grade": 12,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2022": 3.5
    },
    "competition_grades": {
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Мартин Николаев Вълчев",
    "grade": 12,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетни 2022": 3.0
    },
    "competition_grades": {
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Ралица Мехмедова Ибрахимова",
    "grade": 12,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетни 2021": 6.5
    },
    "competition_grades": {
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Катрин Асенова Петрова",
    "grade": 12,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетни 2022": 2.5
    },
    "competition_grades": {
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Васил Константинов Кременаров",
    "grade": 12,
    "school": "ППМГ \"Васил Левски\"",
    "city": "Смолян",
    "competitions": {
      "Пролетни 2022": 2.0
    },
    "competition_grades": {
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Тодор Мариянов Зеленков",
    "grade": 12,
    "school": "ОУ \"Св. П. Евтимий\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 14.5
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Боряна Иванова Кюркчиева",
    "grade": 12,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 13.05
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Борис Димитров Тодоров",
    "grade": 12,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2019": 12.25
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Марина Мариян Николаева",
    "grade": 12,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2021": 3.0
    },
    "competition_grades": {
      "Пролетни 2021": 2.0
    }
  },
  {
    "name": "Георги Ивайлов Велков",
    "grade": 12,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Пролетни 2023": 0.5
    },
    "competition_grades": {
      "Пролетни 2023": 4.0
    }
  },
  {
    "name": "Емануил Христов Серафимов",
    "grade": 12,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 8.5
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Никол Николаева Острова",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 8.25
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Ивайло Анастасов Краев",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 8.0
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Катерина Александрова Димитрова",
    "grade": 12,
    "school": "ППМГ \"Васил Левски\"",
    "city": "Смолян",
    "competitions": {
      "Пролетни 2022": 1.0
    },
    "competition_grades": {
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Калоян Славов Гърков",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 7.3
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Димитър Димитров Димитров",
    "grade": 12,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 7.2
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Стойчо Цветанов Лахтариев",
    "grade": 12,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2022": 0.5
    },
    "competition_grades": {
      "Есенни 2022": 4.0
    }
  },
  {
    "name": "Ния Георгиева Владова",
    "grade": 12,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 6.6
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Йоанна Николова Чанева",
    "grade": 12,
    "school": "ОУ \"Св. П. Евтимий\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 5.7
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Панайот Иванов Димитров",
    "grade": 12,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2019": 5.3
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Мартин Тодоров Ганчев",
    "grade": 12,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 5.0
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Кристина Красимирова Илиева",
    "grade": 12,
    "school": "ОУ \"Иван Вазов\"",
    "city": "Горна Оряховица",
    "competitions": {
      "Есенни 2019": 4.6
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Карина Валериева Аспарухова",
    "grade": 12,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 4.0
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "София Руменова Рашева",
    "grade": 12,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 3.75
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Любомир Мирославов Великов",
    "grade": 12,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2022": 0.5
    },
    "competition_grades": {
      "Пролетни 2022": 3.0
    }
  },
  {
    "name": "Христиана Христова Стефанова",
    "grade": 12,
    "school": "ОУ \"Св. П. Евтимий\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 3.5
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Преслав Дончев Панайотов",
    "grade": 12,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 3.25
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Надежда Паисиева Христова",
    "grade": 12,
    "school": "ОУ \"Св. П. Евтимий\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 3.1
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Борислав Христов Христов",
    "grade": 12,
    "school": "ОУ \"Иван Вазов\"",
    "city": "Горна Оряховица",
    "competitions": {
      "Есенни 2019": 2.5
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Дариян Живков Василев",
    "grade": 12,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2019": 2.2
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Йордан Нанков Нанков",
    "grade": 12,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 1.5
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Мария Георгиева Арсова",
    "grade": 12,
    "school": "ОУ \"Иван Вазов\"",
    "city": "Горна Оряховица",
    "competitions": {
      "Есенни 2019": 1.5
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Никола Борисов Стефанов",
    "grade": 12,
    "school": "ОУ \"Иван Вазов\"",
    "city": "Горна Оряховица",
    "competitions": {
      "Есенни 2019": 1.5
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Ивайло Марианов Маринов",
    "grade": 12,
    "school": "ОУ \"Иван Вазов\"",
    "city": "Горна Оряховица",
    "competitions": {
      "Есенни 2019": 1.0
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Тихомир Калоянов Колев",
    "grade": 12,
    "school": "ОУ \"Иван Вазов\"",
    "city": "Горна Оряховица",
    "competitions": {
      "Есенни 2019": 1.0
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Свилена Красимирова Грешева",
    "grade": 12,
    "school": "ОУ \"Иван Вазов\"",
    "city": "Горна Оряховица",
    "competitions": {
      "Есенни 2019": 0.5
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Недко Георгиев Георгиев",
    "grade": 12,
    "school": "ОУ \"Иван Вазов\"",
    "city": "Горна Оряховица",
    "competitions": {
      "Есенни 2019": 0.1
    },
    "competition_grades": {
      "Есенни 2019": 1.0
    }
  },
  {
    "name": "Радостин Йосифов Гавраилов",
    "grade": 12,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2022": 0.0
    },
    "competition_grades": {
      "Есенни 2022": 4.0
    }
  },
  {
    "name": "Стефан Атанасов Куманов",
    "grade": 12,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2022": 0.0
    },
    "competition_grades": {
      "Есенни 2022": 4.0
    }
  },
  {
    "name": "Баян Момчилов Гечев",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 72.2,
      "Пролетни 2024": 16.4,
      "Есенни 2023": 23.5,
      "Олимпиада 2023": 79.0,
      "Пролетни 2023": 26.3,
      "Есенни 2022": 11.7,
      "Олимпиада 2022": 62.5,
      "Пролетни 2022": 4.5,
      "Есенни 2021": 26.0,
      "Олимпиада 2021": 24.5,
      "Пролетни 2021": 26.0,
      "2  кръг 2021": 26.0
    },
    "competition_grades": {
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 7.0,
      "Есенни 2023": 7.0,
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 7.0,
      "Есенни 2022": 7.0,
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 7.0,
      "Есенни 2021": 5.0,
      "Олимпиада 2021": 3.0,
      "Пролетни 2021": 3.0,
      "2  кръг 2021": 3.0
    }
  },
  {
    "name": "Гео Геов Калфов",
    "grade": 13,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 69.0,
      "Пролетни 2024": 17.7,
      "Есенни 2023": 25.2,
      "Олимпиада 2023": 67.75,
      "Пролетни 2023": 22.5,
      "Есенни 2022": 7.45,
      "Олимпиада 2022": 33.0,
      "Пролетни 2022": 15.0,
      "Есенни 2021": 29.0,
      "Олимпиада 2021": 28.0,
      "Пролетни 2021": 6.5,
      "2  кръг 2021": 28.0,
      "Олимпиада 2020": 30.0,
      "2 кръг 2020": 30.0,
      "Есенни 2019": 26.5,
      "Олимпиада 2019": 21.0,
      "Пролетни 2019": 29.0,
      "Есенни 2018": 24.5
    },
    "competition_grades": {
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 7.0,
      "Есенни 2023": 7.0,
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 7.0,
      "Есенни 2022": 7.0,
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 7.0,
      "Есенни 2021": 5.0,
      "Олимпиада 2021": 3.0,
      "Пролетни 2021": 7.0,
      "2  кръг 2021": 3.0,
      "Олимпиада 2020": 2.0,
      "2 кръг 2020": 2.0,
      "Есенни 2019": 2.0,
      "Олимпиада 2019": 1.0,
      "Пролетни 2019": 1.0,
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Георги Костадинов Костадинов",
    "grade": 13,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2024": 66.5,
      "Пролетни 2024": 20.3,
      "Есенни 2023": 21.2,
      "Олимпиада 2023": 53.8,
      "Пролетни 2023": 14.7,
      "Есенни 2022": 12.75,
      "Олимпиада 2022": 56.5,
      "Пролетни 2022": 3.0,
      "Есенни 2021": 29.5,
      "Олимпиада 2021": 28.75,
      "Пролетни 2021": 21.0,
      "2  кръг 2021": 28.5,
      "Олимпиада 2020": 21.5,
      "2 кръг 2020": 26.0,
      "Есенни 2019": 28.75,
      "Олимпиада 2019": 25.0,
      "Пролетни 2019": 28.0,
      "Есенни 2018": 25.25
    },
    "competition_grades": {
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 7.0,
      "Есенни 2023": 7.0,
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 7.0,
      "Есенни 2022": 7.0,
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 7.0,
      "Есенни 2021": 6.0,
      "Олимпиада 2021": 3.0,
      "Пролетни 2021": 3.0,
      "2  кръг 2021": 3.0,
      "Олимпиада 2020": 2.0,
      "2 кръг 2020": 2.0,
      "Есенни 2019": 2.0,
      "Олимпиада 2019": 1.0,
      "Пролетни 2019": 1.0,
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Румен Любомиров Димитров",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 56.5,
      "Пролетни 2024": 16.2,
      "Есенни 2023": 20.0,
      "Олимпиада 2023": 72.1,
      "Пролетни 2023": 14.8,
      "Есенни 2022": 7.95,
      "Олимпиада 2022": 62.25,
      "Пролетни 2022": 8.0,
      "Есенни 2021": 28.5,
      "Олимпиада 2021": 29.0,
      "Пролетни 2021": 17.0,
      "2  кръг 2021": 26.0,
      "Олимпиада 2020": 29.5,
      "2 кръг 2020": 26.0,
      "Есенни 2019": 24.0,
      "Есенни 2018": 26.0
    },
    "competition_grades": {
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 7.0,
      "Есенни 2023": 7.0,
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 7.0,
      "Есенни 2022": 7.0,
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 7.0,
      "Есенни 2021": 5.0,
      "Олимпиада 2021": 3.0,
      "Пролетни 2021": 3.0,
      "2  кръг 2021": 3.0,
      "Олимпиада 2020": 2.0,
      "2 кръг 2020": 2.0,
      "Есенни 2019": 2.0,
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Енислав Станиславов Николов",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 55.0,
      "Пролетни 2024": 23.25,
      "Есенни 2023": 21.5,
      "Олимпиада 2023": 44.05,
      "Пролетни 2023": 20.0,
      "Есенни 2022": 3.45,
      "Олимпиада 2022": 29.5,
      "Пролетни 2022": 27.5,
      "Есенни 2021": 26.0,
      "Олимпиада 2021": 28.5,
      "Пролетни 2021": 23.0,
      "2  кръг 2021": 28.0,
      "Олимпиада 2020": 20.0,
      "2 кръг 2020": 26.0,
      "Есенни 2019": 29.25,
      "Олимпиада 2019": 27.5,
      "Пролетни 2019": 26.0,
      "Есенни 2018": 29.5
    },
    "competition_grades": {
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 6.0,
      "Есенни 2023": 6.0,
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 6.0,
      "Есенни 2022": 7.0,
      "Олимпиада 2022": 4.0,
      "Пролетни 2022": 4.0,
      "Есенни 2021": 4.0,
      "Олимпиада 2021": 3.0,
      "Пролетни 2021": 3.0,
      "2  кръг 2021": 3.0,
      "Олимпиада 2020": 2.0,
      "2 кръг 2020": 2.0,
      "Есенни 2019": 2.0,
      "Олимпиада 2019": 1.0,
      "Пролетни 2019": 1.0,
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Божидар Николаев Бозов",
    "grade": 13,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 52.3,
      "Пролетни 2024": 16.3,
      "Есенни 2023": 21.5,
      "Олимпиада 2023": 67.5,
      "Пролетни 2023": 15.7,
      "Есенни 2022": 8.2,
      "Олимпиада 2022": 24.0,
      "Пролетни 2022": 29.5,
      "Есенни 2021": 22.0,
      "Олимпиада 2021": 22.5,
      "Пролетни 2021": 18.75,
      "2  кръг 2021": 27.0
    },
    "competition_grades": {
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 7.0,
      "Есенни 2023": 7.0,
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 7.0,
      "Есенни 2022": 7.0,
      "Олимпиада 2022": 4.0,
      "Пролетни 2022": 4.0,
      "Есенни 2021": 4.0,
      "Олимпиада 2021": 3.0,
      "Пролетни 2021": 3.0,
      "2  кръг 2021": 3.0
    }
  },
  {
    "name": "Калина Росенова Досева",
    "grade": 13,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Олимпиада 2024": 45.75,
      "Пролетни 2024": 13.0,
      "Есенни 2023": 18.0,
      "Олимпиада 2023": 54.65,
      "Пролетни 2023": 20.1,
      "Есенни 2022": 5.15,
      "Олимпиада 2022": 27.0,
      "Пролетни 2022": 28.5,
      "Есенни 2021": 26.0,
      "Олимпиада 2021": 17.0,
      "Пролетни 2021": 17.75,
      "2  кръг 2021": 27.0,
      "Олимпиада 2020": 17.0,
      "2 кръг 2020": 28.0,
      "Есенни 2019": 17.0,
      "Олимпиада 2019": 16.5,
      "Есенни 2018": 27.0
    },
    "competition_grades": {
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 7.0,
      "Есенни 2023": 7.0,
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 7.0,
      "Есенни 2022": 7.0,
      "Олимпиада 2022": 4.0,
      "Пролетни 2022": 4.0,
      "Есенни 2021": 4.0,
      "Олимпиада 2021": 3.0,
      "Пролетни 2021": 3.0,
      "2  кръг 2021": 3.0,
      "Олимпиада 2020": 2.0,
      "2 кръг 2020": 2.0,
      "Есенни 2019": 2.0,
      "Олимпиада 2019": 1.0,
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Марио Иванов Янакиев",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 40.75,
      "Пролетни 2024": 21.75,
      "Есенни 2023": 18.2,
      "Олимпиада 2023": 16.2,
      "Пролетни 2023": 20.0,
      "Есенни 2022": 19.75,
      "Олимпиада 2022": 17.0,
      "Пролетни 2022": 25.0,
      "Есенни 2021": 20.0,
      "Олимпиада 2021": 22.5,
      "Пролетни 2021": 13.75,
      "2  кръг 2021": 27.0
    },
    "competition_grades": {
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 6.0,
      "Есенни 2023": 7.0,
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 5.0,
      "Есенни 2022": 5.0,
      "Олимпиада 2022": 4.0,
      "Пролетни 2022": 4.0,
      "Есенни 2021": 4.0,
      "Олимпиада 2021": 3.0,
      "Пролетни 2021": 3.0,
      "2  кръг 2021": 3.0
    }
  },
  {
    "name": "Орлин Пенчев Кехаяминчев",
    "grade": 13,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 30.25,
      "Пролетни 2024": 10.1,
      "Есенни 2023": 19.0,
      "Олимпиада 2023": 47.85,
      "Пролетни 2023": 11.9,
      "Есенни 2022": 8.45,
      "Олимпиада 2022": 25.5,
      "Пролетни 2022": 29.0,
      "Есенни 2021": 20.5,
      "Пролетни 2021": 13.0,
      "Пролетни 2019": 24.5
    },
    "competition_grades": {
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 7.0,
      "Есенни 2023": 7.0,
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 7.0,
      "Есенни 2022": 7.0,
      "Олимпиада 2022": 4.0,
      "Пролетни 2022": 4.0,
      "Есенни 2021": 4.0,
      "Пролетни 2021": 3.0,
      "Пролетни 2019": 1.0
    }
  },
  {
    "name": "Явор Пламенов Василев",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 42.75,
      "Есенни 2023": 13.5,
      "Олимпиада 2023": 20.5,
      "Пролетни 2023": 28.5,
      "Есенни 2022": 14.25,
      "Пролетни 2022": 27.5,
      "Олимпиада 2021": 19.5,
      "Пролетни 2021": 11.0,
      "2  кръг 2021": 27.0
    },
    "competition_grades": {
      "Олимпиада 2024": 5.0,
      "Есенни 2023": 6.0,
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 5.0,
      "Есенни 2022": 5.0,
      "Пролетни 2022": 4.0,
      "Олимпиада 2021": 3.0,
      "Пролетни 2021": 3.0,
      "2  кръг 2021": 3.0
    }
  },
  {
    "name": "Преслав Ивайлов Георгиев",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 26.0,
      "Пролетни 2024": 23.75,
      "Есенни 2023": 27.0,
      "Олимпиада 2023": 20.5,
      "Пролетни 2023": 29.5
    },
    "competition_grades": {
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 6.0,
      "Есенни 2023": 6.0,
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 5.0
    }
  },
  {
    "name": "Георги Митков Стратиев",
    "grade": 13,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Олимпиада 2024": 16.0,
      "Пролетни 2024": 8.8,
      "Есенни 2023": 16.0,
      "Олимпиада 2023": 17.7,
      "Пролетни 2023": 15.75,
      "Есенни 2022": 12.0,
      "Олимпиада 2022": 11.0,
      "Пролетни 2022": 22.5,
      "Есенни 2021": 23.0,
      "Олимпиада 2021": 18.0,
      "Пролетни 2021": 11.0,
      "2  кръг 2021": 29.0,
      "Есенни 2019": 19.5,
      "Пролетни 2019": 14.0
    },
    "competition_grades": {
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 7.0,
      "Есенни 2023": 7.0,
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 5.0,
      "Есенни 2022": 5.0,
      "Олимпиада 2022": 4.0,
      "Пролетни 2022": 4.0,
      "Есенни 2021": 4.0,
      "Олимпиада 2021": 3.0,
      "Пролетни 2021": 3.0,
      "2  кръг 2021": 3.0,
      "Есенни 2019": 2.0,
      "Пролетни 2019": 1.0
    }
  },
  {
    "name": "Антон Георгиев Бресковски",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 40.0,
      "Олимпиада 2023": 16.5,
      "Пролетни 2023": 21.75
    },
    "competition_grades": {
      "Олимпиада 2024": 5.0,
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 5.0
    }
  },
  {
    "name": "Деян Иванов Иванов",
    "grade": 13,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Олимпиада 2024": 39.5,
      "Есенни 2023": 7.0,
      "Пролетни 2023": 18.25,
      "Есенни 2022": 10.75,
      "Пролетни 2022": 13.0
    },
    "competition_grades": {
      "Олимпиада 2024": 5.0,
      "Есенни 2023": 6.0,
      "Пролетни 2023": 5.0,
      "Есенни 2022": 5.0,
      "Пролетни 2022": 4.0
    }
  },
  {
    "name": "Йоана Радославова Илчева",
    "grade": 13,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 15.5,
      "Пролетни 2024": 14.75,
      "Есенни 2023": 13.0,
      "Пролетни 2023": 12.75,
      "Есенни 2022": 16.25
    },
    "competition_grades": {
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 6.0,
      "Есенни 2023": 6.0,
      "Пролетни 2023": 5.0,
      "Есенни 2022": 5.0
    }
  },
  {
    "name": "Николай Йорданов Караиванов",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 17.0,
      "Есенни 2023": 15.0,
      "Пролетни 2023": 22.0,
      "Есенни 2022": 6.5,
      "Пролетни 2022": 18.0,
      "Олимпиада 2021": 21.0,
      "Пролетни 2021": 18.0,
      "2  кръг 2021": 27.0,
      "Есенни 2019": 23.5
    },
    "competition_grades": {
      "Олимпиада 2024": 5.0,
      "Есенни 2023": 6.0,
      "Пролетни 2023": 5.0,
      "Есенни 2022": 5.0,
      "Пролетни 2022": 4.0,
      "Олимпиада 2021": 3.0,
      "Пролетни 2021": 3.0,
      "2  кръг 2021": 3.0,
      "Есенни 2019": 2.0
    }
  },
  {
    "name": "Виктор Делянов Лилов",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 19.75,
      "Пролетни 2024": 16.5
    },
    "competition_grades": {
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 6.0
    }
  },
  {
    "name": "Явор Ивайлов Христов",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 18.5,
      "Пролетни 2024": 17.5
    },
    "competition_grades": {
      "Олимпиада 2024": 5.0,
      "Пролетни 2024": 6.0
    }
  },
  {
    "name": "Явор Калинов Неделчев",
    "grade": 13,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 41.3,
      "Пролетни 2023": 25.5,
      "Есенни 2022": 13.0,
      "Пролетни 2022": 15.0
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 5.0,
      "Есенни 2022": 5.0,
      "Пролетни 2022": 4.0
    }
  },
  {
    "name": "Биляна Димитрова Димитрова",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2022": 6.7,
      "Олимпиада 2022": 29.0,
      "Пролетни 2022": 30.0,
      "Есенни 2021": 22.0,
      "Олимпиада 2021": 29.75,
      "Пролетни 2021": 25.0,
      "2  кръг 2021": 26.5,
      "Олимпиада 2020": 27.25,
      "2 кръг 2020": 30.0,
      "Есенни 2019": 28.5,
      "Олимпиада 2019": 24.5,
      "Пролетни 2019": 23.5,
      "Есенни 2018": 24.0
    },
    "competition_grades": {
      "Есенни 2022": 7.0,
      "Олимпиада 2022": 4.0,
      "Пролетни 2022": 4.0,
      "Есенни 2021": 4.0,
      "Олимпиада 2021": 3.0,
      "Пролетни 2021": 3.0,
      "2  кръг 2021": 3.0,
      "Олимпиада 2020": 2.0,
      "2 кръг 2020": 2.0,
      "Есенни 2019": 2.0,
      "Олимпиада 2019": 1.0,
      "Пролетни 2019": 1.0,
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Емона Димитрова Илиева",
    "grade": 13,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2024": 13.25,
      "Есенни 2023": 11.0,
      "Есенни 2022": 8.3,
      "Пролетни 2021": 8.75
    },
    "competition_grades": {
      "Пролетни 2024": 6.0,
      "Есенни 2023": 6.0,
      "Есенни 2022": 5.0,
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Деян Емилов Михайлов",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2024": 13.25,
      "Есенни 2022": 8.5,
      "Пролетни 2022": 19.0,
      "Пролетни 2021": 10.25
    },
    "competition_grades": {
      "Олимпиада 2024": 5.0,
      "Есенни 2022": 5.0,
      "Пролетни 2022": 4.0,
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Александър Ивов Цветанов",
    "grade": 13,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2023": 12.0,
      "Пролетни 2023": 15.5,
      "Есенни 2022": 3.5,
      "Пролетни 2022": 21.0,
      "Пролетни 2021": 16.25,
      "Олимпиада 2019": 15.5
    },
    "competition_grades": {
      "Есенни 2023": 6.0,
      "Пролетни 2023": 5.0,
      "Есенни 2022": 5.0,
      "Пролетни 2022": 4.0,
      "Пролетни 2021": 3.0,
      "Олимпиада 2019": 1.0
    }
  },
  {
    "name": "Васил Иванов Бояновски",
    "grade": 13,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2024": 14.75,
      "Есенни 2023": 4.5,
      "Пролетни 2023": 6.5
    },
    "competition_grades": {
      "Пролетни 2024": 6.0,
      "Есенни 2023": 6.0,
      "Пролетни 2023": 5.0
    }
  },
  {
    "name": "Давид Викторов Цаков",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2023": 15.75,
      "Есенни 2022": 14.75,
      "Пролетни 2022": 18.5,
      "Пролетни 2021": 17.75,
      "Олимпиада 2020": 29.75,
      "2 кръг 2020": 30.0,
      "Есенни 2019": 24.5,
      "Пролетни 2019": 18.0,
      "Есенни 2018": 27.75
    },
    "competition_grades": {
      "Пролетни 2023": 5.0,
      "Есенни 2022": 5.0,
      "Пролетни 2022": 4.0,
      "Пролетни 2021": 3.0,
      "Олимпиада 2020": 2.0,
      "2 кръг 2020": 2.0,
      "Есенни 2019": 2.0,
      "Пролетни 2019": 1.0,
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Николай Йорданов Георгиев",
    "grade": 13,
    "school": "ПМГ \"Св. Климент Охридски\"",
    "city": "Силистра",
    "competitions": {
      "Олимпиада 2022": 26.5,
      "Есенни 2021": 24.0,
      "Олимпиада 2021": 21.0,
      "Пролетни 2021": 22.0,
      "2  кръг 2021": 27.5,
      "Олимпиада 2020": 28.5,
      "2 кръг 2020": 29.0,
      "Есенни 2019": 22.0,
      "Олимпиада 2019": 25.5
    },
    "competition_grades": {
      "Олимпиада 2022": 4.0,
      "Есенни 2021": 4.0,
      "Олимпиада 2021": 3.0,
      "Пролетни 2021": 3.0,
      "2  кръг 2021": 3.0,
      "Олимпиада 2020": 2.0,
      "2 кръг 2020": 2.0,
      "Есенни 2019": 2.0,
      "Олимпиада 2019": 1.0
    }
  },
  {
    "name": "Теодор Ивайлов Иванов",
    "grade": 13,
    "school": "ЧСУ \"Леонардо да Винчи\"",
    "city": "Добрич",
    "competitions": {
      "Олимпиада 2023": 9.5,
      "Пролетни 2023": 8.25,
      "Есенни 2022": 3.75,
      "Пролетни 2022": 25.0,
      "Олимпиада 2021": 18.5,
      "2  кръг 2021": 26.0
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 5.0,
      "Есенни 2022": 5.0,
      "Пролетни 2022": 4.0,
      "Олимпиада 2021": 3.0,
      "2  кръг 2021": 3.0
    }
  },
  {
    "name": "Деян Деянов Хаджи-Манич",
    "grade": 13,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2023": 10.0,
      "Олимпиада 2022": 21.5,
      "Есенни 2021": 20.0,
      "Олимпиада 2021": 23.0,
      "2  кръг 2021": 27.0,
      "Есенни 2019": 30.0,
      "Олимпиада 2019": 23.5,
      "Пролетни 2019": 28.5,
      "Есенни 2018": 25.0
    },
    "competition_grades": {
      "Пролетни 2023": 5.0,
      "Олимпиада 2022": 4.0,
      "Есенни 2021": 4.0,
      "Олимпиада 2021": 3.0,
      "2  кръг 2021": 3.0,
      "Есенни 2019": 2.0,
      "Олимпиада 2019": 1.0,
      "Пролетни 2019": 1.0,
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Мира Ивайлова Генчева",
    "grade": 13,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2023": 15.5,
      "Есенни 2022": 11.0,
      "Пролетни 2022": 23.5,
      "Пролетни 2021": 10.75,
      "Олимпиада 2020": 5.25,
      "2 кръг 2020": 26.0
    },
    "competition_grades": {
      "Пролетни 2023": 5.0,
      "Есенни 2022": 5.0,
      "Пролетни 2022": 4.0,
      "Пролетни 2021": 3.0,
      "Олимпиада 2020": 2.0,
      "2 кръг 2020": 2.0
    }
  },
  {
    "name": "Вяра Симеонова Симеонова",
    "grade": 13,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенни 2023": 4.5,
      "Пролетни 2023": 10.0,
      "Есенни 2022": 4.25,
      "Пролетни 2022": 14.0
    },
    "competition_grades": {
      "Есенни 2023": 6.0,
      "Пролетни 2023": 5.0,
      "Есенни 2022": 5.0,
      "Пролетни 2022": 4.0
    }
  },
  {
    "name": "Елена Константинова Цушко",
    "grade": 13,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Есенни 2023": 4.5,
      "Пролетни 2023": 10.75,
      "Есенни 2022": 3.5,
      "Пролетни 2022": 12.5
    },
    "competition_grades": {
      "Есенни 2023": 6.0,
      "Пролетни 2023": 5.0,
      "Есенни 2022": 5.0,
      "Пролетни 2022": 4.0
    }
  },
  {
    "name": "Борис Добрев Симеонов",
    "grade": 13,
    "school": "ПГКПИ",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2023": 7.5,
      "Олимпиада 2022": 8.0,
      "Пролетни 2022": 13.5,
      "Есенни 2021": 20.5,
      "Пролетни 2021": 10.75
    },
    "competition_grades": {
      "Пролетни 2023": 5.0,
      "Олимпиада 2022": 4.0,
      "Пролетни 2022": 4.0,
      "Есенни 2021": 4.0,
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Мария Атанасова Къчева",
    "grade": 13,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Олимпиада 2022": 9.0,
      "Пролетни 2022": 14.0,
      "Есенни 2021": 28.0,
      "Пролетни 2021": 8.5,
      "Олимпиада 2020": 7.5,
      "2 кръг 2020": 26.0,
      "Олимпиада 2019": 11.5
    },
    "competition_grades": {
      "Олимпиада 2022": 4.0,
      "Пролетни 2022": 4.0,
      "Есенни 2021": 4.0,
      "Пролетни 2021": 3.0,
      "Олимпиада 2020": 2.0,
      "2 кръг 2020": 2.0,
      "Олимпиада 2019": 1.0
    }
  },
  {
    "name": "Светлана Пламенова Михайлова",
    "grade": 13,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2023": 9.5,
      "Пролетни 2023": 5.75,
      "Есенни 2022": 1.5
    },
    "competition_grades": {
      "Есенни 2023": 6.0,
      "Пролетни 2023": 5.0,
      "Есенни 2022": 5.0
    }
  },
  {
    "name": "Теодора Спасова Даскалова",
    "grade": 13,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2023": 15.25,
      "Есенни 2022": 3.5,
      "Пролетни 2022": 12.0,
      "Пролетни 2021": 3.5
    },
    "competition_grades": {
      "Пролетни 2023": 5.0,
      "Есенни 2022": 5.0,
      "Пролетни 2022": 4.0,
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Александра Миленова Димова",
    "grade": 13,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Есенни 2023": 3.5,
      "Пролетни 2023": 9.0,
      "Пролетни 2022": 16.0,
      "Пролетни 2021": 8.0
    },
    "competition_grades": {
      "Есенни 2023": 6.0,
      "Пролетни 2023": 5.0,
      "Пролетни 2022": 4.0,
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Силвия Бориславова Канджичка",
    "grade": 13,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2023": 9.0,
      "Пролетни 2022": 24.0,
      "Пролетни 2021": 14.5,
      "Есенни 2019": 24.5
    },
    "competition_grades": {
      "Пролетни 2023": 5.0,
      "Пролетни 2022": 4.0,
      "Пролетни 2021": 3.0,
      "Есенни 2019": 2.0
    }
  },
  {
    "name": "Константин Пламенов Кръстев",
    "grade": 13,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 27.0,
      "Пролетни 2021": 24.25,
      "Олимпиада 2020": 17.0,
      "2 кръг 2020": 27.0,
      "Есенни 2019": 23.0,
      "Пролетни 2019": 15.5
    },
    "competition_grades": {
      "Пролетни 2022": 4.0,
      "Пролетни 2021": 3.0,
      "Олимпиада 2020": 2.0,
      "2 кръг 2020": 2.0,
      "Есенни 2019": 2.0,
      "Пролетни 2019": 1.0
    }
  },
  {
    "name": "Марина Паскалева Апостолова",
    "grade": 13,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2022": 21.0,
      "Олимпиада 2021": 7.5,
      "Пролетни 2021": 20.0,
      "2  кръг 2021": 26.0,
      "Есенни 2019": 26.5,
      "Олимпиада 2019": 19.5,
      "Пролетни 2019": 20.5,
      "Есенни 2018": 21.25
    },
    "competition_grades": {
      "Пролетни 2022": 4.0,
      "Олимпиада 2021": 3.0,
      "Пролетни 2021": 3.0,
      "2  кръг 2021": 3.0,
      "Есенни 2019": 2.0,
      "Олимпиада 2019": 1.0,
      "Пролетни 2019": 1.0,
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Десислава Пламенова Маркова",
    "grade": 13,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2023": 11.5
    },
    "competition_grades": {
      "Есенни 2023": 6.0
    }
  },
  {
    "name": "Никола Миленов Минчев",
    "grade": 13,
    "school": "ГПЧЕ \"Ромен Ролан\"",
    "city": "Стара Загора",
    "competitions": {
      "Пролетни 2024": 8.0
    },
    "competition_grades": {
      "Пролетни 2024": 6.0
    }
  },
  {
    "name": "Теодор Пламенов Тодоров",
    "grade": 13,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2023": 5.5,
      "Пролетни 2023": 8.5,
      "Есенни 2022": 0.5
    },
    "competition_grades": {
      "Есенни 2023": 6.0,
      "Пролетни 2023": 5.0,
      "Есенни 2022": 5.0
    }
  },
  {
    "name": "Даниел Любомиров Иванов",
    "grade": 13,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 21.5,
      "Пролетни 2021": 13.25,
      "Олимпиада 2020": 23.0,
      "2 кръг 2020": 26.0,
      "Есенни 2019": 23.0,
      "Олимпиада 2019": 19.0
    },
    "competition_grades": {
      "Пролетни 2022": 4.0,
      "Пролетни 2021": 3.0,
      "Олимпиада 2020": 2.0,
      "2 кръг 2020": 2.0,
      "Есенни 2019": 2.0,
      "Олимпиада 2019": 1.0
    }
  },
  {
    "name": "Борис Иванов Топалов",
    "grade": 13,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2023": 11.75,
      "Есенни 2022": 7.25
    },
    "competition_grades": {
      "Пролетни 2023": 5.0,
      "Есенни 2022": 5.0
    }
  },
  {
    "name": "Анна-Русалия Димитрова Димитрова",
    "grade": 13,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2023": 2.5,
      "Пролетни 2023": 6.75,
      "Есенни 2022": 3.75,
      "Пролетни 2022": 4.0,
      "Пролетни 2021": 8.25
    },
    "competition_grades": {
      "Есенни 2023": 6.0,
      "Пролетни 2023": 5.0,
      "Есенни 2022": 5.0,
      "Пролетни 2022": 4.0,
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Емил Георгиев Манчев",
    "grade": 13,
    "school": "ЕГ \"Пловдив\"",
    "city": "Пловдив",
    "competitions": {
      "Олимпиада 2022": 3.0,
      "Пролетни 2022": 14.5,
      "Есенни 2021": 20.0,
      "Пролетни 2021": 13.0
    },
    "competition_grades": {
      "Олимпиада 2022": 4.0,
      "Пролетни 2022": 4.0,
      "Есенни 2021": 4.0,
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Владимир Момчилов Бойчев",
    "grade": 13,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2023": 9.0
    },
    "competition_grades": {
      "Есенни 2023": 6.0
    }
  },
  {
    "name": "Милен Мартинов Вучев",
    "grade": 13,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенни 2022": 6.5,
      "Пролетни 2022": 19.5,
      "Пролетни 2021": 13.0
    },
    "competition_grades": {
      "Есенни 2022": 5.0,
      "Пролетни 2022": 4.0,
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Михаела Лъчезарова Косева",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2023": 8.5,
      "2 кръг 2020": 24.5,
      "Есенни 2019": 25.0,
      "Олимпиада 2019": 13.0
    },
    "competition_grades": {
      "Пролетни 2023": 5.0,
      "2 кръг 2020": 2.0,
      "Есенни 2019": 2.0,
      "Олимпиада 2019": 1.0
    }
  },
  {
    "name": "Нели Цветанова Цоканова",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 24.0,
      "Пролетни 2021": 10.25
    },
    "competition_grades": {
      "Пролетни 2022": 4.0,
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Явор Яворов Червенков",
    "grade": 13,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2023": 6.5
    },
    "competition_grades": {
      "Есенни 2023": 6.0
    }
  },
  {
    "name": "Виктор Невенов Чавдаров",
    "grade": 13,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2023": 8.5,
      "Есенни 2022": 2.75,
      "Есенни 2018": 26.25
    },
    "competition_grades": {
      "Пролетни 2023": 5.0,
      "Есенни 2022": 5.0,
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Божидар Венциславов Михайлов",
    "grade": 13,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 20.0,
      "Пролетни 2021": 12.0,
      "Пролетни 2019": 14.5
    },
    "competition_grades": {
      "Пролетни 2022": 4.0,
      "Пролетни 2021": 3.0,
      "Пролетни 2019": 1.0
    }
  },
  {
    "name": "Мартин Димитров Денев",
    "grade": 13,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2021": 13.5,
      "2  кръг 2021": 28.5,
      "Есенни 2019": 29.0,
      "Олимпиада 2019": 20.5,
      "Пролетни 2019": 26.0,
      "Есенни 2018": 24.5
    },
    "competition_grades": {
      "Олимпиада 2021": 3.0,
      "2  кръг 2021": 3.0,
      "Есенни 2019": 2.0,
      "Олимпиада 2019": 1.0,
      "Пролетни 2019": 1.0,
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Цветислава Петьова Димитрова",
    "grade": 13,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетни 2023": 10.0,
      "Пролетни 2019": 17.5
    },
    "competition_grades": {
      "Пролетни 2023": 5.0,
      "Пролетни 2019": 1.0
    }
  },
  {
    "name": "Деница Милетиева Василева",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 11.5,
      "Олимпиада 2020": 25.5,
      "2 кръг 2020": 27.0,
      "Есенни 2019": 26.0,
      "Олимпиада 2019": 22.0,
      "Пролетни 2019": 21.0,
      "Есенни 2018": 28.0
    },
    "competition_grades": {
      "Пролетни 2021": 3.0,
      "Олимпиада 2020": 2.0,
      "2 кръг 2020": 2.0,
      "Есенни 2019": 2.0,
      "Олимпиада 2019": 1.0,
      "Пролетни 2019": 1.0,
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Филип Николаев Димитров",
    "grade": 13,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2023": 10.0
    },
    "competition_grades": {
      "Пролетни 2023": 5.0
    }
  },
  {
    "name": "Елена Бойкова Димитрова",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 10.0,
      "2  кръг 2021": 26.0,
      "Олимпиада 2020": 19.25,
      "2 кръг 2020": 27.0
    },
    "competition_grades": {
      "Олимпиада 2021": 3.0,
      "2  кръг 2021": 3.0,
      "Олимпиада 2020": 2.0,
      "2 кръг 2020": 2.0
    }
  },
  {
    "name": "Християн Христов Кимрянов",
    "grade": 13,
    "school": "ПГКПИ",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2023": 3.5,
      "Пролетни 2022": 12.5,
      "Пролетни 2021": 5.5
    },
    "competition_grades": {
      "Пролетни 2023": 5.0,
      "Пролетни 2022": 4.0,
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Мирослав Светославов Попов",
    "grade": 13,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2023": 9.75
    },
    "competition_grades": {
      "Пролетни 2023": 5.0
    }
  },
  {
    "name": "Мартин Димитров Щилянов",
    "grade": 13,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Олимпиада 2022": 3.0,
      "Есенни 2021": 20.0,
      "Пролетни 2021": 7.0
    },
    "competition_grades": {
      "Олимпиада 2022": 4.0,
      "Есенни 2021": 4.0,
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Теодора Нейчева Тодорова",
    "grade": 13,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2022": 8.5,
      "Пролетни 2021": 18.25,
      "Есенни 2019": 14.5,
      "Олимпиада 2019": 23.5,
      "Пролетни 2019": 15.0
    },
    "competition_grades": {
      "Пролетни 2022": 4.0,
      "Пролетни 2021": 3.0,
      "Есенни 2019": 2.0,
      "Олимпиада 2019": 1.0,
      "Пролетни 2019": 1.0
    }
  },
  {
    "name": "Тони Огнянов Белитов",
    "grade": 13,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2022": 9.0,
      "Пролетни 2021": 9.25,
      "Олимпиада 2020": 4.0,
      "2 кръг 2020": 27.0,
      "Есенни 2019": 20.0
    },
    "competition_grades": {
      "Пролетни 2022": 4.0,
      "Пролетни 2021": 3.0,
      "Олимпиада 2020": 2.0,
      "2 кръг 2020": 2.0,
      "Есенни 2019": 2.0
    }
  },
  {
    "name": "Васил Емилов Родов",
    "grade": 13,
    "school": "МГ\"Акад.Кирил Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2023": 5.0
    },
    "competition_grades": {
      "Есенни 2023": 6.0
    }
  },
  {
    "name": "Димо Пламенов Петров",
    "grade": 13,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Пролетни 2022": 14.0,
      "Пролетни 2021": 16.25
    },
    "competition_grades": {
      "Пролетни 2022": 4.0,
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Наум Василев Герогиев",
    "grade": 13,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 20.5
    },
    "competition_grades": {
      "Пролетни 2022": 4.0
    }
  },
  {
    "name": "Константин Константинов Томов",
    "grade": 13,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Олимпиада 2021": 18.5,
      "2  кръг 2021": 26.0,
      "Пролетни 2019": 21.5
    },
    "competition_grades": {
      "Олимпиада 2021": 3.0,
      "2  кръг 2021": 3.0,
      "Пролетни 2019": 1.0
    }
  },
  {
    "name": "Константин Владимиров Дичев",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2022": 10.75
    },
    "competition_grades": {
      "Есенни 2022": 5.0
    }
  },
  {
    "name": "Петър Христов Желев",
    "grade": 13,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2023": 8.0
    },
    "competition_grades": {
      "Пролетни 2023": 5.0
    }
  },
  {
    "name": "Недко Миленов Нанков",
    "grade": 13,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Олимпиада 2020": 25.75,
      "2 кръг 2020": 25.15,
      "Есенни 2019": 23.0,
      "Олимпиада 2019": 16.5,
      "Пролетни 2019": 21.0,
      "Есенни 2018": 23.0
    },
    "competition_grades": {
      "Олимпиада 2020": 2.0,
      "2 кръг 2020": 2.0,
      "Есенни 2019": 2.0,
      "Олимпиада 2019": 1.0,
      "Пролетни 2019": 1.0,
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Васил Катев Иванов",
    "grade": 13,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2023": 3.0,
      "Пролетни 2023": 1.75
    },
    "competition_grades": {
      "Есенни 2023": 6.0,
      "Пролетни 2023": 5.0
    }
  },
  {
    "name": "Виктория Ивайлова Тодорова",
    "grade": 13,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетни 2023": 5.0,
      "Есенни 2022": 1.25,
      "Пролетни 2021": 4.5
    },
    "competition_grades": {
      "Пролетни 2023": 5.0,
      "Есенни 2022": 5.0,
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Десислава Тонева Илиева",
    "grade": 13,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2023": 2.0,
      "Пролетни 2023": 2.25,
      "Есенни 2022": 0.5,
      "Пролетни 2022": 1.0
    },
    "competition_grades": {
      "Есенни 2023": 6.0,
      "Пролетни 2023": 5.0,
      "Есенни 2022": 5.0,
      "Пролетни 2022": 4.0
    }
  },
  {
    "name": "Иван Любомиров Балабанов",
    "grade": 13,
    "school": "ЕГ \"Пловдив\"",
    "city": "Пловдив",
    "competitions": {
      "Олимпиада 2021": 9.5,
      "2  кръг 2021": 27.0
    },
    "competition_grades": {
      "Олимпиада 2021": 3.0,
      "2  кръг 2021": 3.0
    }
  },
  {
    "name": "Александър Ангелов Петров",
    "grade": 13,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 12.75,
      "2 кръг 2020": 24.75,
      "Есенни 2019": 27.0,
      "Пролетни 2019": 24.0
    },
    "competition_grades": {
      "Олимпиада 2020": 2.0,
      "2 кръг 2020": 2.0,
      "Есенни 2019": 2.0,
      "Пролетни 2019": 1.0
    }
  },
  {
    "name": "Кристиян Пламенов Василев",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 12.5
    },
    "competition_grades": {
      "Пролетни 2022": 4.0
    }
  },
  {
    "name": "Дара Данкова Георгиева",
    "grade": 13,
    "school": "ЕГ \"Пловдив\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2022": 10.0
    },
    "competition_grades": {
      "Пролетни 2022": 4.0
    }
  },
  {
    "name": "Мира Аспарухова Марковска",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 10.0
    },
    "competition_grades": {
      "Пролетни 2022": 4.0
    }
  },
  {
    "name": "Даниела Иванова Кременска",
    "grade": 13,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетни 2022": 5.5,
      "Пролетни 2021": 9.5
    },
    "competition_grades": {
      "Пролетни 2022": 4.0,
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Антония Христова Николова",
    "grade": 13,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Пролетни 2022": 9.5
    },
    "competition_grades": {
      "Пролетни 2022": 4.0
    }
  },
  {
    "name": "Александра Димитрова Игнатова",
    "grade": 13,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 9.0
    },
    "competition_grades": {
      "Пролетни 2022": 4.0
    }
  },
  {
    "name": "Александра Спасова Даскалова",
    "grade": 13,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 9.0
    },
    "competition_grades": {
      "Пролетни 2022": 4.0
    }
  },
  {
    "name": "Мария Пенкова Пенкова",
    "grade": 13,
    "school": "ППМГ",
    "city": "Ловеч",
    "competitions": {
      "Есенни 2022": 5.0
    },
    "competition_grades": {
      "Есенни 2022": 5.0
    }
  },
  {
    "name": "Николай Тихомиров Дидилецов",
    "grade": 13,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 6.5,
      "Пролетни 2021": 5.25
    },
    "competition_grades": {
      "Пролетни 2022": 4.0,
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Мирена Станимирова Колева",
    "grade": 13,
    "school": "ПМГ \"Ат. Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Пролетни 2021": 13.5,
      "Есенни 2019": 14.5
    },
    "competition_grades": {
      "Пролетни 2021": 3.0,
      "Есенни 2019": 2.0
    }
  },
  {
    "name": "Атина Евгениева Генчева",
    "grade": 13,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 28.0,
      "Олимпиада 2019": 22.0,
      "Есенни 2018": 27.0
    },
    "competition_grades": {
      "Есенни 2019": 2.0,
      "Олимпиада 2019": 1.0,
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Мартин Миленов Тотев",
    "grade": 13,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2019": 27.5,
      "Пролетни 2019": 30.0,
      "Есенни 2018": 22.25
    },
    "competition_grades": {
      "Есенни 2019": 2.0,
      "Пролетни 2019": 1.0,
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Борис Велков Гергинов",
    "grade": 13,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2019": 27.0,
      "Пролетни 2019": 22.0,
      "Есенни 2018": 27.0
    },
    "competition_grades": {
      "Есенни 2019": 2.0,
      "Пролетни 2019": 1.0,
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Мария Николаева Дренчева",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 21.0,
      "Олимпиада 2019": 19.5,
      "Есенни 2018": 27.5
    },
    "competition_grades": {
      "Есенни 2019": 2.0,
      "Олимпиада 2019": 1.0,
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Димитър Митков Самоковски",
    "grade": 13,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 6.0
    },
    "competition_grades": {
      "Пролетни 2022": 4.0
    }
  },
  {
    "name": "Силвиа Красимирова Делийска",
    "grade": 13,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 6.0
    },
    "competition_grades": {
      "Пролетни 2022": 4.0
    }
  },
  {
    "name": "Росица Альошева Манева",
    "grade": 13,
    "school": "СУ \"Иван Вазов\"",
    "city": "Вършец",
    "competitions": {
      "Пролетни 2021": 14.0
    },
    "competition_grades": {
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Мария Добромирова Дойчева",
    "grade": 13,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2022": 2.5,
      "Пролетни 2021": 3.25
    },
    "competition_grades": {
      "Есенни 2022": 5.0,
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Георги Александров Бучков",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 12.75
    },
    "competition_grades": {
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Георги Василев Стоянов",
    "grade": 13,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетни 2022": 3.5,
      "Пролетни 2021": 4.0
    },
    "competition_grades": {
      "Пролетни 2022": 4.0,
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Яна Атанасова Чапкънова",
    "grade": 13,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2021": 12.0
    },
    "competition_grades": {
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Марио Ставрос Хазистрадис",
    "grade": 13,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2022": 5.0
    },
    "competition_grades": {
      "Пролетни 2022": 4.0
    }
  },
  {
    "name": "Елинор Николаева Николова",
    "grade": 13,
    "school": "ЧПГ \"АК-Аркус\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2021": 11.75
    },
    "competition_grades": {
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Петър Георгиев Илиев",
    "grade": 13,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2021": 11.0
    },
    "competition_grades": {
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Николай Христов Колев",
    "grade": 13,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2022": 2.5
    },
    "competition_grades": {
      "Есенни 2022": 5.0
    }
  },
  {
    "name": "Йоана Светославова Стойнова",
    "grade": 13,
    "school": "НТБГ",
    "city": "София",
    "competitions": {
      "Есенни 2022": 2.25
    },
    "competition_grades": {
      "Есенни 2022": 5.0
    }
  },
  {
    "name": "Стефан Красимиров Радойчев",
    "grade": 13,
    "school": "ЧПГ \"АК-Аркус\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2021": 9.25
    },
    "competition_grades": {
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Деница Иванова Чорева",
    "grade": 13,
    "school": "ЕГ \"Акад. Людмил Стоянов\"",
    "city": "Благоевград",
    "competitions": {
      "Пролетни 2022": 3.5
    },
    "competition_grades": {
      "Пролетни 2022": 4.0
    }
  },
  {
    "name": "Камелия Ивайлова Драганова",
    "grade": 13,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетни 2022": 3.5
    },
    "competition_grades": {
      "Пролетни 2022": 4.0
    }
  },
  {
    "name": "Мария Даниелова Димитрова",
    "grade": 13,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2021": 8.0
    },
    "competition_grades": {
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Михаела Василева Николова",
    "grade": 13,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2021": 8.0
    },
    "competition_grades": {
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Даниел Янков Станчев",
    "grade": 13,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2019": 25.5,
      "Есенни 2018": 25.75
    },
    "competition_grades": {
      "Пролетни 2019": 1.0,
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Мира Емилова Тодорова",
    "grade": 13,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2021": 7.75
    },
    "competition_grades": {
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Денис Емилов Хубенов",
    "grade": 13,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Пролетни 2022": 3.0
    },
    "competition_grades": {
      "Пролетни 2022": 4.0
    }
  },
  {
    "name": "Милица Ангелинова Лазарова",
    "grade": 13,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Пролетни 2022": 3.0
    },
    "competition_grades": {
      "Пролетни 2022": 4.0
    }
  },
  {
    "name": "Симеон Димитров Славов",
    "grade": 13,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2022": 3.0
    },
    "competition_grades": {
      "Пролетни 2022": 4.0
    }
  },
  {
    "name": "Димо Стоянов Димов",
    "grade": 13,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2021": 6.25
    },
    "competition_grades": {
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Георги Николаев Димитров",
    "grade": 13,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2019": 15.5,
      "Есенни 2018": 25.0
    },
    "competition_grades": {
      "Пролетни 2019": 1.0,
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Антония Иванова Мазникова",
    "grade": 13,
    "school": "ЕГ \"Пловдив\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2021": 6.0
    },
    "competition_grades": {
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Никола Мартинов Христов",
    "grade": 13,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2021": 5.5
    },
    "competition_grades": {
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Ясен Пламенов Пенчев",
    "grade": 13,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Олимпиада 2019": 21.5
    },
    "competition_grades": {
      "Олимпиада 2019": 1.0
    }
  },
  {
    "name": "Василена Василева Пенчева",
    "grade": 13,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2019": 6.5,
      "Пролетни 2019": 17.5
    },
    "competition_grades": {
      "Олимпиада 2019": 1.0,
      "Пролетни 2019": 1.0
    }
  },
  {
    "name": "Кристиан Венцеславов Христакиев",
    "grade": 13,
    "school": "ППМГ \"Гео Милев\"",
    "city": "Стара Загора",
    "competitions": {
      "Есенни 2019": 10.0,
      "Олимпиада 2019": 5.0
    },
    "competition_grades": {
      "Есенни 2019": 2.0,
      "Олимпиада 2019": 1.0
    }
  },
  {
    "name": "Рослан Стоев Стоев",
    "grade": 13,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетни 2021": 4.25
    },
    "competition_grades": {
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Димитър Стефанов Панайотов",
    "grade": 13,
    "school": "АЕГ \"Гео Милев\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2021": 3.75
    },
    "competition_grades": {
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Мартина Пенчова Босева",
    "grade": 13,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2019": 20.0
    },
    "competition_grades": {
      "Пролетни 2019": 1.0
    }
  },
  {
    "name": "Виктория Алексиева Чиликова",
    "grade": 13,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Пролетни 2022": 1.5
    },
    "competition_grades": {
      "Пролетни 2022": 4.0
    }
  },
  {
    "name": "Деница Тодорова Христова",
    "grade": 13,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2021": 3.5
    },
    "competition_grades": {
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Красимира Бориславова Дочева",
    "grade": 13,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2021": 3.5
    },
    "competition_grades": {
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Николай Антонов Благов",
    "grade": 13,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2018": 26.0
    },
    "competition_grades": {
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Елена Даниелова Барутева",
    "grade": 13,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2019": 18.5
    },
    "competition_grades": {
      "Пролетни 2019": 1.0
    }
  },
  {
    "name": "Елеонор Светлозарова Спасова",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2018": 23.0
    },
    "competition_grades": {
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Георги Стоянов Пашалиев",
    "grade": 13,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетни 2019": 16.0
    },
    "competition_grades": {
      "Пролетни 2019": 1.0
    }
  },
  {
    "name": "Георги Мирославов Михайлов",
    "grade": 13,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2021": 2.5
    },
    "competition_grades": {
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Даниел Димитров Игнатов",
    "grade": 13,
    "school": "ПГ \"Васил Левски\"",
    "city": "Ямбол",
    "competitions": {
      "Пролетни 2021": 2.5
    },
    "competition_grades": {
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Владислав Бориславов Тулилов",
    "grade": 13,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетни 2019": 14.0
    },
    "competition_grades": {
      "Пролетни 2019": 1.0
    }
  },
  {
    "name": "Катерина Иванова Тодорова",
    "grade": 13,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2019": 14.0
    },
    "competition_grades": {
      "Пролетни 2019": 1.0
    }
  },
  {
    "name": "Надя Паскалева Паскова",
    "grade": 13,
    "school": "ППМГ \"Екзарх Антим I\"",
    "city": "Видин",
    "competitions": {
      "Олимпиада 2019": 10.5
    },
    "competition_grades": {
      "Олимпиада 2019": 1.0
    }
  },
  {
    "name": "Мелис Сали Мустафа",
    "grade": 13,
    "school": "СУ \"Любен Каравелов\"",
    "city": "Добрич",
    "competitions": {
      "Пролетни 2022": 1.0
    },
    "competition_grades": {
      "Пролетни 2022": 4.0
    }
  },
  {
    "name": "Георги Йорданов Йорданов",
    "grade": 13,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2018": 16.5
    },
    "competition_grades": {
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Борис Игоров Жолтовски",
    "grade": 13,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2018": 14.25
    },
    "competition_grades": {
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Ева Ангелова Владимирова",
    "grade": 13,
    "school": "ЧСУ с РЧЕО \"ЕСПА\"",
    "city": "София",
    "competitions": {
      "Олимпиада 2019": 8.0
    },
    "competition_grades": {
      "Олимпиада 2019": 1.0
    }
  },
  {
    "name": "Христо Светославов Бургазлиев",
    "grade": 13,
    "school": "35 СЕУ \"Добри Войников\"",
    "city": "София",
    "competitions": {
      "Есенни 2018": 11.5
    },
    "competition_grades": {
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Свилен Галинов Бъчваров",
    "grade": 13,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетни 2021": 1.5
    },
    "competition_grades": {
      "Пролетни 2021": 3.0
    }
  },
  {
    "name": "Теодора Руменова Боденова",
    "grade": 13,
    "school": "ОУ \" Св.св. Кирил и Методий\"",
    "city": "с. Места",
    "competitions": {
      "Есенни 2018": 11.0
    },
    "competition_grades": {
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Дарина Кирилова Джакова",
    "grade": 13,
    "school": "4 ОУ \"Св. Св. Козма и Дамян\"",
    "city": "Сандански",
    "competitions": {
      "Есенни 2018": 9.25
    },
    "competition_grades": {
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Силвана Фаим Молла",
    "grade": 13,
    "school": "ОУ \" Св.св. Кирил и Методий\"",
    "city": "с. Места",
    "competitions": {
      "Есенни 2018": 8.5
    },
    "competition_grades": {
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Александра Христова Христова",
    "grade": 13,
    "school": "ОУ \"Св Иван Рилски\"",
    "city": "Перник",
    "competitions": {
      "Олимпиада 2019": 4.0
    },
    "competition_grades": {
      "Олимпиада 2019": 1.0
    }
  },
  {
    "name": "Сефтяна Шефкет Туталъ",
    "grade": 13,
    "school": "ОУ \" Св.св. Кирил и Методий\"",
    "city": "с. Места",
    "competitions": {
      "Есенни 2018": 6.0
    },
    "competition_grades": {
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Виктор Живков Стефчев",
    "grade": 13,
    "school": "56 СУ \"проф. Константин Иречек\"",
    "city": "София",
    "competitions": {
      "Олимпиада 2019": 3.0
    },
    "competition_grades": {
      "Олимпиада 2019": 1.0
    }
  },
  {
    "name": "Виктория Пламенова Русева",
    "grade": 13,
    "school": "СУ\"Емилиян Станев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 2.0
    },
    "competition_grades": {
      "Есенни 2019": 2.0
    }
  },
  {
    "name": "Малина Петрова Въкъвчиева",
    "grade": 13,
    "school": "4 ОУ \"Св. Св. Козма и Дамян\"",
    "city": "Сандански",
    "competitions": {
      "Есенни 2018": 3.0
    },
    "competition_grades": {
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Радостина Спасова Лейкова",
    "grade": 13,
    "school": "ОУ \" Св.св. Кирил и Методий\"",
    "city": "с. Места",
    "competitions": {
      "Есенни 2018": 3.0
    },
    "competition_grades": {
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Лилияна Георгиева Арнаудова",
    "grade": 13,
    "school": "ОУ \" Св.св. Кирил и Методий\"",
    "city": "с. Места",
    "competitions": {
      "Есенни 2018": 2.5
    },
    "competition_grades": {
      "Есенни 2018": 1.0
    }
  },
  {
    "name": "Явор Александров Дурев",
    "grade": 13,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2022": 0.0
    },
    "competition_grades": {
      "Есенни 2022": 5.0
    }
  },
  {
    "name": "Маргулан Ерланович Исмолдаев",
    "grade": 14,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Олимпиада 2023": 89.0,
      "Пролетни 2023": 29.2,
      "Есенни 2022": 18.0,
      "Олимпиада 2022": 80.75,
      "Пролетни 2022": 22.0,
      "Есенни 2021": 30.0,
      "Олимпиада 2021": 76.1,
      "Пролетни 2021": 18.5,
      "2  кръг 2021": 22.5,
      "Олимпиада 2020": 29.0,
      "2 кръг 2020": 30.0,
      "Есенни 2019": 30.0,
      "Олимпиада 2019": 25.5,
      "Пролетни 2019": 23.9,
      "Есенни 2018": 17.0,
      "Олимпиада 2018": 28.0,
      "Пролетни 2018": 25.0,
      "Есенни 2017": 20.0
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 7.0,
      "Есенни 2022": 7.0,
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 7.0,
      "Есенни 2021": 5.0,
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 7.0,
      "2  кръг 2021": 5.0,
      "Олимпиада 2020": 3.0,
      "2 кръг 2020": 3.0,
      "Есенни 2019": 3.0,
      "Олимпиада 2019": 2.0,
      "Пролетни 2019": 2.0,
      "Есенни 2018": 2.0,
      "Олимпиада 2018": 1.0,
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Йово Георгиев Йовчев",
    "grade": 14,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 82.25,
      "Пролетни 2023": 25.6,
      "Есенни 2022": 12.65,
      "Олимпиада 2022": 48.25,
      "Пролетни 2022": 25.0,
      "Есенни 2021": 27.5,
      "Пролетни 2021": 16.0,
      "Есенни 2019": 26.0,
      "Олимпиада 2019": 22.5,
      "Пролетни 2019": 18.6,
      "Олимпиада 2018": 17.0
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 7.0,
      "Есенни 2022": 7.0,
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 5.0,
      "Есенни 2021": 5.0,
      "Пролетни 2021": 4.0,
      "Есенни 2019": 3.0,
      "Олимпиада 2019": 2.0,
      "Пролетни 2019": 2.0,
      "Олимпиада 2018": 1.0
    }
  },
  {
    "name": "Виктор Бориславов Михайлов",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 64.5,
      "Пролетни 2023": 19.7,
      "Есенни 2022": 8.2,
      "Олимпиада 2022": 73.0,
      "Пролетни 2022": 9.0,
      "Есенни 2021": 30.0,
      "Пролетни 2021": 11.7,
      "Есенни 2019": 18.0,
      "Олимпиада 2018": 20.5
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 7.0,
      "Есенни 2022": 7.0,
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 7.0,
      "Есенни 2021": 5.0,
      "Пролетни 2021": 7.0,
      "Есенни 2019": 3.0,
      "Олимпиада 2018": 1.0
    }
  },
  {
    "name": "Владимир Руменов Миланов",
    "grade": 14,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 62.25,
      "Пролетни 2023": 18.4,
      "Есенни 2022": 23.5,
      "Олимпиада 2022": 54.0,
      "Пролетни 2022": 6.4,
      "Есенни 2021": 27.5,
      "Пролетни 2021": 6.7
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 7.0,
      "Есенни 2022": 7.0,
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 7.0,
      "Есенни 2021": 5.0,
      "Пролетни 2021": 7.0
    }
  },
  {
    "name": "Златомир Живков Желев",
    "grade": 14,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Олимпиада 2023": 60.45,
      "Пролетни 2023": 16.4,
      "Есенни 2022": 8.95,
      "Олимпиада 2022": 57.5,
      "Пролетни 2022": 12.5,
      "Есенни 2021": 30.0,
      "Пролетни 2021": 16.0,
      "Олимпиада 2020": 15.5,
      "2 кръг 2020": 24.0,
      "Есенни 2019": 18.0
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 7.0,
      "Есенни 2022": 7.0,
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 7.0,
      "Есенни 2021": 5.0,
      "Пролетни 2021": 4.0,
      "Олимпиада 2020": 3.0,
      "2 кръг 2020": 3.0,
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Михаил Огнянов Банков",
    "grade": 14,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Олимпиада 2023": 44.5,
      "Пролетни 2023": 13.1,
      "Есенни 2022": 30.0,
      "Олимпиада 2022": 17.0,
      "Пролетни 2022": 18.0,
      "Есенни 2021": 25.0,
      "Олимпиада 2021": 7.0,
      "2  кръг 2021": 25.0,
      "Есенни 2019": 27.0,
      "Олимпиада 2018": 15.5,
      "Пролетни 2018": 19.0
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 7.0,
      "Есенни 2022": 6.0,
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 5.0,
      "Есенни 2021": 5.0,
      "Олимпиада 2021": 4.0,
      "2  кръг 2021": 4.0,
      "Есенни 2019": 3.0,
      "Олимпиада 2018": 1.0,
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Стивън Василев Василев",
    "grade": 14,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Олимпиада 2023": 47.56,
      "Пролетни 2023": 13.5,
      "Олимпиада 2022": 20.5,
      "Пролетни 2022": 25.5,
      "Есенни 2021": 30.0,
      "Олимпиада 2021": 14.0,
      "Пролетни 2021": 12.5,
      "2  кръг 2021": 24.0,
      "Есенни 2017": 9.5
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 6.0,
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 5.0,
      "Есенни 2021": 5.0,
      "Олимпиада 2021": 4.0,
      "Пролетни 2021": 4.0,
      "2  кръг 2021": 4.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Константин Косев Кръстев",
    "grade": 14,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2023": 52.6,
      "Пролетни 2023": 11.5,
      "Есенни 2022": 5.2,
      "Олимпиада 2022": 23.5,
      "Пролетни 2022": 1.9,
      "Есенни 2021": 30.0,
      "Пролетни 2021": 3.0
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 7.0,
      "Есенни 2022": 7.0,
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 7.0,
      "Есенни 2021": 5.0,
      "Пролетни 2021": 7.0
    }
  },
  {
    "name": "Павел Иванов Писанов",
    "grade": 14,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 47.8,
      "Пролетни 2023": 12.5,
      "Есенни 2022": 2.7,
      "Пролетни 2022": 29.0,
      "Олимпиада 2021": 15.5,
      "Пролетни 2021": 17.5,
      "2  кръг 2021": 29.0,
      "Есенни 2019": 11.5
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 7.0,
      "Есенни 2022": 7.0,
      "Пролетни 2022": 5.0,
      "Олимпиада 2021": 4.0,
      "Пролетни 2021": 4.0,
      "2  кръг 2021": 4.0,
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Илия Светлинов Петров",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 19.5,
      "Пролетни 2023": 18.0,
      "Есенни 2022": 8.7,
      "Олимпиада 2022": 38.0,
      "Пролетни 2022": 12.0,
      "Есенни 2021": 25.5,
      "Олимпиада 2021": 10.5,
      "2  кръг 2021": 27.0,
      "Олимпиада 2020": 19.75,
      "2 кръг 2020": 24.0
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 7.0,
      "Есенни 2022": 7.0,
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 5.0,
      "Есенни 2021": 5.0,
      "Олимпиада 2021": 4.0,
      "2  кръг 2021": 4.0,
      "Олимпиада 2020": 3.0,
      "2 кръг 2020": 3.0
    }
  },
  {
    "name": "Миран Вахан Мъхерян",
    "grade": 14,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Олимпиада 2023": 17.5,
      "Пролетни 2023": 14.0,
      "Есенни 2022": 21.9,
      "Олимпиада 2022": 24.0,
      "Пролетни 2022": 7.0,
      "Есенни 2021": 25.0,
      "Олимпиада 2021": 5.5,
      "2  кръг 2021": 23.0,
      "Есенни 2019": 14.7,
      "Олимпиада 2019": 9.5,
      "Пролетни 2019": 10.2
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 6.0,
      "Есенни 2022": 6.0,
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 5.0,
      "Есенни 2021": 5.0,
      "Олимпиада 2021": 4.0,
      "2  кръг 2021": 4.0,
      "Есенни 2019": 3.0,
      "Олимпиада 2019": 2.0,
      "Пролетни 2019": 2.0
    }
  },
  {
    "name": "Иван Стоянов Иванов",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 20.7,
      "Пролетни 2023": 11.5,
      "Есенни 2022": 5.45,
      "Олимпиада 2022": 25.0,
      "Пролетни 2022": 21.0,
      "Есенни 2021": 27.5,
      "Пролетни 2021": 16.0,
      "Пролетни 2018": 17.5
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 6.0,
      "Есенни 2022": 7.0,
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 5.0,
      "Есенни 2021": 5.0,
      "Пролетни 2021": 4.0,
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Виктор Светославов Величков",
    "grade": 14,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 15.0,
      "Пролетни 2023": 11.25,
      "Есенни 2022": 27.8,
      "Пролетни 2022": 26.0,
      "Олимпиада 2021": 14.5,
      "Пролетни 2021": 12.0,
      "2  кръг 2021": 22.5,
      "Есенни 2019": 17.5
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 6.0,
      "Есенни 2022": 6.0,
      "Пролетни 2022": 5.0,
      "Олимпиада 2021": 4.0,
      "Пролетни 2021": 4.0,
      "2  кръг 2021": 4.0,
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Таня Цветославова Петкова",
    "grade": 14,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Олимпиада 2023": 15.5,
      "Пролетни 2023": 15.5,
      "Олимпиада 2022": 15.5,
      "Пролетни 2022": 17.0,
      "Есенни 2021": 28.5,
      "Олимпиада 2021": 11.75,
      "2  кръг 2021": 28.5,
      "Олимпиада 2020": 18.5,
      "2 кръг 2020": 28.5,
      "Олимпиада 2018": 16.0,
      "Пролетни 2018": 17.5
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 6.0,
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 5.0,
      "Есенни 2021": 5.0,
      "Олимпиада 2021": 4.0,
      "2  кръг 2021": 4.0,
      "Олимпиада 2020": 3.0,
      "2 кръг 2020": 3.0,
      "Олимпиада 2018": 1.0,
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Иван Тодоров Тагарев",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2022": 3.2,
      "Олимпиада 2022": 56.75,
      "Пролетни 2022": 22.0,
      "Есенни 2021": 30.0,
      "Олимпиада 2021": 19.25,
      "2  кръг 2021": 26.0,
      "Олимпиада 2020": 27.0,
      "2 кръг 2020": 28.5,
      "Есенни 2019": 22.5,
      "Олимпиада 2019": 18.0,
      "Олимпиада 2018": 26.6
    },
    "competition_grades": {
      "Есенни 2022": 7.0,
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 5.0,
      "Есенни 2021": 5.0,
      "Олимпиада 2021": 4.0,
      "2  кръг 2021": 4.0,
      "Олимпиада 2020": 3.0,
      "2 кръг 2020": 3.0,
      "Есенни 2019": 3.0,
      "Олимпиада 2019": 2.0,
      "Олимпиада 2018": 1.0
    }
  },
  {
    "name": "Мартин Любомиров Лозанов",
    "grade": 14,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 17.0,
      "Пролетни 2023": 8.5,
      "Олимпиада 2022": 15.0,
      "Пролетни 2022": 16.0,
      "Есенни 2021": 25.0,
      "Олимпиада 2021": 11.75,
      "Пролетни 2021": 19.0,
      "2  кръг 2021": 25.0,
      "Есенни 2019": 17.5,
      "Олимпиада 2018": 25.2
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 6.0,
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 5.0,
      "Есенни 2021": 5.0,
      "Олимпиада 2021": 4.0,
      "Пролетни 2021": 4.0,
      "2  кръг 2021": 4.0,
      "Есенни 2019": 3.0,
      "Олимпиада 2018": 1.0
    }
  },
  {
    "name": "Боян Николаев Райков",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 18.0,
      "Олимпиада 2022": 22.0,
      "Пролетни 2022": 2.0,
      "Есенни 2021": 30.0,
      "Олимпиада 2021": 9.0,
      "Пролетни 2021": 18.5,
      "2  кръг 2021": 28.5,
      "Олимпиада 2020": 13.0,
      "2 кръг 2020": 30.0,
      "Есенни 2019": 20.0
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 7.0,
      "Есенни 2021": 5.0,
      "Олимпиада 2021": 4.0,
      "Пролетни 2021": 4.0,
      "2  кръг 2021": 4.0,
      "Олимпиада 2020": 3.0,
      "2 кръг 2020": 3.0,
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Дарин Маринов Костов",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 20.0,
      "Олимпиада 2022": 22.0,
      "Есенни 2021": 30.0,
      "Пролетни 2021": 2.5,
      "2 кръг 2020": 24.0
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Олимпиада 2022": 5.0,
      "Есенни 2021": 5.0,
      "Пролетни 2021": 4.0,
      "2 кръг 2020": 3.0
    }
  },
  {
    "name": "Момчил Николаев Танчев",
    "grade": 14,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетни 2023": 10.75,
      "Есенни 2022": 11.7,
      "Олимпиада 2022": 6.0,
      "Пролетни 2022": 5.0,
      "Есенни 2021": 28.5,
      "Олимпиада 2021": 11.0,
      "Пролетни 2021": 10.5,
      "2  кръг 2021": 24.5,
      "Олимпиада 2020": 15.5,
      "2 кръг 2020": 30.0,
      "Есенни 2019": 24.5,
      "Олимпиада 2019": 12.2,
      "Пролетни 2019": 14.4,
      "Олимпиада 2018": 15.7,
      "Пролетни 2018": 18.5,
      "Есенни 2017": 7.5
    },
    "competition_grades": {
      "Пролетни 2023": 6.0,
      "Есенни 2022": 6.0,
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 5.0,
      "Есенни 2021": 5.0,
      "Олимпиада 2021": 4.0,
      "Пролетни 2021": 4.0,
      "2  кръг 2021": 4.0,
      "Олимпиада 2020": 3.0,
      "2 кръг 2020": 3.0,
      "Есенни 2019": 3.0,
      "Олимпиада 2019": 2.0,
      "Пролетни 2019": 2.0,
      "Олимпиада 2018": 1.0,
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Антонио Недков Задгорски",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2022": 20.0,
      "Олимпиада 2022": 22.0,
      "Пролетни 2022": 30.0,
      "Есенни 2021": 26.0
    },
    "competition_grades": {
      "Есенни 2022": 6.0,
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 5.0,
      "Есенни 2021": 5.0
    }
  },
  {
    "name": "Ивайло Йорданов Камбуров",
    "grade": 14,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 11.5,
      "Пролетни 2023": 9.25,
      "Есенни 2022": 23.25,
      "Пролетни 2022": 11.0
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 6.0,
      "Есенни 2022": 6.0,
      "Пролетни 2022": 5.0
    }
  },
  {
    "name": "Симеон Бисеров Дойчинов",
    "grade": 14,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 20.5,
      "Есенни 2022": 4.2,
      "Пролетни 2022": 20.0,
      "Пролетни 2021": 15.0,
      "Олимпиада 2019": 6.5
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Есенни 2022": 7.0,
      "Пролетни 2022": 5.0,
      "Пролетни 2021": 4.0,
      "Олимпиада 2019": 2.0
    }
  },
  {
    "name": "Крум Найденов Александров",
    "grade": 14,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2023": 5.5,
      "Есенни 2022": 17.4,
      "Пролетни 2022": 16.0,
      "Олимпиада 2021": 9.5,
      "Пролетни 2021": 20.5,
      "2  кръг 2021": 28.25,
      "Олимпиада 2020": 21.0,
      "2 кръг 2020": 24.0,
      "Есенни 2019": 28.0,
      "Олимпиада 2018": 19.0,
      "Пролетни 2018": 20.0
    },
    "competition_grades": {
      "Пролетни 2023": 6.0,
      "Есенни 2022": 6.0,
      "Пролетни 2022": 5.0,
      "Олимпиада 2021": 4.0,
      "Пролетни 2021": 4.0,
      "2  кръг 2021": 4.0,
      "Олимпиада 2020": 3.0,
      "2 кръг 2020": 3.0,
      "Есенни 2019": 3.0,
      "Олимпиада 2018": 1.0,
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Петко Георгиев Еленкин",
    "grade": 14,
    "school": "СУЕО ,,А.С.Пушкин''",
    "city": "Варна",
    "competitions": {
      "Пролетни 2023": 10.25,
      "Есенни 2022": 13.5,
      "Пролетни 2022": 16.0,
      "Олимпиада 2021": 10.0,
      "Пролетни 2021": 15.0,
      "2  кръг 2021": 28.0
    },
    "competition_grades": {
      "Пролетни 2023": 6.0,
      "Есенни 2022": 6.0,
      "Пролетни 2022": 5.0,
      "Олимпиада 2021": 4.0,
      "Пролетни 2021": 4.0,
      "2  кръг 2021": 4.0
    }
  },
  {
    "name": "Мина Ивайлова Алипиева",
    "grade": 14,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Олимпиада 2023": 12.5,
      "Олимпиада 2022": 15.5,
      "Есенни 2021": 28.0,
      "Пролетни 2021": 2.5
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Олимпиада 2022": 5.0,
      "Есенни 2021": 5.0,
      "Пролетни 2021": 4.0
    }
  },
  {
    "name": "Найден Теодоров Бороджиев",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 21.5,
      "Пролетни 2022": 14.0
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Пролетни 2022": 5.0
    }
  },
  {
    "name": "Теодора Николаева Маринова",
    "grade": 14,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2022": 23.5,
      "Пролетни 2022": 7.0,
      "Олимпиада 2021": 8.0,
      "Пролетни 2021": 16.5,
      "2  кръг 2021": 22.5,
      "Олимпиада 2020": 17.25,
      "2 кръг 2020": 24.0,
      "Есенни 2019": 20.3
    },
    "competition_grades": {
      "Есенни 2022": 6.0,
      "Пролетни 2022": 5.0,
      "Олимпиада 2021": 4.0,
      "Пролетни 2021": 4.0,
      "2  кръг 2021": 4.0,
      "Олимпиада 2020": 3.0,
      "2 кръг 2020": 3.0,
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Теодор Тодоров Порязов",
    "grade": 14,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 20.0,
      "Пролетни 2023": 6.25
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0,
      "Пролетни 2023": 6.0
    }
  },
  {
    "name": "Димитър Венциславов Василев",
    "grade": 14,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2023": 10.5,
      "Есенни 2022": 13.6,
      "Пролетни 2022": 8.0,
      "Пролетни 2021": 14.5,
      "Олимпиада 2020": 19.0,
      "2 кръг 2020": 25.0,
      "Есенни 2019": 11.0,
      "Олимпиада 2019": 4.5,
      "Пролетни 2019": 10.7,
      "Олимпиада 2018": 9.5
    },
    "competition_grades": {
      "Пролетни 2023": 6.0,
      "Есенни 2022": 6.0,
      "Пролетни 2022": 5.0,
      "Пролетни 2021": 4.0,
      "Олимпиада 2020": 3.0,
      "2 кръг 2020": 3.0,
      "Есенни 2019": 3.0,
      "Олимпиада 2019": 2.0,
      "Пролетни 2019": 2.0,
      "Олимпиада 2018": 1.0
    }
  },
  {
    "name": "Камен Станиславов Монев",
    "grade": 14,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2022": 17.4,
      "Пролетни 2022": 13.0,
      "Пролетни 2021": 18.0,
      "Олимпиада 2020": 19.0,
      "2 кръг 2020": 24.5,
      "Есенни 2019": 15.0,
      "Олимпиада 2018": 14.0,
      "Пролетни 2018": 12.0,
      "Есенни 2017": 13.0
    },
    "competition_grades": {
      "Есенни 2022": 6.0,
      "Пролетни 2022": 5.0,
      "Пролетни 2021": 4.0,
      "Олимпиада 2020": 3.0,
      "2 кръг 2020": 3.0,
      "Есенни 2019": 3.0,
      "Олимпиада 2018": 1.0,
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Иван Янев Гюлев",
    "grade": 14,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2022": 25.05,
      "Пролетни 2022": 13.0
    },
    "competition_grades": {
      "Есенни 2022": 6.0,
      "Пролетни 2022": 5.0
    }
  },
  {
    "name": "Мартин Георгиев Георгиев",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 13.0,
      "Пролетни 2022": 17.0,
      "Есенни 2021": 30.0
    },
    "competition_grades": {
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 5.0,
      "Есенни 2021": 5.0
    }
  },
  {
    "name": "Илияс Башир Номан",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 24.5,
      "Есенни 2021": 27.0,
      "Пролетни 2019": 21.2
    },
    "competition_grades": {
      "Олимпиада 2022": 5.0,
      "Есенни 2021": 5.0,
      "Пролетни 2019": 2.0
    }
  },
  {
    "name": "Ина Ивова Стоянова",
    "grade": 14,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2023": 6.5,
      "Есенни 2022": 17.7,
      "Пролетни 2021": 9.0,
      "Есенни 2019": 18.3,
      "Пролетни 2019": 13.9
    },
    "competition_grades": {
      "Пролетни 2023": 6.0,
      "Есенни 2022": 6.0,
      "Пролетни 2021": 4.0,
      "Есенни 2019": 3.0,
      "Пролетни 2019": 2.0
    }
  },
  {
    "name": "Теодора Алексеева Николаева",
    "grade": 14,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2023": 7.0,
      "Есенни 2022": 15.5,
      "Пролетни 2021": 11.5,
      "Есенни 2019": 11.0,
      "Пролетни 2018": 16.0
    },
    "competition_grades": {
      "Пролетни 2023": 6.0,
      "Есенни 2022": 6.0,
      "Пролетни 2021": 4.0,
      "Есенни 2019": 3.0,
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Артем Андреев Занковский",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 15.0
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0
    }
  },
  {
    "name": "Здравко Светославов Колев",
    "grade": 14,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2023": 6.0,
      "Есенни 2022": 14.9,
      "Пролетни 2021": 5.5,
      "Есенни 2019": 13.0,
      "Пролетни 2018": 16.0
    },
    "competition_grades": {
      "Пролетни 2023": 6.0,
      "Есенни 2022": 6.0,
      "Пролетни 2021": 4.0,
      "Есенни 2019": 3.0,
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Алекс Росенов Карабашев",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 8.0,
      "Пролетни 2022": 13.0,
      "Есенни 2021": 26.0,
      "Олимпиада 2019": 7.5
    },
    "competition_grades": {
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 5.0,
      "Есенни 2021": 5.0,
      "Олимпиада 2019": 2.0
    }
  },
  {
    "name": "Даниел Емилов Димитров",
    "grade": 14,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2022": 18.0,
      "Олимпиада 2021": 11.0,
      "Пролетни 2021": 11.5,
      "2  кръг 2021": 23.5,
      "Есенни 2019": 19.0,
      "Пролетни 2018": 16.0,
      "Есенни 2017": 11.5
    },
    "competition_grades": {
      "Пролетни 2022": 5.0,
      "Олимпиада 2021": 4.0,
      "Пролетни 2021": 4.0,
      "2  кръг 2021": 4.0,
      "Есенни 2019": 3.0,
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Радослав Николаев Русев",
    "grade": 14,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2023": 3.0,
      "Есенни 2022": 13.75,
      "Пролетни 2021": 13.0,
      "Есенни 2019": 19.5
    },
    "competition_grades": {
      "Пролетни 2023": 6.0,
      "Есенни 2022": 6.0,
      "Пролетни 2021": 4.0,
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Мартин Йорданов Канлиев",
    "grade": 14,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенни 2022": 13.45,
      "Пролетни 2022": 8.0,
      "Пролетни 2021": 9.5,
      "Есенни 2019": 19.0
    },
    "competition_grades": {
      "Есенни 2022": 6.0,
      "Пролетни 2022": 5.0,
      "Пролетни 2021": 4.0,
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Стефан Цанков Мутафов",
    "grade": 14,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенни 2022": 15.1,
      "Пролетни 2022": 8.0,
      "Пролетни 2021": 3.5,
      "Есенни 2019": 13.0
    },
    "competition_grades": {
      "Есенни 2022": 6.0,
      "Пролетни 2022": 5.0,
      "Пролетни 2021": 4.0,
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Симеон Петров Кулев",
    "grade": 14,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2022": 15.0,
      "Олимпиада 2021": 15.0,
      "Пролетни 2021": 12.0,
      "2  кръг 2021": 22.5,
      "Есенни 2019": 12.2
    },
    "competition_grades": {
      "Пролетни 2022": 5.0,
      "Олимпиада 2021": 4.0,
      "Пролетни 2021": 4.0,
      "2  кръг 2021": 4.0,
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Люба Деянова Апостолова",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2023": 8.5,
      "Пролетни 2022": 14.0
    },
    "competition_grades": {
      "Пролетни 2023": 6.0,
      "Пролетни 2022": 5.0
    }
  },
  {
    "name": "Виктор Огнянов Герасимов",
    "grade": 14,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 17.0,
      "Олимпиада 2021": 10.5,
      "2  кръг 2021": 23.0,
      "Есенни 2019": 25.0
    },
    "competition_grades": {
      "Пролетни 2022": 5.0,
      "Олимпиада 2021": 4.0,
      "2  кръг 2021": 4.0,
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Марио Ивайлов Ангелов",
    "grade": 14,
    "school": "91 НЕГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 9.5
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0
    }
  },
  {
    "name": "Мирослав Динков Минчев",
    "grade": 14,
    "school": "ППМГ \"Гео Милев\"",
    "city": "Стара Загора",
    "competitions": {
      "Олимпиада 2021": 10.0,
      "2  кръг 2021": 29.0,
      "Олимпиада 2020": 28.0,
      "2 кръг 2020": 24.0,
      "Есенни 2019": 18.0,
      "Олимпиада 2019": 18.7
    },
    "competition_grades": {
      "Олимпиада 2021": 4.0,
      "2  кръг 2021": 4.0,
      "Олимпиада 2020": 3.0,
      "2 кръг 2020": 3.0,
      "Есенни 2019": 3.0,
      "Олимпиада 2019": 2.0
    }
  },
  {
    "name": "Русана Георгиева Тончева",
    "grade": 14,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2022": 7.5,
      "Пролетни 2022": 13.0,
      "Пролетни 2021": 7.0
    },
    "competition_grades": {
      "Есенни 2022": 6.0,
      "Пролетни 2022": 5.0,
      "Пролетни 2021": 4.0
    }
  },
  {
    "name": "Дарина Йорданова Цветанова",
    "grade": 14,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2022": 12.3,
      "Пролетни 2021": 8.5,
      "Есенни 2019": 17.5
    },
    "competition_grades": {
      "Есенни 2022": 6.0,
      "Пролетни 2021": 4.0,
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Пламена Данаилова Димитрова",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 8.0
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0
    }
  },
  {
    "name": "Теодор Тодоров Пенчев",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2023": 5.5,
      "Пролетни 2022": 9.0
    },
    "competition_grades": {
      "Пролетни 2023": 6.0,
      "Пролетни 2022": 5.0
    }
  },
  {
    "name": "Вероника Тихомирова Тодорова",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 7.0,
      "Олимпиада 2020": 15.75,
      "2 кръг 2020": 25.0,
      "Есенни 2019": 22.5,
      "Олимпиада 2019": 9.0,
      "Пролетни 2019": 14.7,
      "Олимпиада 2018": 15.2
    },
    "competition_grades": {
      "Пролетни 2022": 5.0,
      "Олимпиада 2020": 3.0,
      "2 кръг 2020": 3.0,
      "Есенни 2019": 3.0,
      "Олимпиада 2019": 2.0,
      "Пролетни 2019": 2.0,
      "Олимпиада 2018": 1.0
    }
  },
  {
    "name": "Христо Христов Кънев",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2023": 6.5
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0
    }
  },
  {
    "name": "Станислав Красимиров Великов",
    "grade": 14,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2022": 10.0,
      "Пролетни 2021": 11.0,
      "Есенни 2019": 28.5,
      "Пролетни 2019": 19.0,
      "Есенни 2017": 7.0
    },
    "competition_grades": {
      "Пролетни 2022": 5.0,
      "Пролетни 2021": 4.0,
      "Есенни 2019": 3.0,
      "Пролетни 2019": 2.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Кирил Георгиев Бахарев",
    "grade": 14,
    "school": "СУ при посолството на Руската Федерация",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 14.0,
      "Пролетни 2021": 13.0
    },
    "competition_grades": {
      "Пролетни 2022": 5.0,
      "Пролетни 2021": 4.0
    }
  },
  {
    "name": "Вивиан Росенова Стефанова",
    "grade": 14,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 13.0,
      "Пролетни 2021": 7.5,
      "2  кръг 2021": 28.0
    },
    "competition_grades": {
      "Олимпиада 2021": 4.0,
      "Пролетни 2021": 4.0,
      "2  кръг 2021": 4.0
    }
  },
  {
    "name": "Жара Недкова Еленска",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "2  кръг 2021": 24.0,
      "Олимпиада 2020": 19.0,
      "2 кръг 2020": 24.0,
      "Олимпиада 2018": 20.0,
      "Пролетни 2018": 22.5,
      "Есенни 2017": 14.0
    },
    "competition_grades": {
      "2  кръг 2021": 4.0,
      "Олимпиада 2020": 3.0,
      "2 кръг 2020": 3.0,
      "Олимпиада 2018": 1.0,
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Александър Данаилов Нинов",
    "grade": 14,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Олимпиада 2023": 5.5
    },
    "competition_grades": {
      "Олимпиада 2023": 5.0
    }
  },
  {
    "name": "Димитър Илиянов Сомлев",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 11.75,
      "2 кръг 2020": 30.0,
      "Есенни 2019": 27.5,
      "Олимпиада 2019": 23.5,
      "Пролетни 2019": 26.0,
      "Есенни 2017": 19.0
    },
    "competition_grades": {
      "Олимпиада 2020": 3.0,
      "2 кръг 2020": 3.0,
      "Есенни 2019": 3.0,
      "Олимпиада 2019": 2.0,
      "Пролетни 2019": 2.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Петър Емилиянов Куков",
    "grade": 14,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2022": 5.0,
      "Пролетни 2021": 9.0,
      "Есенни 2019": 20.5,
      "Олимпиада 2019": 18.7,
      "Пролетни 2019": 20.0,
      "Есенни 2018": 13.0,
      "Пролетни 2018": 15.0
    },
    "competition_grades": {
      "Пролетни 2022": 5.0,
      "Пролетни 2021": 4.0,
      "Есенни 2019": 3.0,
      "Олимпиада 2019": 2.0,
      "Пролетни 2019": 2.0,
      "Есенни 2018": 2.0,
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Ема Георгиева Стоянова",
    "grade": 14,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 16.0
    },
    "competition_grades": {
      "Пролетни 2022": 5.0
    }
  },
  {
    "name": "Виктор Николаев Николов",
    "grade": 14,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2022": 15.5
    },
    "competition_grades": {
      "Пролетни 2022": 5.0
    }
  },
  {
    "name": "Параскева Боянова Пенкова",
    "grade": 14,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2023": 5.5,
      "Есенни 2019": 17.0
    },
    "competition_grades": {
      "Пролетни 2023": 6.0,
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Петър Стоилов Жотев",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 11.5,
      "2  кръг 2021": 27.5
    },
    "competition_grades": {
      "Олимпиада 2021": 4.0,
      "2  кръг 2021": 4.0
    }
  },
  {
    "name": "Иван Руменов Камберов",
    "grade": 14,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 14.0
    },
    "competition_grades": {
      "Пролетни 2022": 5.0
    }
  },
  {
    "name": "Гергана Светославова Славчева",
    "grade": 14,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 11.0
    },
    "competition_grades": {
      "Пролетни 2022": 5.0
    }
  },
  {
    "name": "Павел Светославов Шияков",
    "grade": 14,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 11.0
    },
    "competition_grades": {
      "Пролетни 2022": 5.0
    }
  },
  {
    "name": "Петър Димитров Ивановски",
    "grade": 14,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 11.0
    },
    "competition_grades": {
      "Пролетни 2022": 5.0
    }
  },
  {
    "name": "Вяра Александрова Тодорова",
    "grade": 14,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Олимпиада 2020": 16.5,
      "2 кръг 2020": 30.0,
      "Олимпиада 2018": 16.1,
      "Пролетни 2018": 19.5,
      "Есенни 2017": 12.5
    },
    "competition_grades": {
      "Олимпиада 2020": 3.0,
      "2 кръг 2020": 3.0,
      "Олимпиада 2018": 1.0,
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Иван Димитров Иванов",
    "grade": 14,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2022": 8.0,
      "Есенни 2019": 20.5
    },
    "competition_grades": {
      "Пролетни 2022": 5.0,
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Йордан Илиев Стойчев",
    "grade": 14,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2021": 17.0,
      "Есенни 2019": 25.0
    },
    "competition_grades": {
      "Пролетни 2021": 4.0,
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Мартин Ясенов Георгиев",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 9.0
    },
    "competition_grades": {
      "Пролетни 2022": 5.0
    }
  },
  {
    "name": "Стефан Юлианов Драгославов",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "2 кръг 2020": 24.5,
      "Есенни 2019": 19.5
    },
    "competition_grades": {
      "2 кръг 2020": 3.0,
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Ивана Иванова Москова",
    "grade": 14,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2022": 6.0,
      "Пролетни 2021": 0.5
    },
    "competition_grades": {
      "Пролетни 2022": 5.0,
      "Пролетни 2021": 4.0
    }
  },
  {
    "name": "Емил Александров Лефтеров",
    "grade": 14,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 6.0
    },
    "competition_grades": {
      "Пролетни 2022": 5.0
    }
  },
  {
    "name": "Атанас Димитров Димитров",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 18.9,
      "Олимпиада 2019": 17.5,
      "Пролетни 2019": 18.5
    },
    "competition_grades": {
      "Есенни 2019": 3.0,
      "Олимпиада 2019": 2.0,
      "Пролетни 2019": 2.0
    }
  },
  {
    "name": "Иван Стефанов Шилев",
    "grade": 14,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2021": 11.0,
      "Олимпиада 2018": 13.2,
      "Есенни 2017": 13.0
    },
    "competition_grades": {
      "Пролетни 2021": 4.0,
      "Олимпиада 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Дамян Дамянов Калчев",
    "grade": 14,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетни 2022": 5.0
    },
    "competition_grades": {
      "Пролетни 2022": 5.0
    }
  },
  {
    "name": "Катерина Миленова Нанкова",
    "grade": 14,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 20.0,
      "Есенни 2018": 13.5,
      "Пролетни 2018": 24.5,
      "Есенни 2017": 18.5
    },
    "competition_grades": {
      "Есенни 2019": 3.0,
      "Есенни 2018": 2.0,
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Василена Тихомирова Василева",
    "grade": 14,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2021": 8.0,
      "Есенни 2019": 6.9
    },
    "competition_grades": {
      "Пролетни 2021": 4.0,
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Никола Александров Цачев",
    "grade": 14,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2019": 22.0,
      "Пролетни 2019": 24.6
    },
    "competition_grades": {
      "Олимпиада 2019": 2.0,
      "Пролетни 2019": 2.0
    }
  },
  {
    "name": "Димитър Илиев Дамянов",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2019": 13.5,
      "Пролетни 2019": 22.3,
      "Пролетни 2018": 22.5,
      "Есенни 2017": 13.0
    },
    "competition_grades": {
      "Олимпиада 2019": 2.0,
      "Пролетни 2019": 2.0,
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Алекса Владимирова Алексиева",
    "grade": 14,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 4.0
    },
    "competition_grades": {
      "Пролетни 2022": 5.0
    }
  },
  {
    "name": "Огнян Боянов Арсов",
    "grade": 14,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2022": 4.0
    },
    "competition_grades": {
      "Пролетни 2022": 5.0
    }
  },
  {
    "name": "Радост Събинова Цветкова",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 4.0
    },
    "competition_grades": {
      "Пролетни 2022": 5.0
    }
  },
  {
    "name": "Мария Александрова Златанова",
    "grade": 14,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Есенни 2019": 13.9,
      "Пролетни 2019": 19.3,
      "Пролетни 2018": 12.0
    },
    "competition_grades": {
      "Есенни 2019": 3.0,
      "Пролетни 2019": 2.0,
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Стиляна Георгиева Танкова",
    "grade": 14,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2019": 20.0,
      "Пролетни 2019": 12.0
    },
    "competition_grades": {
      "Есенни 2019": 3.0,
      "Пролетни 2019": 2.0
    }
  },
  {
    "name": "Иван Илиев Николов",
    "grade": 14,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2019": 15.5,
      "Олимпиада 2018": 13.5,
      "Пролетни 2018": 12.0,
      "Есенни 2017": 20.5
    },
    "competition_grades": {
      "Есенни 2019": 3.0,
      "Олимпиада 2018": 1.0,
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Божидар Николаев Иванов",
    "grade": 14,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Пролетни 2021": 8.0
    },
    "competition_grades": {
      "Пролетни 2021": 4.0
    }
  },
  {
    "name": "Йоанна Драганова Маркова",
    "grade": 14,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2021": 6.0,
      "Есенни 2019": 6.2
    },
    "competition_grades": {
      "Пролетни 2021": 4.0,
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Никола Радостинов Димитров",
    "grade": 14,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетни 2021": 3.0,
      "Есенни 2019": 14.5
    },
    "competition_grades": {
      "Пролетни 2021": 4.0,
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Петя Станимирова Петкова",
    "grade": 14,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетни 2022": 3.0
    },
    "competition_grades": {
      "Пролетни 2022": 5.0
    }
  },
  {
    "name": "Калоян Ростиславов Драгостинов",
    "grade": 14,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 15.5,
      "Есенни 2018": 16.0
    },
    "competition_grades": {
      "Есенни 2019": 3.0,
      "Есенни 2018": 2.0
    }
  },
  {
    "name": "Стилиян Пламенов Петров",
    "grade": 14,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 15.0,
      "Пролетни 2018": 19.0,
      "Есенни 2017": 14.0
    },
    "competition_grades": {
      "Есенни 2019": 3.0,
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Иван Ивелинов Богданов",
    "grade": 14,
    "school": "ПМГ \"Св. Климент Охридски\"",
    "city": "Силистра",
    "competitions": {
      "Пролетни 2021": 6.5
    },
    "competition_grades": {
      "Пролетни 2021": 4.0
    }
  },
  {
    "name": "Калина Соколова Николова",
    "grade": 14,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 11.0,
      "Олимпиада 2019": 12.5
    },
    "competition_grades": {
      "Есенни 2019": 3.0,
      "Олимпиада 2019": 2.0
    }
  },
  {
    "name": "Васил Радославов Рахнев",
    "grade": 14,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2019": 20.0
    },
    "competition_grades": {
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Никифор Никифор Богданов",
    "grade": 14,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 17.5
    },
    "competition_grades": {
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Виктор Иванов Павлов",
    "grade": 14,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 14.9
    },
    "competition_grades": {
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Стиляна Германова Котакова",
    "grade": 14,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2021": 4.5
    },
    "competition_grades": {
      "Пролетни 2021": 4.0
    }
  },
  {
    "name": "Даниел Хорхе Алберто Веласкес",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2019": 18.7
    },
    "competition_grades": {
      "Олимпиада 2019": 2.0
    }
  },
  {
    "name": "Елица Николова Димова",
    "grade": 14,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Есенни 2019": 12.9
    },
    "competition_grades": {
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Чавдар Иванов Чуков",
    "grade": 14,
    "school": "ППМГ \"Гео Милев\"",
    "city": "Стара Загора",
    "competitions": {
      "Пролетни 2021": 4.0
    },
    "competition_grades": {
      "Пролетни 2021": 4.0
    }
  },
  {
    "name": "Виктория Вилиславова Петрова",
    "grade": 14,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2021": 2.5,
      "Пролетни 2018": 14.0,
      "Есенни 2017": 5.5
    },
    "competition_grades": {
      "Пролетни 2021": 4.0,
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Гергана Манолова Александрова",
    "grade": 14,
    "school": "ПМГ \"Ат. Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Есенни 2019": 7.3,
      "Пролетни 2018": 19.5
    },
    "competition_grades": {
      "Есенни 2019": 3.0,
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Алекса Кирилова Георгиева",
    "grade": 14,
    "school": "АЕГ \"Гео Милев\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2019": 11.9
    },
    "competition_grades": {
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Теодора Пламенова Гаврилова",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2019": 21.0
    },
    "competition_grades": {
      "Пролетни 2019": 2.0
    }
  },
  {
    "name": "Яна Николаева Кескинова",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2019": 9.5,
      "Пролетни 2018": 12.0,
      "Есенни 2017": 9.0
    },
    "competition_grades": {
      "Олимпиада 2019": 2.0,
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Христо Розалинов Георгиев",
    "grade": 14,
    "school": "ППМГ \"Екзарх Антим I\"",
    "city": "Видин",
    "competitions": {
      "Олимпиада 2018": 26.0,
      "Есенни 2017": 16.0
    },
    "competition_grades": {
      "Олимпиада 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Делян Веселинов Димитров",
    "grade": 14,
    "school": "ПМГ \"Иван Вазов\"",
    "city": "Добрич",
    "competitions": {
      "Пролетни 2022": 1.0,
      "Пролетни 2018": 14.0
    },
    "competition_grades": {
      "Пролетни 2022": 5.0,
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Пея Стойчева Карова",
    "grade": 14,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2019": 9.5
    },
    "competition_grades": {
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Стелиан Мирославов Илиев",
    "grade": 14,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2019": 15.4
    },
    "competition_grades": {
      "Пролетни 2019": 2.0
    }
  },
  {
    "name": "Георги Стоянов Стоянов",
    "grade": 14,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 2.5
    },
    "competition_grades": {
      "Пролетни 2021": 4.0
    }
  },
  {
    "name": "Калоян Йорданов Караиванов",
    "grade": 14,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2018": 24.0,
      "Есенни 2017": 10.5
    },
    "competition_grades": {
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Ивайла Ивайлова Радкова",
    "grade": 14,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2018": 22.3
    },
    "competition_grades": {
      "Олимпиада 2018": 1.0
    }
  },
  {
    "name": "Радослав Цветлинов Попов",
    "grade": 14,
    "school": "ППМГ \"Екзарх Антим I\"",
    "city": "Видин",
    "competitions": {
      "Олимпиада 2018": 17.5,
      "Есенни 2017": 8.0
    },
    "competition_grades": {
      "Олимпиада 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Боряна Станимирова Георгиева",
    "grade": 14,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2018": 21.0,
      "Есенни 2017": 11.0
    },
    "competition_grades": {
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Кристиян Илиянов Илиев",
    "grade": 14,
    "school": "II ОУ \" П. Р. Славейков\"",
    "city": "Стара Загора",
    "competitions": {
      "Пролетни 2018": 24.2,
      "Есенни 2017": 5.5
    },
    "competition_grades": {
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Симона Антонова Антонова",
    "grade": 14,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2019": 11.8
    },
    "competition_grades": {
      "Пролетни 2019": 2.0
    }
  },
  {
    "name": "Хари Христов Алтъпармаков",
    "grade": 14,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2018": 17.0,
      "Есенни 2017": 14.5
    },
    "competition_grades": {
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Катерина Валентинова Баева",
    "grade": 14,
    "school": "Първа ЕГ",
    "city": "Варна",
    "competitions": {
      "Пролетни 2021": 2.0
    },
    "competition_grades": {
      "Пролетни 2021": 4.0
    }
  },
  {
    "name": "Кристиян Любомиров Бебенов",
    "grade": 14,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2019": 6.0
    },
    "competition_grades": {
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Мартина Георгиева Маркова",
    "grade": 14,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Олимпиада 2018": 18.5
    },
    "competition_grades": {
      "Олимпиада 2018": 1.0
    }
  },
  {
    "name": "Тереза Христова Ламбова",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2018": 14.0,
      "Есенни 2017": 14.0
    },
    "competition_grades": {
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Мартин Елков Георгиев",
    "grade": 14,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 5.7
    },
    "competition_grades": {
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Николай Златинов Стоянов",
    "grade": 14,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Пролетни 2018": 24.0
    },
    "competition_grades": {
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Троян Владимиров Крумов",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2018": 13.5
    },
    "competition_grades": {
      "Есенни 2018": 2.0
    }
  },
  {
    "name": "Стефан Стоянов Стайков",
    "grade": 14,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2018": 13.0
    },
    "competition_grades": {
      "Есенни 2018": 2.0
    }
  },
  {
    "name": "Емилия Емилова Димитрова",
    "grade": 14,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2018": 16.5,
      "Есенни 2017": 8.5
    },
    "competition_grades": {
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Габриела Борисова Трифонова",
    "grade": 14,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2019": 5.3
    },
    "competition_grades": {
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Ян Олегович Червинский",
    "grade": 14,
    "school": "ПМГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2018": 12.5,
      "Есенни 2017": 13.0
    },
    "competition_grades": {
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Симеон Найденов Тетрадев",
    "grade": 14,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2018": 12.0,
      "Есенни 2017": 12.5
    },
    "competition_grades": {
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Татяна Христова Петрова",
    "grade": 14,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2018": 13.5,
      "Есенни 2017": 10.0
    },
    "competition_grades": {
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Ния Александрова Бояджиева",
    "grade": 14,
    "school": "I ОУ \"Св. Кл. Охридски\"",
    "city": "Сандански",
    "competitions": {
      "Олимпиада 2018": 15.7
    },
    "competition_grades": {
      "Олимпиада 2018": 1.0
    }
  },
  {
    "name": "Мария Ивайлова Касчиева",
    "grade": 14,
    "school": "81 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2018": 15.0
    },
    "competition_grades": {
      "Олимпиада 2018": 1.0
    }
  },
  {
    "name": "Яна Добринова Каишева",
    "grade": 14,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2018": 15.0,
      "Есенни 2017": 6.0
    },
    "competition_grades": {
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Момчил Валериев Цветанов",
    "grade": 14,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2019": 7.3,
      "Пролетни 2018": 2.0
    },
    "competition_grades": {
      "Пролетни 2019": 2.0,
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Боян Бориславов Апостолов",
    "grade": 14,
    "school": "СУ \"Емилиян Станев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 4.5
    },
    "competition_grades": {
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Манол Николаев Ружинов",
    "grade": 14,
    "school": "ОУ \" Иван Вазов\"",
    "city": "Смолян",
    "competitions": {
      "Пролетни 2018": 15.5,
      "Есенни 2017": 4.5
    },
    "competition_grades": {
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Дана Петрова Бъчварова",
    "grade": 14,
    "school": "ПМГ \"Ат. Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Есенни 2019": 4.4
    },
    "competition_grades": {
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Светлана Владимирова Бояджиева",
    "grade": 14,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2018": 13.5,
      "Есенни 2017": 6.5
    },
    "competition_grades": {
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Александра Александрова Умленска",
    "grade": 14,
    "school": "ПМГ \"Проф. Ем. Иванов\"",
    "city": "Кюстендил",
    "competitions": {
      "Есенни 2019": 4.2
    },
    "competition_grades": {
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Ива Иванова Божинова",
    "grade": 14,
    "school": "ПМГ \"Ат. Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Пролетни 2018": 17.0
    },
    "competition_grades": {
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Борис Троянов Гогов",
    "grade": 14,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2019": 4.0
    },
    "competition_grades": {
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Александър Олегов Йорданов",
    "grade": 14,
    "school": "6 ОУ",
    "city": "София",
    "competitions": {
      "Пролетни 2018": 16.0
    },
    "competition_grades": {
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Момчил Ивайлов Марков",
    "grade": 14,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2018": 10.0,
      "Есенни 2017": 7.0
    },
    "competition_grades": {
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Анастасия Крумова Стоилова",
    "grade": 14,
    "school": "III ОУ \"Д.Талев\"",
    "city": "Благоевград",
    "competitions": {
      "Олимпиада 2018": 10.7
    },
    "competition_grades": {
      "Олимпиада 2018": 1.0
    }
  },
  {
    "name": "Виктория Владиславова Пепелярска",
    "grade": 14,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2019": 4.3,
      "Пролетни 2018": 4.0
    },
    "competition_grades": {
      "Пролетни 2019": 2.0,
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Владимир Валентинов Върбанов",
    "grade": 14,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2018": 13.5
    },
    "competition_grades": {
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Мария Запрянова Илиева",
    "grade": 14,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2019": 3.2
    },
    "competition_grades": {
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Станислав Златинов Стаматов",
    "grade": 14,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2018": 10.5,
      "Есенни 2017": 3.5
    },
    "competition_grades": {
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Никола Генадиев Емилов",
    "grade": 14,
    "school": "ППМГ \"Екзарх Антим I\"",
    "city": "Видин",
    "competitions": {
      "Олимпиада 2018": 9.0
    },
    "competition_grades": {
      "Олимпиада 2018": 1.0
    }
  },
  {
    "name": "Венцислава Веселинова Цонева",
    "grade": 14,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенни 2019": 2.8
    },
    "competition_grades": {
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Ралица Тихомирова Стайкова",
    "grade": 14,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2019": 4.5
    },
    "competition_grades": {
      "Пролетни 2019": 2.0
    }
  },
  {
    "name": "Румяна Руменова Павлова",
    "grade": 14,
    "school": "СУ ,, Саво Савов\"",
    "city": "Пирдоп",
    "competitions": {
      "Пролетни 2018": 10.5
    },
    "competition_grades": {
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Костадин Костадинов Бундов",
    "grade": 14,
    "school": "ОУ \" Иван Вазов\"",
    "city": "Смолян",
    "competitions": {
      "Пролетни 2018": 6.5,
      "Есенни 2017": 4.5
    },
    "competition_grades": {
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Катя Йорданова Христова",
    "grade": 14,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2018": 3.0,
      "Есенни 2017": 7.25
    },
    "competition_grades": {
      "Пролетни 2018": 1.0,
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Мария Хрисимова Михайлова",
    "grade": 14,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2019": 1.8,
      "Пролетни 2018": 4.0
    },
    "competition_grades": {
      "Пролетни 2019": 2.0,
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Ани Деянова Ганчева",
    "grade": 14,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 1.9
    },
    "competition_grades": {
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Зорница Миланова Георгиева",
    "grade": 14,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2017": 9.5
    },
    "competition_grades": {
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Борислав Илийчев Борисов",
    "grade": 14,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2019": 3.0
    },
    "competition_grades": {
      "Пролетни 2019": 2.0
    }
  },
  {
    "name": "Васил Константинов Иванов",
    "grade": 14,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 8.5
    },
    "competition_grades": {
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Светослав Илиев Славов",
    "grade": 14,
    "school": "СУ \"Гео Милев\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 8.5
    },
    "competition_grades": {
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Мартин Стефанов Севов",
    "grade": 14,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2017": 8.0
    },
    "competition_grades": {
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Петър Пламенов Георгиев",
    "grade": 14,
    "school": "АЕГ \"Гео Милев\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2019": 1.4
    },
    "competition_grades": {
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Ивайло Красимиров Колев",
    "grade": 14,
    "school": "СУ \"Гео Милев\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 7.5
    },
    "competition_grades": {
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Христо Димитров Чолаков",
    "grade": 14,
    "school": "СУ \" П. Яворов\"",
    "city": "Сливен",
    "competitions": {
      "Пролетни 2018": 5.5
    },
    "competition_grades": {
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Антон Момчилов Гушев",
    "grade": 14,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 1.2
    },
    "competition_grades": {
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Теодора Асенова Юрукова",
    "grade": 14,
    "school": "СУ ,, Саво Савов\"",
    "city": "Пирдоп",
    "competitions": {
      "Пролетни 2018": 5.0
    },
    "competition_grades": {
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Алекс Георгиев Заимов",
    "grade": 14,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2017": 6.0
    },
    "competition_grades": {
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Емил Яниславов Трифонов",
    "grade": 14,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 6.0
    },
    "competition_grades": {
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Александър Георгиев Георгиев",
    "grade": 14,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2017": 5.5
    },
    "competition_grades": {
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Теодора Стоянова Генова",
    "grade": 14,
    "school": "СУ \" П. Яворов\"",
    "city": "Сливен",
    "competitions": {
      "Пролетни 2018": 4.0
    },
    "competition_grades": {
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Елизабет Борисова Гърбева",
    "grade": 14,
    "school": "II ОУ \" П. Р. Славейков\"",
    "city": "Стара Загора",
    "competitions": {
      "Пролетни 2018": 3.5
    },
    "competition_grades": {
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Герасим Атанасов Пешев",
    "grade": 14,
    "school": "СУ \"Емилиян Станев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 0.8
    },
    "competition_grades": {
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Елица Петрова Маринова",
    "grade": 14,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2019": 1.3
    },
    "competition_grades": {
      "Пролетни 2019": 2.0
    }
  },
  {
    "name": "Емин Шукри Арифов",
    "grade": 14,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2017": 4.0
    },
    "competition_grades": {
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Ванеса Красимирова Костадинова",
    "grade": 14,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2017": 3.5
    },
    "competition_grades": {
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Преслава Димитрова Димкова",
    "grade": 14,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2017": 3.5
    },
    "competition_grades": {
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Георги Веселинов Иванов",
    "grade": 14,
    "school": "СУ \" П. Яворов\"",
    "city": "Сливен",
    "competitions": {
      "Пролетни 2018": 1.5
    },
    "competition_grades": {
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Калоян Стефанов Парасков",
    "grade": 14,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 2.0
    },
    "competition_grades": {
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Димитър Николаев Великов",
    "grade": 14,
    "school": "ОУ''Хр.Смирненски\"",
    "city": "Генерал Тошево",
    "competitions": {
      "Есенни 2017": 1.5
    },
    "competition_grades": {
      "Есенни 2017": 1.0
    }
  },
  {
    "name": "Димитрина Светославова Димитрова",
    "grade": 14,
    "school": "АЕГ \"Гео Милев\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2019": 0.2
    },
    "competition_grades": {
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Таня Руменова Петрова",
    "grade": 14,
    "school": "АЕГ \"Гео Милев\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2019": 0.2
    },
    "competition_grades": {
      "Есенни 2019": 3.0
    }
  },
  {
    "name": "Бирджан Айтен Сали",
    "grade": 14,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетни 2022": 0.0
    },
    "competition_grades": {
      "Пролетни 2022": 5.0
    }
  },
  {
    "name": "Виктор Юриев Дойчев",
    "grade": 14,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетни 2022": 0.0
    },
    "competition_grades": {
      "Пролетни 2022": 5.0
    }
  },
  {
    "name": "Ивайло Диянов Динев",
    "grade": 14,
    "school": "СУ \" П. Яворов\"",
    "city": "Сливен",
    "competitions": {
      "Пролетни 2018": 0.0
    },
    "competition_grades": {
      "Пролетни 2018": 1.0
    }
  },
  {
    "name": "Александър Пламенов Проданов",
    "grade": 15,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Олимпиада 2022": 93.75,
      "Пролетни 2022": 29.5,
      "Есенни 2021": 30.0,
      "Олимпиада 2021": 83.0,
      "Пролетни 2021": 27.4,
      "2  кръг 2021": 30.0,
      "Олимпиада 2020": 56.0,
      "2 кръг 2020": 30.0,
      "Есенни 2019": 29.5,
      "Олимпиада 2019": 83.6,
      "Пролетни 2019": 23.8,
      "Есенни 2018": 26.0,
      "Олимпиада 2018": 29.75,
      "Пролетни 2018": 26.5,
      "Есенни 2017": 28.5,
      "Олимпиада 2017": 25.0,
      "Пролетни 2017": 28.25,
      "Есенни 2016": 25.5
    },
    "competition_grades": {
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 7.0,
      "Есенни 2021": 6.0,
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 7.0,
      "2  кръг 2021": 6.0,
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 6.0,
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 6.0,
      "Есенни 2018": 6.0,
      "Олимпиада 2018": 2.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Олимпиада 2017": 1.0,
      "Пролетни 2017": 1.0,
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Явор Мирославов Йорданов",
    "grade": 15,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 85.0,
      "Пролетни 2022": 24.4,
      "Олимпиада 2021": 79.8,
      "Пролетни 2021": 27.5,
      "2  кръг 2021": 30.0,
      "Олимпиада 2020": 42.0,
      "2 кръг 2020": 29.5,
      "Есенни 2019": 19.0,
      "Олимпиада 2019": 29.75,
      "Пролетни 2019": 24.0,
      "Есенни 2018": 23.0,
      "Олимпиада 2018": 19.5,
      "Пролетни 2018": 22.5,
      "Есенни 2017": 19.0,
      "Олимпиада 2017": 15.0
    },
    "competition_grades": {
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 7.0,
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 7.0,
      "2  кръг 2021": 5.0,
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 6.0,
      "Олимпиада 2019": 3.0,
      "Пролетни 2019": 3.0,
      "Есенни 2018": 3.0,
      "Олимпиада 2018": 2.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Олимпиада 2017": 1.0
    }
  },
  {
    "name": "Александър Драгомиров Русев",
    "grade": 15,
    "school": "Първа ЕГ",
    "city": "Варна",
    "competitions": {
      "Олимпиада 2022": 74.25,
      "Пролетни 2022": 16.0,
      "Есенни 2021": 22.0,
      "Олимпиада 2021": 62.0,
      "Пролетни 2021": 16.0,
      "2  кръг 2021": 21.0,
      "Олимпиада 2020": 25.0,
      "2 кръг 2020": 21.0,
      "Есенни 2019": 21.75
    },
    "competition_grades": {
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 7.0,
      "Есенни 2021": 6.0,
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 7.0,
      "2  кръг 2021": 5.0,
      "Олимпиада 2020": 4.0,
      "2 кръг 2020": 4.0,
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Цветослав Валентинов Мавродиев",
    "grade": 15,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Олимпиада 2022": 49.0,
      "Пролетни 2022": 24.5,
      "Есенни 2021": 24.0,
      "Олимпиада 2021": 56.75,
      "Пролетни 2021": 20.0,
      "2  кръг 2021": 21.5,
      "Олимпиада 2020": 24.0,
      "2 кръг 2020": 28.0,
      "Есенни 2019": 26.25,
      "Олимпиада 2019": 29.0,
      "Пролетни 2019": 27.0,
      "Есенни 2018": 23.0,
      "Пролетни 2018": 27.5,
      "Есенни 2017": 29.0
    },
    "competition_grades": {
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 6.0,
      "Есенни 2021": 6.0,
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 5.0,
      "2  кръг 2021": 5.0,
      "Олимпиада 2020": 4.0,
      "2 кръг 2020": 4.0,
      "Есенни 2019": 4.0,
      "Олимпиада 2019": 3.0,
      "Пролетни 2019": 3.0,
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Иван Мирчев Попов",
    "grade": 15,
    "school": "ПМГ \"Яне Сандански\"",
    "city": "Гоце Делчев",
    "competitions": {
      "Олимпиада 2022": 61.75,
      "Пролетни 2022": 18.0,
      "Есенни 2021": 30.0,
      "Олимпиада 2021": 67.0,
      "Пролетни 2021": 12.0,
      "2  кръг 2021": 23.0
    },
    "competition_grades": {
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 7.0,
      "Есенни 2021": 6.0,
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 5.0,
      "2  кръг 2021": 5.0
    }
  },
  {
    "name": "Самуил Владимиров Петков",
    "grade": 15,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 37.0,
      "Пролетни 2022": 14.0,
      "Есенни 2021": 26.0,
      "Олимпиада 2021": 60.45,
      "Пролетни 2021": 25.5,
      "2  кръг 2021": 23.7,
      "Олимпиада 2020": 37.9,
      "2 кръг 2020": 24.5,
      "Есенни 2019": 5.5,
      "Олимпиада 2019": 28.0,
      "Есенни 2018": 19.5,
      "Олимпиада 2017": 12.5
    },
    "competition_grades": {
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 7.0,
      "Есенни 2021": 6.0,
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 7.0,
      "2  кръг 2021": 6.0,
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 6.0,
      "Олимпиада 2019": 3.0,
      "Есенни 2018": 2.0,
      "Олимпиада 2017": 1.0
    }
  },
  {
    "name": "Мартин Димитров Димитров",
    "grade": 15,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 58.25,
      "Пролетни 2022": 1.0,
      "Есенни 2021": 23.0,
      "Олимпиада 2021": 60.25,
      "2  кръг 2021": 24.0,
      "Олимпиада 2020": 17.0,
      "2 кръг 2020": 20.5
    },
    "competition_grades": {
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 7.0,
      "Есенни 2021": 6.0,
      "Олимпиада 2021": 5.0,
      "2  кръг 2021": 5.0,
      "Олимпиада 2020": 4.0,
      "2 кръг 2020": 4.0
    }
  },
  {
    "name": "Георги Паскалев Апостолов",
    "grade": 15,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2022": 36.0,
      "Пролетни 2022": 17.5,
      "Есенни 2021": 27.5,
      "Олимпиада 2021": 47.25,
      "Пролетни 2021": 6.8,
      "2  кръг 2021": 26.5,
      "Олимпиада 2020": 18.0,
      "2 кръг 2020": 25.5,
      "Есенни 2019": 5.0,
      "Олимпиада 2019": 15.5,
      "Пролетни 2019": 20.0,
      "Есенни 2018": 18.5,
      "Олимпиада 2017": 14.5,
      "Пролетни 2017": 20.25,
      "Есенни 2016": 26.5
    },
    "competition_grades": {
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 6.0,
      "Есенни 2021": 6.0,
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 7.0,
      "2  кръг 2021": 5.0,
      "Олимпиада 2020": 4.0,
      "2 кръг 2020": 4.0,
      "Есенни 2019": 6.0,
      "Олимпиада 2019": 3.0,
      "Пролетни 2019": 3.0,
      "Есенни 2018": 2.0,
      "Олимпиада 2017": 1.0,
      "Пролетни 2017": 1.0,
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Георги Цветелинов Игнатов",
    "grade": 15,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Олимпиада 2022": 44.25,
      "Пролетни 2022": 21.0,
      "Есенни 2021": 24.5,
      "Олимпиада 2021": 22.0,
      "Пролетни 2021": 9.0,
      "2  кръг 2021": 23.0,
      "Олимпиада 2020": 13.5,
      "2 кръг 2020": 24.0,
      "Есенни 2019": 15.5,
      "Пролетни 2019": 24.0,
      "Есенни 2018": 14.0,
      "Пролетни 2017": 19.75
    },
    "competition_grades": {
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 6.0,
      "Есенни 2021": 6.0,
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 5.0,
      "2  кръг 2021": 5.0,
      "Олимпиада 2020": 4.0,
      "2 кръг 2020": 4.0,
      "Есенни 2019": 4.0,
      "Пролетни 2019": 3.0,
      "Есенни 2018": 2.0,
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Костадин Николов Чучулайн",
    "grade": 15,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Олимпиада 2022": 31.0,
      "Есенни 2021": 29.5,
      "Олимпиада 2021": 48.15,
      "Пролетни 2021": 15.4,
      "2  кръг 2021": 26.5,
      "Олимпиада 2020": 20.0,
      "2 кръг 2020": 22.0,
      "Есенни 2019": 19.5
    },
    "competition_grades": {
      "Олимпиада 2022": 5.0,
      "Есенни 2021": 6.0,
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 7.0,
      "2  кръг 2021": 5.0,
      "Олимпиада 2020": 4.0,
      "2 кръг 2020": 4.0,
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Милко Иванов Бакалов",
    "grade": 15,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 46.25,
      "Есенни 2021": 29.75,
      "Олимпиада 2021": 23.75,
      "Пролетни 2021": 22.0,
      "2  кръг 2021": 21.5
    },
    "competition_grades": {
      "Олимпиада 2022": 5.0,
      "Есенни 2021": 6.0,
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 5.0,
      "2  кръг 2021": 5.0
    }
  },
  {
    "name": "Иво Ивов Лозанов",
    "grade": 15,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 32.75,
      "Есенни 2021": 20.75,
      "Олимпиада 2021": 45.95,
      "Пролетни 2021": 10.0,
      "2  кръг 2021": 25.0,
      "Олимпиада 2020": 18.0,
      "2 кръг 2020": 20.75,
      "Есенни 2019": 23.75,
      "Пролетни 2018": 18.75
    },
    "competition_grades": {
      "Олимпиада 2022": 5.0,
      "Есенни 2021": 6.0,
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 5.0,
      "2  кръг 2021": 5.0,
      "Олимпиада 2020": 4.0,
      "2 кръг 2020": 4.0,
      "Есенни 2019": 4.0,
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Спас Жеков Димитров",
    "grade": 15,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 40.5,
      "Есенни 2021": 28.0,
      "Олимпиада 2021": 30.85,
      "2  кръг 2021": 25.0,
      "Есенни 2019": 20.75,
      "Есенни 2018": 16.5
    },
    "competition_grades": {
      "Олимпиада 2022": 5.0,
      "Есенни 2021": 6.0,
      "Олимпиада 2021": 5.0,
      "2  кръг 2021": 5.0,
      "Есенни 2019": 4.0,
      "Есенни 2018": 2.0
    }
  },
  {
    "name": "Марта Емилова Младенова",
    "grade": 15,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Олимпиада 2022": 23.0,
      "Пролетни 2022": 7.5,
      "Есенни 2021": 20.0,
      "Олимпиада 2021": 17.5,
      "Пролетни 2021": 12.0,
      "2  кръг 2021": 20.0,
      "Есенни 2019": 10.0,
      "Есенни 2018": 9.5,
      "Пролетни 2018": 12.5,
      "Есенни 2017": 9.0,
      "Олимпиада 2017": 12.5,
      "Пролетни 2017": 12.25
    },
    "competition_grades": {
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 6.0,
      "Есенни 2021": 6.0,
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 5.0,
      "2  кръг 2021": 5.0,
      "Есенни 2019": 4.0,
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Олимпиада 2017": 1.0,
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Кирил Тихомиров Кирилов",
    "grade": 15,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Олимпиада 2022": 15.5,
      "Пролетни 2022": 16.5,
      "Есенни 2021": 21.5,
      "Олимпиада 2021": 14.0,
      "Пролетни 2021": 11.0,
      "2  кръг 2021": 20.5
    },
    "competition_grades": {
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 6.0,
      "Есенни 2021": 6.0,
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 5.0,
      "2  кръг 2021": 5.0
    }
  },
  {
    "name": "Александра Димитрова Найденова",
    "grade": 15,
    "school": "ГПЧЕ \"Симеон Радев\"",
    "city": "Перник",
    "competitions": {
      "Олимпиада 2022": 23.5,
      "Есенни 2021": 20.5,
      "Олимпиада 2021": 16.75,
      "2  кръг 2021": 20.0,
      "Олимпиада 2017": 20.0
    },
    "competition_grades": {
      "Олимпиада 2022": 5.0,
      "Есенни 2021": 6.0,
      "Олимпиада 2021": 5.0,
      "2  кръг 2021": 5.0,
      "Олимпиада 2017": 1.0
    }
  },
  {
    "name": "Добромир Викторов Стоев",
    "grade": 15,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2022": 21.0,
      "Пролетни 2022": 11.5,
      "Есенни 2021": 24.5
    },
    "competition_grades": {
      "Олимпиада 2022": 5.0,
      "Пролетни 2022": 6.0,
      "Есенни 2021": 6.0
    }
  },
  {
    "name": "Дарин Веселинов Крумов",
    "grade": 15,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2022": 19.5,
      "Есенни 2021": 20.0,
      "Олимпиада 2021": 12.0,
      "2  кръг 2021": 24.0
    },
    "competition_grades": {
      "Олимпиада 2022": 5.0,
      "Есенни 2021": 6.0,
      "Олимпиада 2021": 5.0,
      "2  кръг 2021": 5.0
    }
  },
  {
    "name": "Тервел Галинов Стоянов",
    "grade": 15,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2022": 22.0,
      "Пролетни 2021": 12.0,
      "Олимпиада 2020": 20.5,
      "2 кръг 2020": 20.5,
      "Есенни 2019": 26.0,
      "Олимпиада 2019": 14.5,
      "Пролетни 2019": 22.5,
      "Есенни 2018": 15.0,
      "Олимпиада 2018": 11.75,
      "Пролетни 2018": 19.0,
      "Есенни 2017": 18.5,
      "Олимпиада 2017": 25.5,
      "Пролетни 2017": 19.25
    },
    "competition_grades": {
      "Пролетни 2022": 6.0,
      "Пролетни 2021": 5.0,
      "Олимпиада 2020": 4.0,
      "2 кръг 2020": 4.0,
      "Есенни 2019": 4.0,
      "Олимпиада 2019": 3.0,
      "Пролетни 2019": 3.0,
      "Есенни 2018": 2.0,
      "Олимпиада 2018": 2.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Олимпиада 2017": 1.0,
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Мартина Ивова Дочева",
    "grade": 15,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 21.5,
      "Олимпиада 2021": 14.7,
      "Пролетни 2021": 9.0,
      "2  кръг 2021": 21.5,
      "Есенни 2019": 16.25,
      "Есенни 2018": 7.5,
      "Пролетни 2018": 13.0
    },
    "competition_grades": {
      "Пролетни 2022": 6.0,
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 5.0,
      "2  кръг 2021": 5.0,
      "Есенни 2019": 4.0,
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Славчо Стефанов Недков",
    "grade": 15,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 10.0,
      "Олимпиада 2021": 15.75,
      "Пролетни 2021": 11.0,
      "2  кръг 2021": 23.0
    },
    "competition_grades": {
      "Пролетни 2022": 6.0,
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 5.0,
      "2  кръг 2021": 5.0
    }
  },
  {
    "name": "Мартин Ваньов Маринов",
    "grade": 15,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2022": 12.0,
      "Олимпиада 2021": 11.7,
      "Пролетни 2021": 10.0,
      "2  кръг 2021": 20.0,
      "Есенни 2019": 12.25
    },
    "competition_grades": {
      "Пролетни 2022": 6.0,
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 5.0,
      "2  кръг 2021": 5.0,
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Гергана Ивова Николаева",
    "grade": 15,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Есенни 2021": 20.5,
      "Олимпиада 2021": 14.0,
      "2  кръг 2021": 21.5,
      "Пролетни 2017": 18.0
    },
    "competition_grades": {
      "Есенни 2021": 6.0,
      "Олимпиада 2021": 5.0,
      "2  кръг 2021": 5.0,
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Димитър Пламенов Нецов",
    "grade": 15,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 13.25,
      "Пролетни 2021": 16.0,
      "2  кръг 2021": 20.5,
      "Олимпиада 2020": 8.0,
      "2 кръг 2020": 21.5,
      "Есенни 2019": 25.5
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 5.0,
      "2  кръг 2021": 5.0,
      "Олимпиада 2020": 4.0,
      "2 кръг 2020": 4.0,
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Теодор Кирилов Кирилов",
    "grade": 15,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 16.0,
      "2  кръг 2021": 25.0,
      "Олимпиада 2020": 14.5,
      "2 кръг 2020": 22.5,
      "Есенни 2019": 23.5
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "2  кръг 2021": 5.0,
      "Олимпиада 2020": 4.0,
      "2 кръг 2020": 4.0,
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Борис Насков Василев",
    "grade": 15,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 22.0,
      "Пролетни 2021": 19.0,
      "2  кръг 2021": 21.0
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 5.0,
      "2  кръг 2021": 5.0
    }
  },
  {
    "name": "Димитър Руменов Пандев",
    "grade": 15,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2022": 14.5,
      "Пролетни 2021": 12.0,
      "Есенни 2019": 14.5
    },
    "competition_grades": {
      "Пролетни 2022": 6.0,
      "Пролетни 2021": 5.0,
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Атанас Тодоров Бунтов",
    "grade": 15,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Олимпиада 2021": 18.5,
      "2  кръг 2021": 22.0,
      "Есенни 2019": 21.5,
      "Есенни 2018": 17.5
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "2  кръг 2021": 5.0,
      "Есенни 2019": 4.0,
      "Есенни 2018": 2.0
    }
  },
  {
    "name": "Йосиф Щерев Маринов",
    "grade": 15,
    "school": "91 НЕГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 16.3,
      "2  кръг 2021": 20.5,
      "Есенни 2019": 17.25,
      "Есенни 2018": 13.0,
      "Олимпиада 2017": 14.0,
      "Пролетни 2017": 18.0,
      "Есенни 2016": 17.5
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "2  кръг 2021": 5.0,
      "Есенни 2019": 4.0,
      "Есенни 2018": 2.0,
      "Олимпиада 2017": 1.0,
      "Пролетни 2017": 1.0,
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Димитър Стефанов Димитров",
    "grade": 15,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 13.5,
      "Олимпиада 2020": 7.0,
      "2 кръг 2020": 20.75
    },
    "competition_grades": {
      "Пролетни 2022": 6.0,
      "Олимпиада 2020": 4.0,
      "2 кръг 2020": 4.0
    }
  },
  {
    "name": "Стефан Момчилов Стефанов",
    "grade": 15,
    "school": "91 НЕГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 6.5,
      "2  кръг 2021": 20.5,
      "Олимпиада 2020": 9.5,
      "2 кръг 2020": 21.5,
      "Есенни 2019": 6.25
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "2  кръг 2021": 5.0,
      "Олимпиада 2020": 4.0,
      "2 кръг 2020": 4.0,
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Константин Каменов Каменов",
    "grade": 15,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 10.5,
      "2  кръг 2021": 20.0,
      "Есенни 2019": 21.25,
      "Олимпиада 2019": 17.0
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "2  кръг 2021": 5.0,
      "Есенни 2019": 4.0,
      "Олимпиада 2019": 3.0
    }
  },
  {
    "name": "Румяна Иван-Асен Иванова",
    "grade": 15,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 11.5,
      "2  кръг 2021": 20.0,
      "Есенни 2019": 13.75,
      "Пролетни 2019": 20.0,
      "Пролетни 2017": 15.25,
      "Есенни 2016": 26.0
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "2  кръг 2021": 5.0,
      "Есенни 2019": 4.0,
      "Пролетни 2019": 3.0,
      "Пролетни 2017": 1.0,
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Ангел Иванов Райчев",
    "grade": 15,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 15.0,
      "2  кръг 2021": 25.0
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "2  кръг 2021": 5.0
    }
  },
  {
    "name": "Илия Кънчев Кьосев",
    "grade": 15,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Олимпиада 2021": 7.25,
      "Пролетни 2021": 10.0,
      "2  кръг 2021": 20.5,
      "Есенни 2019": 11.0
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 5.0,
      "2  кръг 2021": 5.0,
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Мартин Димитров Тенджов",
    "grade": 15,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 12.0,
      "Пролетни 2021": 9.0
    },
    "competition_grades": {
      "Пролетни 2022": 6.0,
      "Пролетни 2021": 5.0
    }
  },
  {
    "name": "Калоян Валентинов Георгиев",
    "grade": 15,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2022": 10.0,
      "Пролетни 2021": 8.0,
      "Есенни 2019": 9.75
    },
    "competition_grades": {
      "Пролетни 2022": 6.0,
      "Пролетни 2021": 5.0,
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Виктория Данаилова Христова",
    "grade": 15,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Олимпиада 2020": 17.5,
      "2 кръг 2020": 21.75,
      "Есенни 2019": 24.0,
      "Олимпиада 2019": 17.5,
      "Есенни 2018": 15.5,
      "Олимпиада 2017": 15.5
    },
    "competition_grades": {
      "Олимпиада 2020": 4.0,
      "2 кръг 2020": 4.0,
      "Есенни 2019": 4.0,
      "Олимпиада 2019": 3.0,
      "Есенни 2018": 2.0,
      "Олимпиада 2017": 1.0
    }
  },
  {
    "name": "Иван Иванов Бичев",
    "grade": 15,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2022": 13.5
    },
    "competition_grades": {
      "Пролетни 2022": 6.0
    }
  },
  {
    "name": "Пресиан Валентинов Михайлов",
    "grade": 15,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2021": 7.0,
      "Олимпиада 2020": 14.0,
      "2 кръг 2020": 20.5,
      "Есенни 2019": 16.0,
      "Есенни 2018": 15.0
    },
    "competition_grades": {
      "Пролетни 2021": 5.0,
      "Олимпиада 2020": 4.0,
      "2 кръг 2020": 4.0,
      "Есенни 2019": 4.0,
      "Есенни 2018": 2.0
    }
  },
  {
    "name": "Борислав Валентинов Стоянов",
    "grade": 15,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 11.0,
      "2  кръг 2021": 20.5
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "2  кръг 2021": 5.0
    }
  },
  {
    "name": "Димитър Росенов Чапаров",
    "grade": 15,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Олимпиада 2021": 9.0,
      "2  кръг 2021": 20.25,
      "Есенни 2019": 6.25
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "2  кръг 2021": 5.0,
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Дебора Бориславова Петрова",
    "grade": 15,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Олимпиада 2021": 7.5,
      "2  кръг 2021": 20.0,
      "Есенни 2019": 8.0
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "2  кръг 2021": 5.0,
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Михаил Бориславов Илиев",
    "grade": 15,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2022": 10.5,
      "Есенни 2019": 6.25
    },
    "competition_grades": {
      "Пролетни 2022": 6.0,
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Персиан Любомиров Турсунов",
    "grade": 15,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "2  кръг 2021": 21.0,
      "Есенни 2019": 16.0
    },
    "competition_grades": {
      "2  кръг 2021": 5.0,
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Атанас Георгиев Илиев",
    "grade": 15,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 9.0,
      "2 кръг 2020": 21.0,
      "Есенни 2019": 16.75,
      "Пролетни 2017": 16.75
    },
    "competition_grades": {
      "Олимпиада 2020": 4.0,
      "2 кръг 2020": 4.0,
      "Есенни 2019": 4.0,
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Андон Ивайлов Тодоров",
    "grade": 15,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "2  кръг 2021": 24.0
    },
    "competition_grades": {
      "2  кръг 2021": 5.0
    }
  },
  {
    "name": "Елена Павлинова Вутова",
    "grade": 15,
    "school": "ПМГ \"Иван Вазов\"",
    "city": "Добрич",
    "competitions": {
      "Олимпиада 2020": 11.0,
      "2 кръг 2020": 20.5
    },
    "competition_grades": {
      "Олимпиада 2020": 4.0,
      "2 кръг 2020": 4.0
    }
  },
  {
    "name": "Давид Сергеевич Кан",
    "grade": 15,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2020": 8.0,
      "2 кръг 2020": 20.5,
      "Олимпиада 2017": 11.0,
      "Пролетни 2017": 18.25,
      "Есенни 2016": 27.0
    },
    "competition_grades": {
      "Олимпиада 2020": 4.0,
      "2 кръг 2020": 4.0,
      "Олимпиада 2017": 1.0,
      "Пролетни 2017": 1.0,
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Стефанка Тодорова Манахова",
    "grade": 15,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "2 кръг 2020": 20.5,
      "Олимпиада 2019": 22.5
    },
    "competition_grades": {
      "2 кръг 2020": 4.0,
      "Олимпиада 2019": 3.0
    }
  },
  {
    "name": "Атанас Христов Донев",
    "grade": 15,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2021": 4.0,
      "Есенни 2019": 10.5,
      "Пролетни 2019": 21.0,
      "Есенни 2018": 15.0,
      "Есенни 2016": 13.0
    },
    "competition_grades": {
      "Пролетни 2021": 5.0,
      "Есенни 2019": 4.0,
      "Пролетни 2019": 3.0,
      "Есенни 2018": 2.0,
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Александър Сашев Глушков",
    "grade": 15,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Есенни 2019": 13.75,
      "Есенни 2018": 20.5,
      "Олимпиада 2018": 15.75,
      "Пролетни 2018": 18.75,
      "Олимпиада 2017": 20.0,
      "Пролетни 2017": 18.5
    },
    "competition_grades": {
      "Есенни 2019": 4.0,
      "Есенни 2018": 2.0,
      "Олимпиада 2018": 2.0,
      "Пролетни 2018": 2.0,
      "Олимпиада 2017": 1.0,
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Георги Димитров Златков",
    "grade": 15,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Пролетни 2021": 11.0
    },
    "competition_grades": {
      "Пролетни 2021": 5.0
    }
  },
  {
    "name": "Мира Стефанова Великова",
    "grade": 15,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2021": 7.0,
      "Есенни 2019": 5.5,
      "Пролетни 2018": 8.75,
      "Есенни 2017": 14.5,
      "Пролетни 2017": 14.75
    },
    "competition_grades": {
      "Пролетни 2021": 5.0,
      "Есенни 2019": 4.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Никола Янчев Димитров",
    "grade": 15,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетни 2021": 9.0,
      "Есенни 2019": 3.75
    },
    "competition_grades": {
      "Пролетни 2021": 5.0,
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Павел Иванов Панев",
    "grade": 15,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 23.0,
      "Есенни 2018": 15.0
    },
    "competition_grades": {
      "Есенни 2019": 4.0,
      "Есенни 2018": 2.0
    }
  },
  {
    "name": "Михаил Владимиров Пчелински",
    "grade": 15,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 9.0
    },
    "competition_grades": {
      "Пролетни 2021": 5.0
    }
  },
  {
    "name": "Теодор Живков Танков",
    "grade": 15,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 9.0
    },
    "competition_grades": {
      "Пролетни 2021": 5.0
    }
  },
  {
    "name": "Мартин Евгениев Генчев",
    "grade": 15,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 14.0,
      "Пролетни 2019": 20.0,
      "Пролетни 2017": 12.5,
      "Есенни 2016": 20.5
    },
    "competition_grades": {
      "Есенни 2019": 4.0,
      "Пролетни 2019": 3.0,
      "Пролетни 2017": 1.0,
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Борислав Кирилов Кирилов",
    "grade": 15,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Есенни 2018": 11.5,
      "Олимпиада 2018": 24.25,
      "Пролетни 2018": 23.5,
      "Есенни 2017": 27.0,
      "Олимпиада 2017": 26.0,
      "Есенни 2016": 17.0
    },
    "competition_grades": {
      "Есенни 2018": 3.0,
      "Олимпиада 2018": 2.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Олимпиада 2017": 1.0,
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Ивайло Антонов Иванов",
    "grade": 15,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 18.75,
      "Есенни 2018": 15.0
    },
    "competition_grades": {
      "Есенни 2019": 4.0,
      "Есенни 2018": 2.0
    }
  },
  {
    "name": "Елица Ивайлова Василева",
    "grade": 15,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 9.75,
      "Есенни 2018": 16.0,
      "Олимпиада 2017": 26.5,
      "Пролетни 2017": 18.0,
      "Есенни 2016": 16.5
    },
    "competition_grades": {
      "Есенни 2019": 4.0,
      "Есенни 2018": 2.0,
      "Олимпиада 2017": 1.0,
      "Пролетни 2017": 1.0,
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Румен Миленов Михов",
    "grade": 15,
    "school": "ПМГ \"Ат. Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Есенни 2019": 22.5
    },
    "competition_grades": {
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Павел Атанасов Николов",
    "grade": 15,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2019": 19.75,
      "Олимпиада 2017": 13.0
    },
    "competition_grades": {
      "Есенни 2019": 4.0,
      "Олимпиада 2017": 1.0
    }
  },
  {
    "name": "Яна Цветанова Василева",
    "grade": 15,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Пролетни 2021": 3.0,
      "Есенни 2019": 12.0
    },
    "competition_grades": {
      "Пролетни 2021": 5.0,
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Георги Димитров Господинов",
    "grade": 15,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Есенни 2019": 13.75,
      "Есенни 2018": 15.0
    },
    "competition_grades": {
      "Есенни 2019": 4.0,
      "Есенни 2018": 2.0
    }
  },
  {
    "name": "Александър Костадинов Апостолов",
    "grade": 15,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетни 2021": 6.0
    },
    "competition_grades": {
      "Пролетни 2021": 5.0
    }
  },
  {
    "name": "Любомир Мартинов Костов",
    "grade": 15,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2021": 6.0
    },
    "competition_grades": {
      "Пролетни 2021": 5.0
    }
  },
  {
    "name": "Юлия Даринова Моралийска",
    "grade": 15,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 11.5,
      "Есенни 2018": 13.0
    },
    "competition_grades": {
      "Есенни 2019": 4.0,
      "Есенни 2018": 2.0
    }
  },
  {
    "name": "Жанета Стефанова Спасова",
    "grade": 15,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2021": 4.0,
      "Есенни 2019": 3.0
    },
    "competition_grades": {
      "Пролетни 2021": 5.0,
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Александър Радославов Станолов",
    "grade": 15,
    "school": "91 НЕГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 13.25,
      "Олимпиада 2017": 13.0
    },
    "competition_grades": {
      "Есенни 2019": 4.0,
      "Олимпиада 2017": 1.0
    }
  },
  {
    "name": "Антон Радостинов Тенев",
    "grade": 15,
    "school": "Първа ЕГ",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 14.75
    },
    "competition_grades": {
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Костадин Методиев Русалов",
    "grade": 15,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2019": 8.5,
      "Есенни 2018": 13.5
    },
    "competition_grades": {
      "Есенни 2019": 4.0,
      "Есенни 2018": 2.0
    }
  },
  {
    "name": "Гергана Георгиева Пеева",
    "grade": 15,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2019": 12.75
    },
    "competition_grades": {
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Даниела Ивайлова Николова",
    "grade": 15,
    "school": "АЕГ \"Гео Милев\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2021": 1.5,
      "Есенни 2019": 8.0
    },
    "competition_grades": {
      "Пролетни 2021": 5.0,
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Красимир Анатолиев Ронков",
    "grade": 15,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 4.0
    },
    "competition_grades": {
      "Пролетни 2021": 5.0
    }
  },
  {
    "name": "Галин Ивелинов Стефанов",
    "grade": 15,
    "school": "Първа ЕГ",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 12.0
    },
    "competition_grades": {
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Юлиана Миленова Георгиева",
    "grade": 15,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 9.5,
      "Пролетни 2017": 8.25,
      "Есенни 2016": 16.5
    },
    "competition_grades": {
      "Есенни 2019": 4.0,
      "Пролетни 2017": 1.0,
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Габриела Боркова Димитрова",
    "grade": 15,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 8.5,
      "Пролетни 2017": 15.0,
      "Есенни 2016": 20.0
    },
    "competition_grades": {
      "Есенни 2019": 4.0,
      "Пролетни 2017": 1.0,
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Мария Димитрова Нанева",
    "grade": 15,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2019": 11.25
    },
    "competition_grades": {
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Мартин Пламенов Ангелов",
    "grade": 15,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2021": 3.0,
      "Пролетни 2017": 15.25
    },
    "competition_grades": {
      "Пролетни 2021": 5.0,
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Максим Николаев Йорданов",
    "grade": 15,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенни 2019": 11.0
    },
    "competition_grades": {
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Мирослав Димитров Атанасов",
    "grade": 15,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 10.25
    },
    "competition_grades": {
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Владимир Добромиров Дончев",
    "grade": 15,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2019": 9.75
    },
    "competition_grades": {
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Десислав Здравков Адамов",
    "grade": 15,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2019": 9.75
    },
    "competition_grades": {
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Михаил Данаилов Тонев",
    "grade": 15,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенни 2019": 9.75
    },
    "competition_grades": {
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Калоян Христов Янчев",
    "grade": 15,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2018": 14.5,
      "Пролетни 2017": 17.75,
      "Есенни 2016": 23.0
    },
    "competition_grades": {
      "Есенни 2018": 2.0,
      "Пролетни 2017": 1.0,
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Веселина Николаева Иванова",
    "grade": 15,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2018": 17.5,
      "Пролетни 2017": 20.0
    },
    "competition_grades": {
      "Есенни 2018": 2.0,
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Мария Иванова Митева",
    "grade": 15,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2018": 14.5,
      "Пролетни 2017": 14.75,
      "Есенни 2016": 18.5
    },
    "competition_grades": {
      "Есенни 2018": 2.0,
      "Пролетни 2017": 1.0,
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Мартин Петров Маринков",
    "grade": 15,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 6.5,
      "Пролетни 2017": 16.5,
      "Есенни 2016": 11.0
    },
    "competition_grades": {
      "Есенни 2019": 4.0,
      "Пролетни 2017": 1.0,
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Александър Йоанос Пагу",
    "grade": 15,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 8.5
    },
    "competition_grades": {
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Лазар Румянов Гърбузанов",
    "grade": 15,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Есенни 2019": 7.75
    },
    "competition_grades": {
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Анастасия Александрова Маджарова",
    "grade": 15,
    "school": "СУ \"Васил Левски\"",
    "city": "Крумовград",
    "competitions": {
      "Олимпиада 2019": 10.0
    },
    "competition_grades": {
      "Олимпиада 2019": 2.0
    }
  },
  {
    "name": "Гриша Ивов Лилов",
    "grade": 15,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2018": 13.5,
      "Пролетни 2017": 17.75
    },
    "competition_grades": {
      "Есенни 2018": 2.0,
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Мина Йвайло Йорданова",
    "grade": 15,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 7.0
    },
    "competition_grades": {
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Малин Иванов Шарланджиев",
    "grade": 15,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Есенни 2018": 13.0,
      "Пролетни 2017": 13.75
    },
    "competition_grades": {
      "Есенни 2018": 2.0,
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Ивелина Христова Христова",
    "grade": 15,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Есенни 2018": 16.0
    },
    "competition_grades": {
      "Есенни 2018": 2.0
    }
  },
  {
    "name": "Ириней Георгиев Георгиев",
    "grade": 15,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2019": 9.0
    },
    "competition_grades": {
      "Олимпиада 2019": 3.0
    }
  },
  {
    "name": "Катя Иванова Николова",
    "grade": 15,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2018": 15.0
    },
    "competition_grades": {
      "Есенни 2018": 2.0
    }
  },
  {
    "name": "Павлета Радославова Попова",
    "grade": 15,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2018": 14.0
    },
    "competition_grades": {
      "Есенни 2018": 2.0
    }
  },
  {
    "name": "Самуил Радославов Илиев",
    "grade": 15,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2018": 13.5
    },
    "competition_grades": {
      "Есенни 2018": 2.0
    }
  },
  {
    "name": "Елина Дончева Дончева",
    "grade": 15,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенни 2018": 13.0
    },
    "competition_grades": {
      "Есенни 2018": 2.0
    }
  },
  {
    "name": "Радостин Бисеров Хаджимарков",
    "grade": 15,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2017": 12.5,
      "Пролетни 2017": 17.5,
      "Есенни 2016": 21.25
    },
    "competition_grades": {
      "Олимпиада 2017": 1.0,
      "Пролетни 2017": 1.0,
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Десислава Георгиева Ганчева",
    "grade": 15,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенни 2019": 5.0
    },
    "competition_grades": {
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Иван Василев Василев",
    "grade": 15,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2022": 0.5,
      "Есенни 2019": 1.0
    },
    "competition_grades": {
      "Пролетни 2022": 6.0,
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Никол Тихомирова Колева",
    "grade": 15,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2019": 4.0
    },
    "competition_grades": {
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Тодор Димитров Стоянов",
    "grade": 15,
    "school": "АЕГ \"Гео Милев\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2019": 3.75
    },
    "competition_grades": {
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Пресиан Миленов Атанасов",
    "grade": 15,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 3.25
    },
    "competition_grades": {
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Томислав Атанасов Колев",
    "grade": 15,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2017": 15.0,
      "Есенни 2016": 23.0
    },
    "competition_grades": {
      "Пролетни 2017": 1.0,
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Боян Николов Костадинов",
    "grade": 15,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Пролетни 2021": 1.0
    },
    "competition_grades": {
      "Пролетни 2021": 5.0
    }
  },
  {
    "name": "Михаил Ненков Ненков",
    "grade": 15,
    "school": "АЕГ \"Гео Милев\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2019": 3.0
    },
    "competition_grades": {
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Виктор Евгениев Алексиев",
    "grade": 15,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2017": 11.25,
      "Есенни 2016": 24.5
    },
    "competition_grades": {
      "Пролетни 2017": 1.0,
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Божидар Павлов Бонев",
    "grade": 15,
    "school": "119 СУ \"Акад. Михаил Арнаудов\"",
    "city": "София",
    "competitions": {
      "Олимпиада 2017": 21.5
    },
    "competition_grades": {
      "Олимпиада 2017": 1.0
    }
  },
  {
    "name": "Кирил Георгиев Ябукарски",
    "grade": 15,
    "school": "ПМГ \"Проф. Ем. Иванов\"",
    "city": "Кюстендил",
    "competitions": {
      "Пролетни 2017": 14.75,
      "Есенни 2016": 18.5
    },
    "competition_grades": {
      "Пролетни 2017": 1.0,
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Антоний Добринов Цанков",
    "grade": 15,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2017": 14.5,
      "Есенни 2016": 17.0
    },
    "competition_grades": {
      "Пролетни 2017": 1.0,
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Аня Андреева Сотирова",
    "grade": 15,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Олимпиада 2017": 10.0,
      "Есенни 2016": 14.5
    },
    "competition_grades": {
      "Олимпиада 2017": 1.0,
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Калоян Калинов Трифонов",
    "grade": 15,
    "school": "ППМГ \"Екзарх Антим I\"",
    "city": "Видин",
    "competitions": {
      "Олимпиада 2017": 15.5
    },
    "competition_grades": {
      "Олимпиада 2017": 1.0
    }
  },
  {
    "name": "Мартин Йорданов Дамянов",
    "grade": 15,
    "school": "104 ОУ",
    "city": "София",
    "competitions": {
      "Пролетни 2017": 8.25,
      "Есенни 2016": 16.5
    },
    "competition_grades": {
      "Пролетни 2017": 1.0,
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Волен Николов Чилов",
    "grade": 15,
    "school": "104 ОУ",
    "city": "София",
    "competitions": {
      "Пролетни 2017": 8.5,
      "Есенни 2016": 15.0
    },
    "competition_grades": {
      "Пролетни 2017": 1.0,
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Калина Ивайлова Лалкова",
    "grade": 15,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Олимпиада 2017": 14.5
    },
    "competition_grades": {
      "Олимпиада 2017": 1.0
    }
  },
  {
    "name": "Силвия Тодорова Гелина",
    "grade": 15,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Олимпиада 2017": 14.5
    },
    "competition_grades": {
      "Олимпиада 2017": 1.0
    }
  },
  {
    "name": "Атанас Николаев Митрев",
    "grade": 15,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2017": 19.25
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Марина Петрова Пупова",
    "grade": 15,
    "school": "ОУ\"М. Горки\"",
    "city": "гр. Левски",
    "competitions": {
      "Есенни 2016": 23.0
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Виктория Георгиева Генова",
    "grade": 15,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2016": 21.5
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Стефани Венциславова Боянова",
    "grade": 15,
    "school": "ППМГ \"Екзарх Антим I\"",
    "city": "Видин",
    "competitions": {
      "Есенни 2016": 21.5
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Ивелина Добромирова Радковска",
    "grade": 15,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенни 2017": 9.0
    },
    "competition_grades": {
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Ричард Николаев Николов",
    "grade": 15,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2017": 16.0
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Вероника Ивайлова Ченчева",
    "grade": 15,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2017": 15.5
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Георги Великов Василев",
    "grade": 15,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2016": 20.5
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Десислава Цанкова Христова",
    "grade": 15,
    "school": "ППМГ \"Екзарх Антим I\"",
    "city": "Видин",
    "competitions": {
      "Есенни 2016": 20.0
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Елизабет Димчева Угринова",
    "grade": 15,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Есенни 2017": 4.0,
      "Пролетни 2017": 7.75
    },
    "competition_grades": {
      "Есенни 2017": 2.0,
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Лъчезар Михайлов Жеков",
    "grade": 15,
    "school": "ПМГ \"Акад. Боян Петканчин\"",
    "city": "Хасково",
    "competitions": {
      "Пролетни 2017": 13.5
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Тихомир Ивайлов Кочилов",
    "grade": 15,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2017": 13.5
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Игор Костадинов Симеонов",
    "grade": 15,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2017": 9.5
    },
    "competition_grades": {
      "Олимпиада 2017": 1.0
    }
  },
  {
    "name": "Иван Минчев Вътев",
    "grade": 15,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2017": 12.25
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Богомил Бойков Стоянов",
    "grade": 15,
    "school": "104 ОУ",
    "city": "София",
    "competitions": {
      "Есенни 2016": 16.0
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Весела Веселинова Георгиева",
    "grade": 15,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2017": 12.0
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Стоил Тодоров Иванов",
    "grade": 15,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2016": 16.0
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Васил Стойчев Стойков",
    "grade": 15,
    "school": "2 ОУ \"Христо Смирненски\"",
    "city": "Сандански",
    "competitions": {
      "Есенни 2016": 15.0
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Павел Желев Желев",
    "grade": 15,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2016": 14.0
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Гергана Павлова Драева",
    "grade": 15,
    "school": "ОУ \"Хр.Ботев\"",
    "city": "Велинград",
    "competitions": {
      "Есенни 2016": 13.5
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Петър Петров Настев",
    "grade": 15,
    "school": "104 ОУ",
    "city": "София",
    "competitions": {
      "Есенни 2016": 13.5
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Николай Владимиров Йончев",
    "grade": 15,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2019": 1.0
    },
    "competition_grades": {
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Луиза Людмилова Кръстанова",
    "grade": 15,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Есенни 2017": 3.5,
      "Пролетни 2017": 3.75
    },
    "competition_grades": {
      "Есенни 2017": 2.0,
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Богдан Симеонов Христов",
    "grade": 15,
    "school": "104 ОУ",
    "city": "София",
    "competitions": {
      "Есенни 2016": 13.0
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Хари Христов Христов",
    "grade": 15,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2017": 9.75
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Мирослав Данаилов Поманов",
    "grade": 15,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Есенни 2017": 1.0,
      "Пролетни 2017": 7.75
    },
    "competition_grades": {
      "Есенни 2017": 2.0,
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Емили Хари Найденова",
    "grade": 15,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2017": 9.5
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Антон Светославов Антонов",
    "grade": 15,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2016": 12.5
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Атанас Христов Христов",
    "grade": 15,
    "school": "ОУ\"М. Горки\"",
    "city": "гр. Левски",
    "competitions": {
      "Есенни 2016": 12.0
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Петър Ангелов Захариев",
    "grade": 15,
    "school": "СУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2017": 9.0
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Георги Христов Димков",
    "grade": 15,
    "school": "33 ОУ \"СанктПетербург\"",
    "city": "София",
    "competitions": {
      "Пролетни 2017": 8.0
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Димитър Иванов Тодоров",
    "grade": 15,
    "school": "ПМГ \"Акад. Боян Петканчин\"",
    "city": "Хасково",
    "competitions": {
      "Пролетни 2017": 8.0
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Васил Данаилов Василев",
    "grade": 15,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетни 2017": 7.5
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Елена Анн Тодорова",
    "grade": 15,
    "school": "33 ОУ \"СанктПетербург\"",
    "city": "София",
    "competitions": {
      "Пролетни 2017": 7.5
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Десислава Живкова Атанасова",
    "grade": 15,
    "school": "ПГТ \"Проф. д-р Асен Златаров\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 0.75
    },
    "competition_grades": {
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Гани Темур",
    "grade": 15,
    "school": "ПМГ \"Акад. Боян Петканчин\"",
    "city": "Хасково",
    "competitions": {
      "Пролетни 2017": 6.75
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Георги Димов Гочев",
    "grade": 15,
    "school": "ПМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2016": 9.0
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Диана Георгиева Велинова",
    "grade": 15,
    "school": "ПМГ \"Проф. Ем. Иванов\"",
    "city": "Кюстендил",
    "competitions": {
      "Пролетни 2017": 6.75
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Спас Атанасов Терзиев",
    "grade": 15,
    "school": "СУ \"Св. КлиментОхридски\"",
    "city": "Ракитово",
    "competitions": {
      "Пролетни 2017": 6.75
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Патрисия Сотирова Наумова",
    "grade": 15,
    "school": "ОУ \"Хр.Ботев\"",
    "city": "Велинград",
    "competitions": {
      "Есенни 2016": 8.5
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Георги Галев Томов",
    "grade": 15,
    "school": "2 ОУ \"Христо Смирненски\"",
    "city": "Сандански",
    "competitions": {
      "Есенни 2016": 8.0
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Златин Тонев Йовев",
    "grade": 15,
    "school": "ПМГ \"Проф. Ем. Иванов\"",
    "city": "Кюстендил",
    "competitions": {
      "Есенни 2016": 8.0
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Елена Ангелова Янушева",
    "grade": 15,
    "school": "СУ \"Св. КлиментОхридски\"",
    "city": "Ракитово",
    "competitions": {
      "Пролетни 2017": 5.75
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Цветелина Георгиева Попова",
    "grade": 15,
    "school": "СУ \"Св. КлиментОхридски\"",
    "city": "Ракитово",
    "competitions": {
      "Пролетни 2017": 5.75
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Катрин Жан Георгиева",
    "grade": 15,
    "school": "33 ОУ \"СанктПетербург\"",
    "city": "София",
    "competitions": {
      "Пролетни 2017": 5.5
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Валери Станимиров Мирчевски",
    "grade": 15,
    "school": "ОУ \"Хр.Ботев\"",
    "city": "Велинград",
    "competitions": {
      "Есенни 2016": 7.0
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Виктор Георгиев Навяков",
    "grade": 15,
    "school": "ОУ \"Хр.Ботев\"",
    "city": "Велинград",
    "competitions": {
      "Есенни 2016": 7.0
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Диляна Бисерова Алексова",
    "grade": 15,
    "school": "ОУ\"М. Горки\"",
    "city": "гр. Левски",
    "competitions": {
      "Есенни 2016": 7.0
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Данаил Димитров Георгиев",
    "grade": 15,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2017": 5.0
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Стелиян Стелиянов Тодоров",
    "grade": 15,
    "school": "ПМГ \"Проф. Ем. Иванов\"",
    "city": "Кюстендил",
    "competitions": {
      "Пролетни 2017": 5.0
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Весела Валентинова Бонева",
    "grade": 15,
    "school": "ПГТ \"Проф. д-р Асен Златаров\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 0.5
    },
    "competition_grades": {
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Алекс Борисов Янчов",
    "grade": 15,
    "school": "НПГПТО \"М.В.Ломоносов\"",
    "city": "София",
    "competitions": {
      "Есенни 2017": 2.5
    },
    "competition_grades": {
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Магдалена Цветанова Цочева",
    "grade": 15,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2017": 4.25
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Ирина Вескова Кехайова",
    "grade": 15,
    "school": "СУ \"Св. КлиментОхридски\"",
    "city": "Ракитово",
    "competitions": {
      "Пролетни 2017": 3.5
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Васко Димитров Похлупков",
    "grade": 15,
    "school": "СУ \"Кирил и Методий\"",
    "city": "Велинград",
    "competitions": {
      "Есенни 2016": 4.5
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Диляна Димитрова Спасова",
    "grade": 15,
    "school": "СУ \"Иван Вазов\"",
    "city": "Вършец",
    "competitions": {
      "Пролетни 2017": 3.25
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Димана Станиславова Божкова",
    "grade": 15,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2017": 3.25
    },
    "competition_grades": {
      "Пролетни 2017": 1.0
    }
  },
  {
    "name": "Ралица Григорова Кримска",
    "grade": 15,
    "school": "ПГТ \"Проф. д-р Асен Златаров\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 0.25
    },
    "competition_grades": {
      "Есенни 2019": 4.0
    }
  },
  {
    "name": "Калин Тодоров Тодоров",
    "grade": 15,
    "school": "ОУ \"Неофит Рилски\"",
    "city": "Велинград",
    "competitions": {
      "Есенни 2016": 3.0
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Любомир Любомиров Германов",
    "grade": 15,
    "school": "ОУ \"Неофит Рилски\"",
    "city": "Велинград",
    "competitions": {
      "Есенни 2016": 3.0
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Тодор Александров Керин",
    "grade": 15,
    "school": "ОУ \"Хр.Ботев\"",
    "city": "Велинград",
    "competitions": {
      "Есенни 2016": 3.0
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Севги Метин Осман",
    "grade": 15,
    "school": "ОУ \"Св. св. Кирил и Методий\"",
    "city": "Кърджали",
    "competitions": {
      "Олимпиада 2017": 1.0
    },
    "competition_grades": {
      "Олимпиада 2017": 1.0
    }
  },
  {
    "name": "Юри Янков Чулев",
    "grade": 15,
    "school": "ОУ \"Неофит Рилски\"",
    "city": "Велинград",
    "competitions": {
      "Есенни 2016": 1.0
    },
    "competition_grades": {
      "Есенни 2016": 1.0
    }
  },
  {
    "name": "Васил Николов Николов",
    "grade": 16,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 87.65,
      "Пролетни 2021": 26.0,
      "2  кръг 2021": 30.0,
      "Олимпиада 2020": 57.5,
      "2 кръг 2020": 30.0,
      "Есенни 2019": 17.0,
      "Олимпиада 2019": 71.75,
      "Пролетни 2019": 26.1,
      "Есенни 2018": 25.0,
      "Олимпиада 2018": 29.0,
      "Пролетни 2018": 7.5,
      "Есенни 2017": 26.75,
      "Олимпиада 2017": 17.4,
      "Пролетни 2017": 20.25,
      "Есенни 2016": 29.5,
      "Олимпиада 2016": 22.25,
      "Пролетни 2016": 23.5,
      "Есенни 2015": 13.5
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 7.0,
      "2  кръг 2021": 6.0,
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 6.0,
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 6.0,
      "Есенни 2018": 6.0,
      "Олимпиада 2018": 3.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Олимпиада 2017": 2.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Олимпиада 2016": 1.0,
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Александър Асенов Илиев",
    "grade": 16,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 83.0,
      "Пролетни 2021": 24.0,
      "2  кръг 2021": 30.0,
      "Олимпиада 2020": 48.4,
      "2 кръг 2020": 29.5,
      "Есенни 2019": 13.5,
      "Олимпиада 2019": 29.0,
      "Пролетни 2019": 29.5,
      "Есенни 2018": 24.25,
      "Олимпиада 2018": 23.75,
      "Пролетни 2018": 23.5,
      "Олимпиада 2016": 9.75
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 7.0,
      "2  кръг 2021": 6.0,
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 6.0,
      "Олимпиада 2019": 3.0,
      "Пролетни 2019": 3.0,
      "Есенни 2018": 3.0,
      "Олимпиада 2018": 2.0,
      "Пролетни 2018": 2.0,
      "Олимпиада 2016": 1.0
    }
  },
  {
    "name": "Виктор Владимиров Василев",
    "grade": 16,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 80.6,
      "Пролетни 2021": 19.1,
      "2  кръг 2021": 27.0,
      "Олимпиада 2020": 37.0,
      "2 кръг 2020": 29.0,
      "Есенни 2019": 6.75,
      "Олимпиада 2019": 29.25,
      "Есенни 2018": 22.0,
      "Пролетни 2018": 21.75,
      "Есенни 2017": 23.5
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 7.0,
      "2  кръг 2021": 6.0,
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 6.0,
      "Олимпиада 2019": 3.0,
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Веселин Александров Димов",
    "grade": 16,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Олимпиада 2021": 81.25,
      "Пролетни 2021": 28.0,
      "2  кръг 2021": 26.0,
      "Олимпиада 2020": 27.5,
      "2 кръг 2020": 28.5,
      "Есенни 2019": 15.5,
      "Олимпиада 2019": 23.5
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 6.0,
      "2  кръг 2021": 6.0,
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Олимпиада 2019": 3.0
    }
  },
  {
    "name": "Теодор Павлов Костов",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Олимпиада 2021": 60.95,
      "Пролетни 2021": 25.5,
      "2  кръг 2021": 23.0,
      "Олимпиада 2020": 33.5,
      "2 кръг 2020": 24.5,
      "Есенни 2019": 9.75,
      "Олимпиада 2019": 23.0,
      "Пролетни 2019": 30.0,
      "Есенни 2018": 19.0,
      "Олимпиада 2018": 22.5,
      "Пролетни 2018": 24.75,
      "Есенни 2017": 22.5
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 6.0,
      "2  кръг 2021": 6.0,
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Олимпиада 2019": 3.0,
      "Пролетни 2019": 3.0,
      "Есенни 2018": 3.0,
      "Олимпиада 2018": 2.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Теодор Свиленов Маслянков",
    "grade": 16,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 79.3,
      "Пролетни 2021": 11.4,
      "2  кръг 2021": 25.0,
      "Есенни 2019": 18.88,
      "Олимпиада 2019": 30.0,
      "Пролетни 2019": 21.0,
      "Есенни 2018": 15.5,
      "Олимпиада 2018": 17.25,
      "Пролетни 2018": 16.5
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 7.0,
      "2  кръг 2021": 6.0,
      "Есенни 2019": 5.0,
      "Олимпиада 2019": 3.0,
      "Пролетни 2019": 3.0,
      "Есенни 2018": 3.0,
      "Олимпиада 2018": 2.0,
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Мартин Владимиров Василев",
    "grade": 16,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 34.5,
      "2  кръг 2021": 28.0,
      "Олимпиада 2020": 39.3,
      "2 кръг 2020": 29.5,
      "Есенни 2019": 13.25,
      "Олимпиада 2019": 28.5,
      "Пролетни 2019": 27.0,
      "Есенни 2018": 18.5,
      "Олимпиада 2018": 21.25,
      "Пролетни 2018": 26.5,
      "Есенни 2017": 29.5,
      "Олимпиада 2016": 23.0,
      "Пролетни 2016": 22.5
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "2  кръг 2021": 6.0,
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 6.0,
      "Олимпиада 2019": 3.0,
      "Пролетни 2019": 3.0,
      "Есенни 2018": 3.0,
      "Олимпиада 2018": 2.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Олимпиада 2016": 1.0,
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Борис Георгиев Горанов",
    "grade": 16,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 42.2,
      "2  кръг 2021": 20.0,
      "Есенни 2019": 18.5,
      "Пролетни 2019": 25.0
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "2  кръг 2021": 6.0,
      "Есенни 2019": 5.0,
      "Пролетни 2019": 3.0
    }
  },
  {
    "name": "Трифон Божидаров Ефтов",
    "grade": 16,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 6.5,
      "Пролетни 2021": 25.0,
      "2  кръг 2021": 20.5,
      "Олимпиада 2020": 19.0,
      "2 кръг 2020": 27.5,
      "Есенни 2019": 14.25,
      "Есенни 2018": 17.0,
      "Пролетни 2018": 15.75,
      "Есенни 2017": 9.0,
      "Олимпиада 2016": 16.0
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 6.0,
      "2  кръг 2021": 6.0,
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Олимпиада 2016": 1.0
    }
  },
  {
    "name": "Руси Ивайлов Шишманов",
    "grade": 16,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2021": 6.0,
      "Пролетни 2021": 23.0,
      "2  кръг 2021": 20.0,
      "2 кръг 2020": 29.5,
      "Есенни 2019": 4.0,
      "Олимпиада 2019": 16.5,
      "Пролетни 2019": 26.0,
      "Есенни 2018": 22.0,
      "Пролетни 2018": 21.5,
      "Есенни 2017": 19.0
    },
    "competition_grades": {
      "Олимпиада 2021": 5.0,
      "Пролетни 2021": 6.0,
      "2  кръг 2021": 6.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 6.0,
      "Олимпиада 2019": 3.0,
      "Пролетни 2019": 3.0,
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Дилян Тодоров Павлов",
    "grade": 16,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2021": 22.5,
      "Олимпиада 2020": 25.5,
      "2 кръг 2020": 27.5,
      "Есенни 2019": 13.88,
      "Олимпиада 2019": 17.5,
      "Пролетни 2019": 24.5,
      "Есенни 2018": 24.0,
      "Олимпиада 2018": 20.75,
      "Пролетни 2018": 19.25,
      "Есенни 2017": 25.0,
      "Есенни 2016": 29.25,
      "Олимпиада 2016": 17.75
    },
    "competition_grades": {
      "Пролетни 2021": 6.0,
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Олимпиада 2019": 3.0,
      "Пролетни 2019": 3.0,
      "Есенни 2018": 3.0,
      "Олимпиада 2018": 2.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Олимпиада 2016": 1.0
    }
  },
  {
    "name": "Матю Петков Машков",
    "grade": 16,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Олимпиада 2020": 37.0,
      "2 кръг 2020": 29.0,
      "Есенни 2019": 25.5,
      "Олимпиада 2019": 23.5,
      "Есенни 2018": 25.0,
      "Олимпиада 2018": 25.75,
      "Пролетни 2018": 28.5,
      "Есенни 2017": 27.5,
      "Олимпиада 2016": 27.0,
      "Пролетни 2016": 26.5,
      "Есенни 2015": 18.5
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Олимпиада 2019": 3.0,
      "Есенни 2018": 3.0,
      "Олимпиада 2018": 2.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Олимпиада 2016": 1.0,
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Ангел Сашов Митков",
    "grade": 16,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетни 2021": 17.0,
      "Олимпиада 2020": 26.0,
      "2 кръг 2020": 28.0,
      "Есенни 2019": 12.63,
      "Пролетни 2019": 20.0
    },
    "competition_grades": {
      "Пролетни 2021": 6.0,
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Пролетни 2019": 4.0
    }
  },
  {
    "name": "Панайот Максимов Чомаков",
    "grade": 16,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетни 2021": 17.2,
      "Олимпиада 2020": 15.5,
      "2 кръг 2020": 25.0,
      "Есенни 2019": 12.25,
      "Олимпиада 2019": 20.0,
      "Есенни 2018": 9.5,
      "Пролетни 2018": 13.5,
      "Есенни 2017": 11.5,
      "Олимпиада 2016": 13.5
    },
    "competition_grades": {
      "Пролетни 2021": 6.0,
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Олимпиада 2019": 3.0,
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Олимпиада 2016": 1.0
    }
  },
  {
    "name": "Тодор Иванов Кюркчиев",
    "grade": 16,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "2 кръг 2020": 30.0,
      "Есенни 2019": 19.25,
      "Олимпиада 2019": 29.5,
      "Пролетни 2019": 28.5,
      "Есенни 2018": 24.5,
      "Олимпиада 2018": 23.25,
      "Пролетни 2018": 23.75,
      "Есенни 2017": 22.0,
      "Олимпиада 2017": 21.9,
      "Пролетни 2017": 29.5,
      "Есенни 2016": 28.0,
      "Олимпиада 2016": 21.75,
      "Пролетни 2016": 24.75,
      "Есенни 2015": 25.05
    },
    "competition_grades": {
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Олимпиада 2019": 3.0,
      "Пролетни 2019": 3.0,
      "Есенни 2018": 3.0,
      "Олимпиада 2018": 2.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Олимпиада 2017": 2.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Олимпиада 2016": 1.0,
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Георги Илиянов Иванов",
    "grade": 16,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 28.0,
      "2 кръг 2020": 30.0,
      "Есенни 2019": 13.25,
      "Пролетни 2019": 8.8,
      "Есенни 2018": 12.5,
      "Олимпиада 2018": 20.0,
      "Пролетни 2018": 26.5,
      "Есенни 2017": 26.0,
      "Олимпиада 2016": 26.75
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 6.0,
      "Пролетни 2019": 6.0,
      "Есенни 2018": 6.0,
      "Олимпиада 2018": 2.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Олимпиада 2016": 1.0
    }
  },
  {
    "name": "Женя Йорданова Янчева",
    "grade": 16,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2020": 16.0,
      "2 кръг 2020": 28.0,
      "Есенни 2019": 18.0,
      "Пролетни 2019": 22.0,
      "Есенни 2018": 16.0,
      "Олимпиада 2018": 20.0,
      "Пролетни 2018": 29.0,
      "Есенни 2017": 22.5,
      "Олимпиада 2016": 22.25,
      "Пролетни 2016": 30.0,
      "Есенни 2015": 24.5
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Пролетни 2019": 3.0,
      "Есенни 2018": 3.0,
      "Олимпиада 2018": 2.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Олимпиада 2016": 1.0,
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Людмил Даниелов Кузманов",
    "grade": 16,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 22.0,
      "2 кръг 2020": 28.5,
      "Есенни 2019": 11.63,
      "Олимпиада 2019": 19.5,
      "Есенни 2018": 12.0,
      "Есенни 2017": 22.0,
      "Олимпиада 2016": 15.0
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Олимпиада 2019": 3.0,
      "Есенни 2018": 3.0,
      "Есенни 2017": 2.0,
      "Олимпиада 2016": 1.0
    }
  },
  {
    "name": "Стилиян Цветанов Иванов",
    "grade": 16,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Олимпиада 2020": 23.3,
      "2 кръг 2020": 27.5,
      "Есенни 2019": 13.0,
      "Пролетни 2019": 16.0,
      "Есенни 2018": 6.5,
      "Пролетни 2018": 20.25,
      "Есенни 2017": 21.0,
      "Пролетни 2016": 26.5
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Александър Ивайлов Йовчев",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2021": 21.0,
      "Есенни 2019": 13.75,
      "Пролетни 2019": 20.0,
      "Есенни 2018": 21.5,
      "Пролетни 2018": 21.0,
      "Есенни 2017": 18.5,
      "Олимпиада 2016": 21.5,
      "Пролетни 2016": 13.0
    },
    "competition_grades": {
      "Пролетни 2021": 6.0,
      "Есенни 2019": 5.0,
      "Пролетни 2019": 3.0,
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Олимпиада 2016": 1.0,
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Денислав Ивелинов Бончев",
    "grade": 16,
    "school": "ЧПГ \"АК-Аркус\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2021": 20.5,
      "Олимпиада 2020": 6.2,
      "2 кръг 2020": 25.0
    },
    "competition_grades": {
      "Пролетни 2021": 6.0,
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0
    }
  },
  {
    "name": "Йоан Найденов Найденов",
    "grade": 16,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 27.3,
      "2 кръг 2020": 24.0,
      "Есенни 2018": 20.0,
      "Олимпиада 2018": 18.25,
      "Пролетни 2018": 24.75,
      "Есенни 2017": 28.5,
      "Олимпиада 2016": 25.25,
      "Пролетни 2016": 24.0
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2018": 3.0,
      "Олимпиада 2018": 2.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Олимпиада 2016": 1.0,
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Калоян Тодоров Фачиков",
    "grade": 16,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 17.0,
      "2 кръг 2020": 26.0,
      "Есенни 2019": 11.5,
      "Олимпиада 2019": 23.5,
      "Пролетни 2019": 22.5
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Олимпиада 2019": 3.0,
      "Пролетни 2019": 3.0
    }
  },
  {
    "name": "Вихрен Мирославов Миронов",
    "grade": 16,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 21.0,
      "Есенни 2019": 14.0,
      "Пролетни 2019": 20.5,
      "Пролетни 2018": 12.25
    },
    "competition_grades": {
      "Пролетни 2021": 6.0,
      "Есенни 2019": 5.0,
      "Пролетни 2019": 3.0,
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Тихомир Тихомиров Галов",
    "grade": 16,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Пролетни 2021": 21.0,
      "Есенни 2019": 7.88,
      "Пролетни 2018": 10.0,
      "Есенни 2017": 19.0
    },
    "competition_grades": {
      "Пролетни 2021": 6.0,
      "Есенни 2019": 5.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Петър Красимиров Иванов",
    "grade": 16,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетни 2021": 17.0,
      "Есенни 2019": 9.25,
      "Есенни 2018": 15.0,
      "Пролетни 2018": 14.75,
      "Есенни 2017": 24.0
    },
    "competition_grades": {
      "Пролетни 2021": 6.0,
      "Есенни 2019": 5.0,
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Иво Станиславов Йорданов",
    "grade": 16,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 9.5,
      "2 кръг 2020": 26.0,
      "Есенни 2019": 10.75,
      "Пролетни 2018": 15.0,
      "Есенни 2017": 23.0,
      "Олимпиада 2016": 20.5
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Олимпиада 2016": 1.0
    }
  },
  {
    "name": "Драгомир Драгомиров Ганев",
    "grade": 16,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "2 кръг 2020": 27.5,
      "Есенни 2019": 8.0,
      "Пролетни 2019": 19.5,
      "Есенни 2018": 14.0,
      "Пролетни 2018": 20.5,
      "Пролетни 2016": 27.5
    },
    "competition_grades": {
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Пролетни 2019": 3.0,
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0,
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Денис Руменов Миланов",
    "grade": 16,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 12.5,
      "Есенни 2019": 12.25,
      "Есенни 2018": 13.0,
      "Олимпиада 2018": 16.5
    },
    "competition_grades": {
      "Пролетни 2021": 6.0,
      "Есенни 2019": 5.0,
      "Есенни 2018": 3.0,
      "Олимпиада 2018": 2.0
    }
  },
  {
    "name": "Никола Боянов Джунов",
    "grade": 16,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 11.5,
      "2 кръг 2020": 26.0
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0
    }
  },
  {
    "name": "Бояна Боянова Христова",
    "grade": 16,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2019": 12.5,
      "Пролетни 2019": 25.5,
      "Есенни 2018": 21.0,
      "Олимпиада 2018": 16.5,
      "Пролетни 2018": 25.0,
      "Есенни 2017": 30.0,
      "Олимпиада 2016": 20.5,
      "Пролетни 2016": 26.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2019": 3.0,
      "Есенни 2018": 3.0,
      "Олимпиада 2018": 2.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Олимпиада 2016": 1.0,
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Антон Евгениев Атанасов",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2021": 15.0
    },
    "competition_grades": {
      "Пролетни 2021": 6.0
    }
  },
  {
    "name": "Виктория Владимирова Бояджиева",
    "grade": 16,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2019": 12.13,
      "Пролетни 2019": 19.5,
      "Есенни 2018": 16.5,
      "Пролетни 2018": 22.5,
      "Есенни 2017": 22.0,
      "Олимпиада 2016": 21.0,
      "Пролетни 2016": 27.5,
      "Есенни 2015": 20.8
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2019": 3.0,
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Олимпиада 2016": 1.0,
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Димитър Николов Николов",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Олимпиада 2019": 19.0,
      "Пролетни 2019": 22.5,
      "Пролетни 2018": 22.5,
      "Есенни 2017": 27.5,
      "Пролетни 2016": 26.0
    },
    "competition_grades": {
      "Олимпиада 2019": 3.0,
      "Пролетни 2019": 3.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Иван Христов Косев",
    "grade": 16,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2019": 11.75,
      "Пролетни 2019": 21.0,
      "Есенни 2018": 14.5,
      "Пролетни 2018": 15.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2019": 3.0,
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Жаклин Александрова Катърджиева",
    "grade": 16,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2019": 14.0,
      "Есенни 2018": 13.5,
      "Пролетни 2018": 20.75,
      "Есенни 2017": 26.0,
      "Пролетни 2016": 21.0,
      "Есенни 2015": 25.5
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Константин Константинов Грозданов",
    "grade": 16,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2019": 11.5,
      "Пролетни 2019": 20.0,
      "Пролетни 2018": 21.25,
      "Есенни 2017": 13.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2019": 3.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Йоана Красимирова Пеева",
    "grade": 16,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2019": 5.0,
      "Есенни 2018": 15.5,
      "Олимпиада 2018": 25.0,
      "Пролетни 2018": 16.25,
      "Есенни 2017": 27.5,
      "Пролетни 2016": 23.8,
      "Есенни 2015": 19.8
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Есенни 2018": 3.0,
      "Олимпиада 2018": 2.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Борил Диянов Игнатов",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2021": 9.0
    },
    "competition_grades": {
      "Пролетни 2021": 6.0
    }
  },
  {
    "name": "Захари Емилов Маринов",
    "grade": 16,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2019": 22.5,
      "Олимпиада 2018": 28.0,
      "Есенни 2017": 28.0,
      "Олимпиада 2016": 26.5
    },
    "competition_grades": {
      "Пролетни 2019": 3.0,
      "Олимпиада 2018": 2.0,
      "Есенни 2017": 2.0,
      "Олимпиада 2016": 1.0
    }
  },
  {
    "name": "Кристофър Емилов Кирилов",
    "grade": 16,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2021": 8.0
    },
    "competition_grades": {
      "Пролетни 2021": 6.0
    }
  },
  {
    "name": "Марк Мартинов Киричев",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 9.5,
      "Есенни 2018": 15.0,
      "Пролетни 2018": 15.0,
      "Есенни 2017": 17.5,
      "Пролетни 2016": 23.5,
      "Есенни 2015": 29.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Камен Христов Христодулов",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2021": 7.0
    },
    "competition_grades": {
      "Пролетни 2021": 6.0
    }
  },
  {
    "name": "Павел Илиянов Върбанов",
    "grade": 16,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2018": 13.0,
      "Олимпиада 2018": 22.75,
      "Пролетни 2018": 28.0,
      "Есенни 2017": 12.0
    },
    "competition_grades": {
      "Есенни 2018": 3.0,
      "Олимпиада 2018": 2.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Къонг Виет До",
    "grade": 16,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2019": 23.5,
      "Есенни 2018": 17.5
    },
    "competition_grades": {
      "Пролетни 2019": 3.0,
      "Есенни 2018": 3.0
    }
  },
  {
    "name": "Никол Красимир Михайлова",
    "grade": 16,
    "school": "1 АЕГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 9.5,
      "Есенни 2018": 14.0,
      "Пролетни 2018": 16.5,
      "Есенни 2017": 5.5
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Боромир Чавдаров Видев",
    "grade": 16,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2018": 14.5,
      "Олимпиада 2018": 18.25,
      "Пролетни 2018": 24.5,
      "Есенни 2017": 13.5
    },
    "competition_grades": {
      "Есенни 2018": 3.0,
      "Олимпиада 2018": 2.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Радослав Чавдаров Божилов",
    "grade": 16,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Есенни 2019": 7.0,
      "Есенни 2018": 9.0,
      "Пролетни 2018": 17.25,
      "Есенни 2017": 20.0,
      "Есенни 2015": 8.75
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Нели Иванова Димитрова",
    "grade": 16,
    "school": "Езикова гимназия Акад. Л. Стоянов",
    "city": "Благоевград",
    "competitions": {
      "Есенни 2019": 7.75,
      "Есенни 2018": 19.0,
      "Есенни 2017": 16.5
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Есенни 2018": 3.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Георги Данаилов Горанов",
    "grade": 16,
    "school": "1 АЕГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 7.0,
      "Есенни 2018": 13.5,
      "Пролетни 2018": 25.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Кристиан Емилов Минчев",
    "grade": 16,
    "school": "ПМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2019": 17.0,
      "Есенни 2016": 18.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Теодор Павлов Селимов",
    "grade": 16,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2019": 7.5,
      "Есенни 2018": 10.0,
      "Пролетни 2018": 17.0,
      "Есенни 2017": 13.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Ива Ангелова Кирова",
    "grade": 16,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2019": 9.0,
      "Есенни 2018": 7.0,
      "Пролетни 2018": 18.75,
      "Есенни 2017": 9.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Симеон Атанасов Атанасов",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 9.25,
      "Пролетни 2018": 18.75,
      "Есенни 2017": 17.0,
      "Пролетни 2016": 23.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Даниел Петров Трополинов",
    "grade": 16,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Олимпиада 2019": 21.0
    },
    "competition_grades": {
      "Олимпиада 2019": 3.0
    }
  },
  {
    "name": "Илия Димитров Томов",
    "grade": 16,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2018": 12.0,
      "Пролетни 2018": 19.75,
      "Есенни 2017": 21.0,
      "Пролетни 2016": 22.0,
      "Есенни 2015": 20.0
    },
    "competition_grades": {
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Владимир Николаев Долапчиев",
    "grade": 16,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2019": 19.5,
      "Пролетни 2018": 15.5
    },
    "competition_grades": {
      "Пролетни 2019": 3.0,
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Мартина Николаева Дочева",
    "grade": 16,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2019": 9.0,
      "Пролетни 2018": 12.5,
      "Есенни 2017": 6.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Радослав Бориславов Драганов",
    "grade": 16,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2018": 19.25,
      "Есенни 2017": 27.5,
      "Пролетни 2016": 29.0,
      "Есенни 2015": 10.25
    },
    "competition_grades": {
      "Олимпиада 2018": 2.0,
      "Есенни 2017": 2.0,
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Марина Дончева Обретенова",
    "grade": 16,
    "school": "1 АЕГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 10.0,
      "Пролетни 2018": 8.5
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Кристиян Мирославов Стефанов",
    "grade": 16,
    "school": "1 АЕГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 5.25,
      "Пролетни 2018": 16.5,
      "Есенни 2017": 12.5
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Виктория Иванова Танева",
    "grade": 16,
    "school": "1 АЕГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 11.13
    },
    "competition_grades": {
      "Есенни 2019": 5.0
    }
  },
  {
    "name": "Ния Владимирова Тасева",
    "grade": 16,
    "school": "91 НЕГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 5.25,
      "Есенни 2018": 6.5,
      "Пролетни 2018": 11.25
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Александър Стоянов Недков",
    "grade": 16,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2018": 24.25,
      "Есенни 2017": 23.0
    },
    "competition_grades": {
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Галин Миленов Тотев",
    "grade": 16,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2018": 8.5,
      "Пролетни 2018": 23.5
    },
    "competition_grades": {
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Венислав Еманоелов Иванов",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2018": 18.0,
      "Есенни 2017": 14.8,
      "Олимпиада 2016": 23.5,
      "Пролетни 2016": 22.0
    },
    "competition_grades": {
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0,
      "Олимпиада 2016": 1.0,
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Карла Димитрова Димитрова",
    "grade": 16,
    "school": "91 НЕГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 9.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0
    }
  },
  {
    "name": "Виктор Илиянов Иванов",
    "grade": 16,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2018": 6.5,
      "Пролетни 2018": 15.0,
      "Есенни 2017": 11.0
    },
    "competition_grades": {
      "Есенни 2018": 3.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Виктор Иванов Иванов",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2021": 2.5
    },
    "competition_grades": {
      "Пролетни 2021": 6.0
    }
  },
  {
    "name": "Никол Бориславова Михова",
    "grade": 16,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2018": 20.25,
      "Есенни 2017": 16.0
    },
    "competition_grades": {
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Йоана Пеева Дончева",
    "grade": 16,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2019": 4.63,
      "Пролетни 2018": 12.5
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Наталия Христова Кандиларова",
    "grade": 16,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 3.25,
      "Пролетни 2018": 13.75
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Ася Христова Серафимова",
    "grade": 16,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2019": 6.5
    },
    "competition_grades": {
      "Есенни 2019": 5.0
    }
  },
  {
    "name": "Виктория Светлинова Колева",
    "grade": 16,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 3.13,
      "Пролетни 2018": 10.25,
      "Пролетни 2016": 15.0,
      "Есенни 2015": 9.25
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2018": 2.0,
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Поля Димитрова Иванова",
    "grade": 16,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 3.0,
      "Пролетни 2018": 14.25
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Мартин Емилов Гоцев",
    "grade": 16,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетни 2018": 18.5,
      "Есенни 2017": 11.0
    },
    "competition_grades": {
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Теодор Михайлов Захариев",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 5.25,
      "Есенни 2017": 5.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Владимир Илиев Кръстев",
    "grade": 16,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2018": 12.75,
      "Есенни 2017": 17.0
    },
    "competition_grades": {
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Росен Галинов Георгиев",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 5.0,
      "Есенни 2017": 5.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Цветилин Петров Цветилов",
    "grade": 16,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Пролетни 2018": 20.5,
      "Пролетни 2016": 23.5
    },
    "competition_grades": {
      "Пролетни 2018": 2.0,
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Адриана Борисова Гошева",
    "grade": 16,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2018": 11.75,
      "Есенни 2017": 16.5
    },
    "competition_grades": {
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Алекс Иванов Цветанов",
    "grade": 16,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2018": 14.75,
      "Есенни 2017": 12.0
    },
    "competition_grades": {
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Стефания Радостинова Донева",
    "grade": 16,
    "school": "91 НЕГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 5.63
    },
    "competition_grades": {
      "Есенни 2019": 5.0
    }
  },
  {
    "name": "Рени Величкова Бельовска",
    "grade": 16,
    "school": "1 АЕГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 4.25,
      "Пролетни 2018": 5.5
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Александър Петров Вълков",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2018": 14.0,
      "Есенни 2017": 10.5
    },
    "competition_grades": {
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Мирослава Запрянова Аргилашка",
    "grade": 16,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2018": 19.5
    },
    "competition_grades": {
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Кристиана Радославова Кабакчиева",
    "grade": 16,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Есенни 2019": 4.5
    },
    "competition_grades": {
      "Есенни 2019": 5.0
    }
  },
  {
    "name": "Марина Иванова Бояджиева",
    "grade": 16,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2018": 18.75
    },
    "competition_grades": {
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Стефани Веселинова Ангелова",
    "grade": 16,
    "school": "Първа ЕГ",
    "city": "Варна",
    "competitions": {
      "Есенни 2018": 7.0,
      "Есенни 2017": 7.5
    },
    "competition_grades": {
      "Есенни 2018": 3.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Калоян Юлиянов Цветанов",
    "grade": 16,
    "school": "ППМГ \"Гео Милев\"",
    "city": "Стара Загора",
    "competitions": {
      "Пролетни 2018": 17.5
    },
    "competition_grades": {
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Мартин Георгиев Маринов",
    "grade": 16,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2018": 10.75,
      "Пролетни 2016": 21.0,
      "Есенни 2015": 19.0
    },
    "competition_grades": {
      "Пролетни 2018": 2.0,
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Елица Станимирова Предоева",
    "grade": 16,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 1.63,
      "Пролетни 2018": 10.15
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Лука Атанасов Чалканов",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2018": 11.5,
      "Пролетни 2016": 21.5,
      "Есенни 2015": 11.5
    },
    "competition_grades": {
      "Пролетни 2018": 2.0,
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Алекс Пламенов Атанасов",
    "grade": 16,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2019": 2.88,
      "Есенни 2017": 6.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Елисавета Детелинова Желязкова",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2018": 10.0,
      "Есенни 2017": 8.5
    },
    "competition_grades": {
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Денислав Йорданов Керчев",
    "grade": 16,
    "school": "ЧПГ \"АК-Аркус\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2018": 9.25,
      "Есенни 2017": 8.0
    },
    "competition_grades": {
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Георги Жерков Жерков",
    "grade": 16,
    "school": "91 НЕГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 3.38
    },
    "competition_grades": {
      "Есенни 2019": 5.0
    }
  },
  {
    "name": "Василий Деанов Иванов",
    "grade": 16,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2018": 14.0
    },
    "competition_grades": {
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Димо Маринов Димчев",
    "grade": 16,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Есенни 2019": 3.25
    },
    "competition_grades": {
      "Есенни 2019": 5.0
    }
  },
  {
    "name": "Асен Николаев Доцински",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 18.0
    },
    "competition_grades": {
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Гавраил Иванов Гавраилов",
    "grade": 16,
    "school": "Първа ЕГ",
    "city": "Варна",
    "competitions": {
      "Пролетни 2018": 13.5
    },
    "competition_grades": {
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Делян Йорданов Банев",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2018": 9.0,
      "Есенни 2017": 5.0
    },
    "competition_grades": {
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Стефани Драгомирова Димитрова",
    "grade": 16,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2019": 3.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0
    }
  },
  {
    "name": "Димитър Михайлов Михайлов",
    "grade": 16,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2018": 7.0
    },
    "competition_grades": {
      "Есенни 2018": 3.0
    }
  },
  {
    "name": "Димитър Дианов Митев",
    "grade": 16,
    "school": "ГПЧЕ \"Йоан Екзарх\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 16.5
    },
    "competition_grades": {
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Даниел Георгиев Александров",
    "grade": 16,
    "school": "Първа ЕГ",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 14.5
    },
    "competition_grades": {
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Христа Юлиянова Иванова",
    "grade": 16,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2018": 10.25
    },
    "competition_grades": {
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Цветомир Миленов Цветанов",
    "grade": 16,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Есенни 2017": 13.0
    },
    "competition_grades": {
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Юлия Александра Жебровска",
    "grade": 16,
    "school": "АЕГ \"Гео Милев\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2018": 5.0,
      "Есенни 2017": 6.0
    },
    "competition_grades": {
      "Пролетни 2018": 2.0,
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Юлия Мариянова Петрова",
    "grade": 16,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетни 2018": 8.75
    },
    "competition_grades": {
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Мартин Ангелов Александров",
    "grade": 16,
    "school": "ПМГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенни 2017": 11.0
    },
    "competition_grades": {
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Светлин Красимиров Лалов",
    "grade": 16,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2016": 27.0,
      "Есенни 2015": 20.25
    },
    "competition_grades": {
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Димитър Радославов Боцев",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2016": 22.0,
      "Есенни 2015": 25.0
    },
    "competition_grades": {
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Георги Георгиев Иванов",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2016": 21.5,
      "Есенни 2015": 24.5
    },
    "competition_grades": {
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Михаил Тодоров Тодоров",
    "grade": 16,
    "school": "ОУ \"Св. П. Евтимий\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2016": 28.0,
      "Есенни 2015": 15.8
    },
    "competition_grades": {
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Ивет Иванова Димитрова",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2016": 21.5,
      "Есенни 2015": 20.5
    },
    "competition_grades": {
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Преслав Тихомиров Иванчев",
    "grade": 16,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетни 2018": 6.5
    },
    "competition_grades": {
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Яна Росенова Стойчева",
    "grade": 16,
    "school": "91 НЕГ",
    "city": "София",
    "competitions": {
      "Пролетни 2018": 6.5
    },
    "competition_grades": {
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Стоян Бориславов Дръндев",
    "grade": 16,
    "school": "СУЕО ,,А.С.Пушкин''",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 1.5,
      "Пролетни 2017": 7.75,
      "Есенни 2016": 6.5
    },
    "competition_grades": {
      "Есенни 2017": 2.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Никола Емилов Димитров",
    "grade": 16,
    "school": "104 ОУ",
    "city": "София",
    "competitions": {
      "Пролетни 2016": 19.0,
      "Есенни 2015": 21.25
    },
    "competition_grades": {
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Теодор Бисеров Генчев",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2016": 22.0,
      "Есенни 2015": 16.75
    },
    "competition_grades": {
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Ирма Атанасова Иванова",
    "grade": 16,
    "school": "1 АЕГ",
    "city": "София",
    "competitions": {
      "Есенни 2017": 8.0
    },
    "competition_grades": {
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Георги Иванов Попов",
    "grade": 16,
    "school": "ПМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2016": 18.75,
      "Есенни 2015": 16.5
    },
    "competition_grades": {
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Александър Александров Стефанов",
    "grade": 16,
    "school": "ПМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2016": 22.0,
      "Есенни 2015": 11.25
    },
    "competition_grades": {
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Мирослав Костадинов Костадинов",
    "grade": 16,
    "school": "ГПЧЕ \"Йоан Екзарх\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 7.0
    },
    "competition_grades": {
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Волен Ивов Николов",
    "grade": 16,
    "school": "104 ОУ",
    "city": "София",
    "competitions": {
      "Пролетни 2016": 20.0,
      "Есенни 2015": 12.0
    },
    "competition_grades": {
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Максим Миленов Банев",
    "grade": 16,
    "school": "Първа ЕГ",
    "city": "Варна",
    "competitions": {
      "Пролетни 2018": 5.0
    },
    "competition_grades": {
      "Пролетни 2018": 2.0
    }
  },
  {
    "name": "Теослава Цветанова Йорданова",
    "grade": 16,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2016": 17.5,
      "Есенни 2015": 14.0
    },
    "competition_grades": {
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Памела Тонева Тодорова",
    "grade": 16,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2016": 18.5,
      "Есенни 2015": 12.25
    },
    "competition_grades": {
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Калоян Венциславов Васев",
    "grade": 16,
    "school": "Първа ЕГ",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 6.5
    },
    "competition_grades": {
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Никола Красимиров Манолов",
    "grade": 16,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Есенни 2017": 6.5
    },
    "competition_grades": {
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Добрин Венциславов Башев",
    "grade": 16,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Олимпиада 2016": 20.0
    },
    "competition_grades": {
      "Олимпиада 2016": 1.0
    }
  },
  {
    "name": "Мария Динкова Кечева",
    "grade": 16,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2016": 19.5,
      "Есенни 2015": 9.0
    },
    "competition_grades": {
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Александър Филипов Димитров",
    "grade": 16,
    "school": "104 ОУ",
    "city": "София",
    "competitions": {
      "Пролетни 2016": 19.0,
      "Есенни 2015": 8.25
    },
    "competition_grades": {
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Анастасия Динкова Кечева",
    "grade": 16,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2016": 17.5,
      "Есенни 2015": 10.0
    },
    "competition_grades": {
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Ферит Тамеров Исмаилов",
    "grade": 16,
    "school": "ПМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Пролетни 2016": 24.0
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Валентино Руменов Кожухаров",
    "grade": 16,
    "school": "ПМГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенни 2017": 4.0,
      "Есенни 2015": 9.25
    },
    "competition_grades": {
      "Есенни 2017": 2.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Стефано Димитров Вълков",
    "grade": 16,
    "school": "ПМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Пролетни 2016": 23.25
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Красимир Виолетов Масларов",
    "grade": 16,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенни 2017": 5.5
    },
    "competition_grades": {
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Михаил Николаев Серафимов",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 5.5
    },
    "competition_grades": {
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Никола Славчев Славов",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 5.5
    },
    "competition_grades": {
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Йоана Петрова Кичева",
    "grade": 16,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2016": 23.0
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Петя Христова Сурджийска",
    "grade": 16,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2016": 22.0
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Виктория Димитрова Михайлова",
    "grade": 16,
    "school": "ОУ \"Св. П. Евтимий\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2016": 16.0,
      "Есенни 2015": 7.5
    },
    "competition_grades": {
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Ева Димитрова Петкова",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 5.0
    },
    "competition_grades": {
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Никола Константинов Коларов",
    "grade": 16,
    "school": "ПМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2016": 21.0
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Анна-Мария Миленова Дамянова",
    "grade": 16,
    "school": "ПМГ \"Екзарх Антим I\"",
    "city": "Видин",
    "competitions": {
      "Олимпиада 2016": 8.0,
      "Есенни 2015": 12.5
    },
    "competition_grades": {
      "Олимпиада 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Грета Цветанова Николова",
    "grade": 16,
    "school": "СОУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2016": 20.0
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Георги Недялков Недялков",
    "grade": 16,
    "school": "ПМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Пролетни 2016": 19.5
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Георги Николаев Атанасов",
    "grade": 16,
    "school": "ПМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2016": 19.5
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Борис Кирилов Костадинов",
    "grade": 16,
    "school": "107 ОУ \"Хан Крум\"",
    "city": "София",
    "competitions": {
      "Олимпиада 2016": 14.5
    },
    "competition_grades": {
      "Олимпиада 2016": 1.0
    }
  },
  {
    "name": "Александра Сергеева Русева",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 4.5
    },
    "competition_grades": {
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Никита Николаева Николаева",
    "grade": 16,
    "school": "ГПЧЕ \"Йоан Екзарх\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 4.5
    },
    "competition_grades": {
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Петко Живков Петков",
    "grade": 16,
    "school": "ПМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2016": 18.25
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Александра Ивайлова Николова",
    "grade": 16,
    "school": "ПМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2016": 18.0
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Антон Валентинов Дончев",
    "grade": 16,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2016": 10.0,
      "Есенни 2015": 9.75
    },
    "competition_grades": {
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Йоана Любомирова Пешева",
    "grade": 16,
    "school": "ПМГ \"Проф. Ем. Иванов\"",
    "city": "Кюстендил",
    "competitions": {
      "Пролетни 2016": 17.0
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Тимур Сезен Фехми",
    "grade": 16,
    "school": "Първа ЕГ",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 4.0
    },
    "competition_grades": {
      "Есенни 2017": 2.0
    }
  },
  {
    "name": "Николай Николаев Добрев",
    "grade": 16,
    "school": "СОУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2016": 16.5
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Светослав Маринов Терзийски",
    "grade": 16,
    "school": "СОУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2016": 15.5
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Ялуй Фу",
    "grade": 16,
    "school": "104 ОУ",
    "city": "София",
    "competitions": {
      "Пролетни 2016": 15.5
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Михаел Радостинов Сергиев",
    "grade": 16,
    "school": "ОУ \"Св.Иван Рилски\"",
    "city": "Перник",
    "competitions": {
      "Олимпиада 2016": 11.5
    },
    "competition_grades": {
      "Олимпиада 2016": 1.0
    }
  },
  {
    "name": "Мирослав Христофоров Христов",
    "grade": 16,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2016": 15.0
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Атанас Мирославов Александров",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2015": 19.5
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Божидар Стефанов Славов",
    "grade": 16,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2016": 14.5
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Петър Косев Костадинов",
    "grade": 16,
    "school": "ПМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетни 2016": 14.0
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Емил Красимиров Кочев",
    "grade": 16,
    "school": "СОУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2016": 13.5
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Деница Георгиева Горанова",
    "grade": 16,
    "school": "СОУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2016": 13.25
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Николай Ивайлов Арабаджиев",
    "grade": 16,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2016": 9.5,
      "Есенни 2015": 5.0
    },
    "competition_grades": {
      "Пролетни 2016": 1.0,
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Кристиан Красимиров Духлански",
    "grade": 16,
    "school": "СОУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2016": 13.0
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Димитър Христов Данов",
    "grade": 16,
    "school": "ПМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2016": 11.5
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Георги Георгиев Йорданов",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2015": 14.25
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Калоян Бойчев Арнаудов",
    "grade": 16,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2015": 13.25
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Лилия Йорданова Ангеличева",
    "grade": 16,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2015": 9.8
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Константин Мирославов Туев",
    "grade": 16,
    "school": "107 ОУ \"Хан Крум\"",
    "city": "София",
    "competitions": {
      "Олимпиада 2016": 5.5
    },
    "competition_grades": {
      "Олимпиада 2016": 1.0
    }
  },
  {
    "name": "Ралица Андрианова Иванова",
    "grade": 16,
    "school": "СОУ \"Св. св. Кирил и Методий\"",
    "city": "Козлодуй",
    "competitions": {
      "Пролетни 2016": 7.0
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Веселин Петров Димитров",
    "grade": 16,
    "school": "ЧОУ\"Малкият принц\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2015": 8.8
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Мария-Анна Бисерова Боянова",
    "grade": 16,
    "school": "ПМГ \"Екзарх Антим I\"",
    "city": "Видин",
    "competitions": {
      "Есенни 2015": 8.5
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Деян Миленов Милчев",
    "grade": 16,
    "school": "ОУ \"Св.Иван Рилски\"",
    "city": "Перник",
    "competitions": {
      "Олимпиада 2016": 4.5
    },
    "competition_grades": {
      "Олимпиада 2016": 1.0
    }
  },
  {
    "name": "Владимир Станиславов Чавдаров",
    "grade": 16,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2015": 7.5
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Елица Тихомирова Йоткова",
    "grade": 16,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2015": 7.5
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Стилиян Иванов Нановски",
    "grade": 16,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2015": 7.5
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Владислав Антонович Акифьев",
    "grade": 16,
    "school": "ЧОУ\"Малкият принц\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2015": 7.3
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Александър Бориславов Иванов",
    "grade": 16,
    "school": "104 ОУ",
    "city": "София",
    "competitions": {
      "Есенни 2015": 7.0
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Анна-Мария Галинова Господинова",
    "grade": 16,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2015": 7.0
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Симона Ивайлова Чалъкова",
    "grade": 16,
    "school": "ПМГ \"Проф. Ем. Иванов\"",
    "city": "Кюстендил",
    "competitions": {
      "Есенни 2015": 6.05
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Едмон Едмон Лазаров",
    "grade": 16,
    "school": "143.ОУ\"Г.Бенковски\"        ",
    "city": "София",
    "competitions": {
      "Пролетни 2016": 4.5
    },
    "competition_grades": {
      "Пролетни 2016": 1.0
    }
  },
  {
    "name": "Васил Стоянов Минков",
    "grade": 16,
    "school": "104 ОУ",
    "city": "София",
    "competitions": {
      "Есенни 2015": 5.25
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Костадин Илиев Василев",
    "grade": 16,
    "school": "ОУ \"Св. П. Евтимий\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2015": 5.0
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Симона Аврамова Стефанова",
    "grade": 16,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2015": 4.75
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Кристина Йорданова Стойнова",
    "grade": 16,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2015": 4.3
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Кристиан Веселинов Димитров",
    "grade": 16,
    "school": "ОУ \"Стоян Михайловски\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2015": 3.5
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Христа Миленова Павлова",
    "grade": 16,
    "school": "ОУ \"Св. П. Евтимий\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2015": 3.5
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Даяна Георгиева Стефанова",
    "grade": 16,
    "school": "ОУ \"Св. П. Евтимий\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2015": 3.0
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Симона Димитрова Стоянова",
    "grade": 16,
    "school": "ОУ \"Стоян Михайловски\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2015": 3.0
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Даниел Христов Алексиев",
    "grade": 16,
    "school": "ОУ \"Св. П. Евтимий\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2015": 1.75
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Марк Андреевич Похил",
    "grade": 16,
    "school": "ЧОУ\"Малкият принц\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2015": 1.0
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Кирил Алексеевич Аблам",
    "grade": 16,
    "school": "ЧОУ\"Малкият принц\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2015": 0.5
    },
    "competition_grades": {
      "Есенни 2015": 1.0
    }
  },
  {
    "name": "Иво Владиславов Петров",
    "grade": 17,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 47.0,
      "2 кръг 2020": 30.0,
      "Есенни 2019": 18.5,
      "Олимпиада 2019": 78.5,
      "Пролетни 2019": 28.5,
      "Есенни 2018": 24.5,
      "Олимпиада 2018": 79.25,
      "Пролетни 2018": 19.5,
      "Есенни 2017": 8.9,
      "Олимпиада 2017": 25.5,
      "Пролетни 2017": 27.75,
      "Олимпиада 2015": 23.5
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 6.0,
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 6.0,
      "Есенни 2018": 6.0,
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 6.0,
      "Есенни 2017": 6.0,
      "Олимпиада 2017": 2.0,
      "Пролетни 2017": 2.0,
      "Олимпиада 2015": 1.0
    }
  },
  {
    "name": "Добрин Марианов Бараков",
    "grade": 17,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Олимпиада 2020": 38.5,
      "2 кръг 2020": 30.0,
      "Есенни 2019": 16.0,
      "Олимпиада 2019": 72.0,
      "Пролетни 2019": 11.8,
      "Есенни 2018": 21.0,
      "Олимпиада 2018": 29.5,
      "Пролетни 2018": 28.0,
      "Есенни 2017": 20.5,
      "Пролетни 2017": 29.25,
      "Есенни 2016": 30.0,
      "Пролетни 2015": 23.0,
      "Есенни 2014": 23.0
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 6.0,
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 6.0,
      "Есенни 2018": 6.0,
      "Олимпиада 2018": 3.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Тодор Георгиев Тодоров",
    "grade": 17,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 44.9,
      "2 кръг 2020": 28.0,
      "Есенни 2019": 25.0,
      "Олимпиада 2019": 63.55,
      "Пролетни 2019": 5.5,
      "Есенни 2018": 16.0,
      "Олимпиада 2018": 28.75,
      "Пролетни 2018": 13.5,
      "Есенни 2017": 10.75,
      "Пролетни 2017": 28.25
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 6.0,
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 6.0,
      "Есенни 2018": 6.0,
      "Олимпиада 2018": 3.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Радостина Ивайлова Василева",
    "grade": 17,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Олимпиада 2020": 31.3,
      "2 кръг 2020": 29.0,
      "Есенни 2019": 14.25,
      "Олимпиада 2019": 21.0,
      "Пролетни 2019": 23.5,
      "Есенни 2018": 24.5,
      "Олимпиада 2018": 25.0,
      "Пролетни 2018": 15.0
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Олимпиада 2018": 3.0,
      "Пролетни 2018": 3.0
    }
  },
  {
    "name": "Божидар Росенов Станчев",
    "grade": 17,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Олимпиада 2020": 29.5,
      "2 кръг 2020": 24.5,
      "Есенни 2019": 21.0,
      "Олимпиада 2019": 19.0,
      "Пролетни 2019": 25.5,
      "Есенни 2018": 20.0,
      "Олимпиада 2018": 19.0,
      "Пролетни 2018": 7.75,
      "Есенни 2017": 11.0,
      "Олимпиада 2017": 12.5,
      "Пролетни 2017": 18.5,
      "Есенни 2016": 27.0
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Олимпиада 2018": 3.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Олимпиада 2017": 2.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Цветан Станимиров Говедаров",
    "grade": 17,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Олимпиада 2020": 29.0,
      "2 кръг 2020": 28.0,
      "Есенни 2019": 14.25,
      "Олимпиада 2019": 16.9,
      "Пролетни 2019": 9.65,
      "Есенни 2018": 25.8,
      "Олимпиада 2018": 16.5,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 16.0,
      "Олимпиада 2017": 14.1,
      "Пролетни 2017": 20.0,
      "Есенни 2016": 22.0,
      "Пролетни 2015": 21.5
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 5.0,
      "Есенни 2018": 4.0,
      "Олимпиада 2018": 3.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Олимпиада 2017": 2.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Мартин Кирилов Димитров",
    "grade": 17,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 25.5,
      "2 кръг 2020": 28.0,
      "Есенни 2019": 14.75,
      "Олимпиада 2019": 20.0,
      "Пролетни 2019": 25.0,
      "Есенни 2018": 24.3,
      "Пролетни 2018": 9.5,
      "Есенни 2017": 17.0,
      "Есенни 2016": 26.0
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Николай Димитров Митев",
    "grade": 17,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "2 кръг 2020": 29.0,
      "Есенни 2019": 14.0,
      "Олимпиада 2019": 43.0,
      "Пролетни 2019": 27.5,
      "Есенни 2018": 23.8,
      "Олимпиада 2018": 28.5,
      "Пролетни 2018": 14.0,
      "Есенни 2017": 20.25,
      "Олимпиада 2017": 20.8,
      "Пролетни 2017": 26.0,
      "Есенни 2016": 29.25
    },
    "competition_grades": {
      "2 кръг 2020": 5.0,
      "Есенни 2019": 6.0,
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Олимпиада 2018": 3.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Олимпиада 2017": 2.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Джемма Цонева Русева",
    "grade": 17,
    "school": "ПМГ \"Ат. Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Олимпиада 2020": 24.0,
      "2 кръг 2020": 25.0,
      "Есенни 2019": 4.25,
      "Олимпиада 2019": 13.5,
      "Пролетни 2019": 25.5,
      "Есенни 2018": 12.1,
      "Пролетни 2018": 7.0,
      "Есенни 2017": 21.75,
      "Олимпиада 2017": 9.1,
      "Пролетни 2017": 18.75,
      "Есенни 2016": 29.25
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 6.0,
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Олимпиада 2017": 2.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Петър Божидаров Тодоров",
    "grade": 17,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 18.0,
      "2 кръг 2020": 28.5,
      "Есенни 2019": 18.0,
      "Олимпиада 2019": 6.0,
      "Пролетни 2019": 18.5,
      "Есенни 2018": 20.0,
      "Пролетни 2018": 6.0,
      "Есенни 2017": 19.0,
      "Пролетни 2017": 25.75,
      "Есенни 2016": 23.5
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Никола Петров Петров",
    "grade": 17,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Олимпиада 2020": 21.0,
      "2 кръг 2020": 29.0,
      "Есенни 2019": 13.63,
      "Олимпиада 2019": 24.0,
      "Есенни 2018": 16.5,
      "Олимпиада 2017": 14.2,
      "Есенни 2016": 28.25,
      "Пролетни 2015": 20.0
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Олимпиада 2019": 4.0,
      "Есенни 2018": 4.0,
      "Олимпиада 2017": 2.0,
      "Есенни 2016": 2.0,
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Владимир Димитров Лалев",
    "grade": 17,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Олимпиада 2020": 17.0,
      "2 кръг 2020": 30.0,
      "Есенни 2019": 16.25,
      "Пролетни 2019": 28.5,
      "Есенни 2018": 18.0,
      "Пролетни 2018": 8.0,
      "Есенни 2017": 9.75,
      "Пролетни 2017": 21.5,
      "Есенни 2016": 19.0
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Мартина Николова Петрова",
    "grade": 17,
    "school": "АЕГ \"Гео Милев\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2020": 23.0,
      "2 кръг 2020": 26.5,
      "Есенни 2019": 5.25,
      "Олимпиада 2019": 13.2,
      "Пролетни 2019": 18.0,
      "Есенни 2018": 18.3,
      "Пролетни 2018": 7.5,
      "Есенни 2017": 4.5,
      "Пролетни 2017": 7.5
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 6.0,
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Гергана Драгомирова Пейкова",
    "grade": 17,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 14.0,
      "2 кръг 2020": 26.5,
      "Есенни 2019": 5.0,
      "Олимпиада 2019": 21.2,
      "Пролетни 2019": 27.0,
      "Есенни 2018": 22.9,
      "Пролетни 2018": 3.0,
      "Есенни 2016": 23.75
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 6.0,
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Петър Христов Бараков",
    "grade": 17,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 18.0,
      "2 кръг 2020": 26.0,
      "Есенни 2019": 11.5,
      "Пролетни 2019": 22.5,
      "Есенни 2018": 19.0,
      "Пролетни 2018": 8.5,
      "Есенни 2017": 5.25
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0
    }
  },
  {
    "name": "Ириней Билянов Василев",
    "grade": 17,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "2 кръг 2020": 30.0,
      "Пролетни 2019": 26.0,
      "Есенни 2018": 15.5,
      "Олимпиада 2018": 27.0,
      "Пролетни 2018": 17.5,
      "Есенни 2017": 23.5,
      "Олимпиада 2017": 20.0,
      "Пролетни 2017": 28.5,
      "Есенни 2016": 29.75
    },
    "competition_grades": {
      "2 кръг 2020": 5.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 6.0,
      "Олимпиада 2018": 3.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Олимпиада 2017": 2.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Кристиан Рачков Рачев",
    "grade": 17,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Олимпиада 2020": 11.0,
      "2 кръг 2020": 24.5,
      "Есенни 2019": 11.75,
      "Олимпиада 2019": 12.0,
      "Есенни 2018": 24.0,
      "Есенни 2017": 11.25
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Олимпиада 2019": 4.0,
      "Есенни 2018": 4.0,
      "Есенни 2017": 3.0
    }
  },
  {
    "name": "Мардирос Хачик Овагемян",
    "grade": 17,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2020": 12.5,
      "2 кръг 2020": 24.5,
      "Олимпиада 2019": 3.5,
      "Пролетни 2019": 14.5,
      "Есенни 2018": 24.1,
      "Пролетни 2018": 8.5,
      "Есенни 2017": 15.25,
      "Пролетни 2017": 10.25,
      "Есенни 2016": 15.0,
      "Пролетни 2015": 7.0
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Иван Тодоров Иванов",
    "grade": 17,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "2 кръг 2020": 26.0,
      "Есенни 2019": 19.5,
      "Пролетни 2019": 5.3,
      "Есенни 2018": 14.0,
      "Олимпиада 2018": 28.5,
      "Пролетни 2018": 11.25,
      "Есенни 2017": 17.25,
      "Пролетни 2017": 27.0,
      "Есенни 2016": 23.25
    },
    "competition_grades": {
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Пролетни 2019": 6.0,
      "Есенни 2018": 6.0,
      "Олимпиада 2018": 3.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Владимир Георгиев Маринов",
    "grade": 17,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 16.0,
      "2 кръг 2020": 27.5,
      "Олимпиада 2018": 9.5,
      "Пролетни 2018": 9.5,
      "Есенни 2017": 8.0,
      "Пролетни 2015": 25.5,
      "Есенни 2014": 13.95
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0,
      "Олимпиада 2018": 3.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Захари Георгиев Стоименов",
    "grade": 17,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "2 кръг 2020": 24.5,
      "Есенни 2019": 13.25,
      "Олимпиада 2019": 10.0,
      "Пролетни 2019": 13.0
    },
    "competition_grades": {
      "2 кръг 2020": 5.0,
      "Есенни 2019": 5.0,
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 4.0
    }
  },
  {
    "name": "Драгомир Димитров Николов",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 14.75,
      "Олимпиада 2019": 20.0,
      "Пролетни 2019": 23.0,
      "Есенни 2018": 20.5,
      "Пролетни 2018": 9.0,
      "Есенни 2017": 13.0,
      "Пролетни 2017": 22.75,
      "Есенни 2016": 24.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Илия Игнатов Стоянов",
    "grade": 17,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2020": 14.8,
      "2 кръг 2020": 25.0
    },
    "competition_grades": {
      "Олимпиада 2020": 5.0,
      "2 кръг 2020": 5.0
    }
  },
  {
    "name": "Борис Тодоров Панайотов",
    "grade": 17,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 16.75,
      "Олимпиада 2019": 0.0,
      "Олимпиада 2018": 64.5,
      "Пролетни 2018": 13.5,
      "Есенни 2017": 18.8,
      "Олимпиада 2017": 27.3,
      "Пролетни 2017": 22.75,
      "Есенни 2016": 28.5,
      "Олимпиада 2015": 21.0,
      "Пролетни 2015": 25.0
    },
    "competition_grades": {
      "Есенни 2019": 6.0,
      "Олимпиада 2019": 4.0,
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 6.0,
      "Есенни 2017": 6.0,
      "Олимпиада 2017": 2.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Олимпиада 2015": 1.0,
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Николета Костадинова Николова",
    "grade": 17,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2019": 14.0,
      "Пролетни 2019": 15.5,
      "Есенни 2018": 20.5,
      "Олимпиада 2018": 20.5,
      "Пролетни 2018": 11.5,
      "Есенни 2017": 13.0,
      "Олимпиада 2017": 5.0,
      "Пролетни 2017": 12.0,
      "Есенни 2016": 19.0,
      "Пролетни 2015": 12.5
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Олимпиада 2018": 3.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Олимпиада 2017": 2.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Александър Иванов Захариев",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 6.0,
      "Пролетни 2019": 23.5,
      "Есенни 2018": 21.0,
      "Олимпиада 2018": 22.0,
      "Пролетни 2018": 7.5,
      "Есенни 2017": 14.5
    },
    "competition_grades": {
      "Есенни 2019": 6.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Олимпиада 2018": 3.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0
    }
  },
  {
    "name": "Далия Джафар Саид Филфил",
    "grade": 17,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2019": 10.75,
      "Пролетни 2019": 22.0,
      "Есенни 2018": 18.4,
      "Пролетни 2018": 9.25,
      "Есенни 2017": 7.5,
      "Пролетни 2017": 13.25,
      "Есенни 2016": 21.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Ивета Мирославова Димитрова",
    "grade": 17,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2019": 9.25,
      "Пролетни 2019": 17.5,
      "Есенни 2018": 18.1,
      "Пролетни 2018": 5.5,
      "Есенни 2017": 8.0,
      "Пролетни 2017": 14.0,
      "Есенни 2016": 28.0,
      "Пролетни 2015": 18.75,
      "Есенни 2014": 16.25
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Стефан Стефанов Ангелов",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 5.0,
      "Пролетни 2019": 24.0,
      "Есенни 2018": 17.3,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 4.5,
      "Пролетни 2017": 24.25,
      "Есенни 2016": 18.5
    },
    "competition_grades": {
      "Есенни 2019": 6.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Силвия Георгиева Петрова",
    "grade": 17,
    "school": "ППМГ \"Гео Милев\"",
    "city": "Стара Загора",
    "competitions": {
      "Есенни 2018": 23.0,
      "Олимпиада 2018": 27.0,
      "Пролетни 2018": 7.25,
      "Есенни 2017": 18.0,
      "Олимпиада 2017": 20.2,
      "Пролетни 2017": 23.5,
      "Есенни 2016": 24.5
    },
    "competition_grades": {
      "Есенни 2018": 4.0,
      "Олимпиада 2018": 3.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Олимпиада 2017": 2.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Надежда Яворова Маркова",
    "grade": 17,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенни 2019": 21.38,
      "Есенни 2018": 20.5
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Есенни 2018": 4.0
    }
  },
  {
    "name": "Елена Светлинова Попова",
    "grade": 17,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 9.25,
      "Пролетни 2019": 19.5,
      "Есенни 2018": 22.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0
    }
  },
  {
    "name": "Кристиян Деянов Горанов",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 9.5,
      "Пролетни 2019": 16.5,
      "Есенни 2018": 15.0,
      "Пролетни 2018": 4.5,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 16.5,
      "Есенни 2016": 13.5
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Йоана Руменова Лалковска",
    "grade": 17,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Есенни 2019": 9.0,
      "Пролетни 2019": 11.5,
      "Есенни 2018": 13.3,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 7.5,
      "Пролетни 2017": 20.5,
      "Есенни 2016": 24.5
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Георги Живков Ганчев",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 9.88,
      "Пролетни 2019": 10.5,
      "Есенни 2018": 10.3,
      "Пролетни 2018": 3.25,
      "Есенни 2017": 7.25,
      "Пролетни 2017": 15.0,
      "Есенни 2016": 19.75,
      "Олимпиада 2015": 13.5,
      "Пролетни 2015": 19.0,
      "Есенни 2014": 11.1
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Олимпиада 2015": 1.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Васил Иванов Тодоров",
    "grade": 17,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2019": 14.0,
      "Есенни 2018": 10.5,
      "Олимпиада 2018": 12.5,
      "Пролетни 2018": 5.5,
      "Олимпиада 2017": 21.4,
      "Пролетни 2017": 21.0,
      "Есенни 2016": 29.25,
      "Олимпиада 2015": 13.0,
      "Пролетни 2015": 20.5
    },
    "competition_grades": {
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Олимпиада 2018": 3.0,
      "Пролетни 2018": 3.0,
      "Олимпиада 2017": 2.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Олимпиада 2015": 1.0,
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Преслава Валентинова Бойчева",
    "grade": 17,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2019": 12.75,
      "Пролетни 2019": 9.0,
      "Есенни 2018": 11.3
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0
    }
  },
  {
    "name": "Добромир Ивелинов Тодоров",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 11.75,
      "Пролетни 2019": 18.0,
      "Пролетни 2018": 0.5,
      "Есенни 2017": 2.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2019": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0
    }
  },
  {
    "name": "Даниел Веселинов Стефанов",
    "grade": 17,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2019": 16.5,
      "Есенни 2018": 20.1,
      "Пролетни 2018": 10.0,
      "Есенни 2017": 9.5
    },
    "competition_grades": {
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0
    }
  },
  {
    "name": "Калина Веселинова Георгиева",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 4.75,
      "Пролетни 2019": 11.5,
      "Есенни 2018": 7.8,
      "Пролетни 2018": 5.5,
      "Есенни 2017": 11.75,
      "Пролетни 2017": 20.5,
      "Есенни 2016": 12.5
    },
    "competition_grades": {
      "Есенни 2019": 6.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Жасмина Михайлова Николова",
    "grade": 17,
    "school": "ПМГ \"Иван Вазов\"",
    "city": "Добрич",
    "competitions": {
      "Олимпиада 2019": 21.5,
      "Олимпиада 2018": 13.5
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0,
      "Олимпиада 2018": 3.0
    }
  },
  {
    "name": "Мария Стефанова Младенова",
    "grade": 17,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2019": 2.88,
      "Пролетни 2019": 13.5,
      "Есенни 2018": 13.5,
      "Пролетни 2018": 8.25,
      "Есенни 2017": 1.75,
      "Пролетни 2017": 6.0,
      "Пролетни 2015": 17.0,
      "Есенни 2014": 7.2
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Ангел Георгиев Андрейчев",
    "grade": 17,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2018": 19.5,
      "Пролетни 2018": 7.0,
      "Есенни 2017": 7.75,
      "Олимпиада 2017": 14.8,
      "Пролетни 2017": 22.5,
      "Есенни 2016": 22.75,
      "Пролетни 2015": 16.0,
      "Есенни 2014": 13.0
    },
    "competition_grades": {
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Олимпиада 2017": 2.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Иван Калинов Митов",
    "grade": 17,
    "school": "ПМГ \"Проф. Ем. Иванов\"",
    "city": "Кюстендил",
    "competitions": {
      "Пролетни 2019": 17.0,
      "Олимпиада 2018": 16.5,
      "Есенни 2016": 27.0,
      "Пролетни 2015": 22.0,
      "Есенни 2014": 10.0
    },
    "competition_grades": {
      "Пролетни 2019": 4.0,
      "Олимпиада 2018": 3.0,
      "Есенни 2016": 2.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Михаил Радославов Коцев",
    "grade": 17,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Есенни 2018": 22.0,
      "Пролетни 2018": 8.0,
      "Есенни 2017": 14.25,
      "Пролетни 2017": 8.75,
      "Есенни 2016": 25.5,
      "Пролетни 2015": 20.0
    },
    "competition_grades": {
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Ана-Мария Данчева Богданова",
    "grade": 17,
    "school": "ПМГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Олимпиада 2019": 7.0,
      "Есенни 2018": 13.8,
      "Пролетни 2018": 3.5,
      "Есенни 2017": 12.5,
      "Пролетни 2017": 20.5,
      "Пролетни 2015": 14.75
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0,
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Здравко Милков Славов",
    "grade": 17,
    "school": "Първа ЕГ",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 5.75,
      "Есенни 2018": 12.3,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 5.75,
      "Пролетни 2017": 16.25,
      "Есенни 2016": 12.0,
      "Есенни 2014": 4.75
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Михаил Минков Минков",
    "grade": 17,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 15.25
    },
    "competition_grades": {
      "Есенни 2019": 6.0
    }
  },
  {
    "name": "Йордан Цветков Цветков",
    "grade": 17,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2018": 23.0,
      "Пролетни 2018": 5.0,
      "Есенни 2017": 8.75,
      "Пролетни 2017": 26.5
    },
    "competition_grades": {
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Теодор Григоров Недев",
    "grade": 17,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенни 2018": 14.8,
      "Пролетни 2018": 10.5,
      "Есенни 2017": 13.5,
      "Пролетни 2017": 11.5,
      "Есенни 2016": 22.75,
      "Пролетни 2015": 17.0,
      "Есенни 2014": 14.25
    },
    "competition_grades": {
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Ния Георгиева Петкова",
    "grade": 17,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2019": 9.5,
      "Есенни 2018": 8.8,
      "Пролетни 2017": 10.5
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Есенни 2018": 4.0,
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Станислав Иванов Иванов",
    "grade": 17,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Есенни 2019": 10.5,
      "Пролетни 2019": 5.95
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2019": 5.0
    }
  },
  {
    "name": "Мартин Георгиев Георгиев 0",
    "grade": 17,
    "school": "АЕГ \"Гео Милев\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2019": 12.5
    },
    "competition_grades": {
      "Есенни 2019": 5.0
    }
  },
  {
    "name": "Димитър Здравков Митев",
    "grade": 17,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2019": 9.0,
      "Есенни 2018": 9.0,
      "Есенни 2017": 2.75,
      "Пролетни 2017": 19.25,
      "Есенни 2016": 10.5,
      "Есенни 2014": 9.85
    },
    "competition_grades": {
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Георги Тодоров Николаев",
    "grade": 17,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2019": 17.5,
      "Пролетни 2018": 4.0,
      "Пролетни 2017": 13.0
    },
    "competition_grades": {
      "Пролетни 2019": 4.0,
      "Пролетни 2018": 3.0,
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Николай Ивов Казаков",
    "grade": 17,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2019": 18.0,
      "Пролетни 2018": 7.0
    },
    "competition_grades": {
      "Пролетни 2019": 4.0,
      "Пролетни 2018": 3.0
    }
  },
  {
    "name": "Мария Златкова Палашева",
    "grade": 17,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2019": 12.5,
      "Олимпиада 2018": 13.5
    },
    "competition_grades": {
      "Пролетни 2019": 4.0,
      "Олимпиада 2018": 3.0
    }
  },
  {
    "name": "Александра Пепина Танева",
    "grade": 17,
    "school": "ПМГ \"Ат. Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Есенни 2018": 12.3,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 7.0,
      "Пролетни 2017": 17.0,
      "Есенни 2016": 27.0
    },
    "competition_grades": {
      "Есенни 2018": 4.0,
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Владислав Георгиев Петров",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 5.0,
      "Пролетни 2019": 9.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2019": 4.0
    }
  },
  {
    "name": "Гавраил Иванов Димов",
    "grade": 17,
    "school": "ПМГ \"Иван Вазов\"",
    "city": "Добрич",
    "competitions": {
      "Олимпиада 2018": 22.5,
      "Есенни 2017": 10.25,
      "Олимпиада 2015": 12.75,
      "Пролетни 2015": 19.5,
      "Есенни 2014": 18.0
    },
    "competition_grades": {
      "Олимпиада 2018": 3.0,
      "Есенни 2017": 3.0,
      "Олимпиада 2015": 1.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Александър Емил Начев",
    "grade": 17,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2019": 9.5,
      "Пролетни 2018": 1.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2018": 3.0
    }
  },
  {
    "name": "Свилен Константинов Константинов",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 4.75,
      "Пролетни 2019": 6.5,
      "Есенни 2017": 1.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2019": 4.0,
      "Есенни 2017": 3.0
    }
  },
  {
    "name": "Мартин Танев Драгиев",
    "grade": 17,
    "school": "ПГМЕЕ",
    "city": "Бургас",
    "competitions": {
      "Есенни 2019": 6.0,
      "Пролетни 2017": 6.25,
      "Есенни 2016": 14.75,
      "Пролетни 2016": 7.25
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0
    }
  },
  {
    "name": "Борис Валериев Трифонов",
    "grade": 17,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2018": 16.8,
      "Есенни 2017": 3.5
    },
    "competition_grades": {
      "Есенни 2018": 4.0,
      "Есенни 2017": 3.0
    }
  },
  {
    "name": "Цвета Красенова Крумова",
    "grade": 17,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2018": 4.0,
      "Есенни 2017": 8.5,
      "Пролетни 2017": 19.5,
      "Есенни 2016": 24.75,
      "Олимпиада 2015": 16.5,
      "Пролетни 2015": 22.0,
      "Есенни 2014": 16.0
    },
    "competition_grades": {
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Олимпиада 2015": 1.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Екатерина Борисова Иванова",
    "grade": 17,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2018": 3.5,
      "Есенни 2017": 6.25,
      "Пролетни 2017": 25.0,
      "Есенни 2016": 23.0,
      "Пролетни 2015": 15.0,
      "Есенни 2014": 12.5
    },
    "competition_grades": {
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Невена Емилова Христова",
    "grade": 17,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2017": 14.0,
      "Пролетни 2017": 14.0,
      "Есенни 2016": 26.25,
      "Олимпиада 2015": 7.75,
      "Пролетни 2015": 16.0
    },
    "competition_grades": {
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Олимпиада 2015": 1.0,
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Красимира Миленова Генова",
    "grade": 17,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2019": 4.5,
      "Есенни 2018": 3.3,
      "Пролетни 2017": 9.75,
      "Есенни 2016": 8.75,
      "Пролетни 2015": 8.5,
      "Есенни 2014": 12.45
    },
    "competition_grades": {
      "Пролетни 2019": 4.0,
      "Есенни 2018": 4.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Мартин Красенов Тодоров",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2019": 3.75,
      "Пролетни 2019": 3.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0,
      "Пролетни 2019": 4.0
    }
  },
  {
    "name": "Георги Стоянов Желязков",
    "grade": 17,
    "school": "ЕГ \"Пловдив\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2017": 10.5,
      "Пролетни 2017": 22.25,
      "Есенни 2016": 16.0
    },
    "competition_grades": {
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Иван Николаев Николов",
    "grade": 17,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2017": 8.75,
      "Пролетни 2017": 15.0,
      "Есенни 2016": 27.0
    },
    "competition_grades": {
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Виан Бахзад Ел Ахмед",
    "grade": 17,
    "school": "91 НЕГ",
    "city": "София",
    "competitions": {
      "Есенни 2019": 5.0
    },
    "competition_grades": {
      "Есенни 2019": 5.0
    }
  },
  {
    "name": "Волен Йорданов Терзиев",
    "grade": 17,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2017": 10.5,
      "Пролетни 2017": 19.0,
      "Есенни 2016": 15.75
    },
    "competition_grades": {
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Виктор Петров Балтин",
    "grade": 17,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2017": 17.4,
      "Есенни 2016": 18.75,
      "Олимпиада 2015": 15.0,
      "Пролетни 2015": 23.5,
      "Есенни 2014": 22.25
    },
    "competition_grades": {
      "Олимпиада 2017": 2.0,
      "Есенни 2016": 2.0,
      "Олимпиада 2015": 1.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Красимира Мирославова Костова",
    "grade": 17,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2018": 2.25,
      "Есенни 2017": 9.25,
      "Пролетни 2017": 9.5,
      "Есенни 2016": 21.25
    },
    "competition_grades": {
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Веселина Тодорова Велкова",
    "grade": 17,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2017": 16.25,
      "Есенни 2016": 28.0,
      "Олимпиада 2015": 15.0,
      "Пролетни 2015": 20.5,
      "Есенни 2014": 14.5
    },
    "competition_grades": {
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Олимпиада 2015": 1.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Петър Григоров Генов",
    "grade": 17,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2018": 3.0,
      "Есенни 2017": 13.0,
      "Есенни 2016": 19.5
    },
    "competition_grades": {
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Бояна Григорова Рашкова",
    "grade": 17,
    "school": "ЕГ \"Пловдив\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2017": 10.5,
      "Пролетни 2017": 10.5,
      "Есенни 2016": 19.75
    },
    "competition_grades": {
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Матей Костадинов Петков",
    "grade": 17,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенни 2018": 5.5,
      "Олимпиада 2017": 14.5
    },
    "competition_grades": {
      "Есенни 2018": 4.0,
      "Олимпиада 2017": 2.0
    }
  },
  {
    "name": "Антон Минков Илчев",
    "grade": 17,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2017": 4.0,
      "Пролетни 2017": 15.0,
      "Есенни 2016": 16.0,
      "Олимпиада 2015": 8.0,
      "Пролетни 2015": 21.5,
      "Есенни 2014": 10.5
    },
    "competition_grades": {
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Олимпиада 2015": 1.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Димитър Любомиров Спасов",
    "grade": 17,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2017": 4.25,
      "Пролетни 2017": 18.75,
      "Есенни 2016": 17.0
    },
    "competition_grades": {
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Георги Николов Топов",
    "grade": 17,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Есенни 2017": 7.5,
      "Пролетни 2017": 15.25,
      "Есенни 2016": 13.25
    },
    "competition_grades": {
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Симона Веселинова Веселинова",
    "grade": 17,
    "school": "ПМГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2018": 0.75,
      "Есенни 2017": 14.25,
      "Пролетни 2017": 11.25
    },
    "competition_grades": {
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Антон Златков Божидаров",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2018": 4.0,
      "Есенни 2017": 3.5,
      "Пролетни 2017": 8.25,
      "Есенни 2016": 19.0
    },
    "competition_grades": {
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Николай Стилиянов Нинов",
    "grade": 17,
    "school": "ППМГ",
    "city": "Ловеч",
    "competitions": {
      "Пролетни 2018": 5.0,
      "Пролетни 2017": 24.75
    },
    "competition_grades": {
      "Пролетни 2018": 3.0,
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Станислав Веселинов Василев",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 8.0,
      "Есенни 2016": 24.0,
      "Пролетни 2015": 12.5,
      "Есенни 2014": 16.0
    },
    "competition_grades": {
      "Есенни 2017": 3.0,
      "Есенни 2016": 2.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Евгени Стаев Кайряков",
    "grade": 17,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2017": 23.5,
      "Олимпиада 2015": 17.25,
      "Пролетни 2015": 28.0,
      "Есенни 2014": 27.25
    },
    "competition_grades": {
      "Пролетни 2017": 2.0,
      "Олимпиада 2015": 1.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Максим Чавдаров Къснеделчев",
    "grade": 17,
    "school": "ПМГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенни 2017": 5.0,
      "Пролетни 2017": 11.5,
      "Есенни 2016": 18.75
    },
    "competition_grades": {
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Александър Ангелов Желязков",
    "grade": 17,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2017": 7.0,
      "Есенни 2016": 26.5
    },
    "competition_grades": {
      "Есенни 2017": 3.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Емануил Георгиев Христов",
    "grade": 17,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2018": 3.5,
      "Есенни 2017": 13.5
    },
    "competition_grades": {
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0
    }
  },
  {
    "name": "Андрей Ивайлов Цочев",
    "grade": 17,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2017": 13.0,
      "Есенни 2016": 15.75,
      "Пролетни 2015": 17.5,
      "Есенни 2014": 12.5
    },
    "competition_grades": {
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Ралица Димитрова Димитрова",
    "grade": 17,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2018": 3.5,
      "Есенни 2017": 7.75,
      "Пролетни 2017": 7.5
    },
    "competition_grades": {
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Антон Митков Пашов",
    "grade": 17,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетни 2017": 16.0,
      "Есенни 2016": 14.5,
      "Пролетни 2015": 14.5
    },
    "competition_grades": {
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Калоян Руменов Владовски",
    "grade": 17,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенни 2017": 8.75,
      "Пролетни 2017": 10.0,
      "Есенни 2016": 4.75
    },
    "competition_grades": {
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Никола Красимиров Михайлов",
    "grade": 17,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2017": 8.5,
      "Пролетни 2017": 13.25
    },
    "competition_grades": {
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Николай Радостинов Колев",
    "grade": 17,
    "school": "ПМГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2017": 13.5,
      "Есенни 2016": 18.0
    },
    "competition_grades": {
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Йоана Костадинова Митева",
    "grade": 17,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2017": 6.25,
      "Пролетни 2017": 14.75
    },
    "competition_grades": {
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Димитър Ясенов Опърлаков",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 8.25,
      "Олимпиада 2015": 14.0,
      "Пролетни 2015": 24.0,
      "Есенни 2014": 21.5
    },
    "competition_grades": {
      "Есенни 2017": 3.0,
      "Олимпиада 2015": 1.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Ирина Атанасова Георгиева",
    "grade": 17,
    "school": "ПМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2016": 25.25,
      "Пролетни 2015": 16.75,
      "Есенни 2014": 20.5
    },
    "competition_grades": {
      "Есенни 2016": 2.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Васил Тодоров Качамаков",
    "grade": 17,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2017": 5.0,
      "Пролетни 2017": 12.25,
      "Пролетни 2015": 13.25
    },
    "competition_grades": {
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Стефан Димитров Дачев",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 2.5,
      "Пролетни 2017": 8.75,
      "Есенни 2016": 13.5
    },
    "competition_grades": {
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Десислава Илиянова Илиева",
    "grade": 17,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2016": 27.0
    },
    "competition_grades": {
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Веселин Николаев Върбанов",
    "grade": 17,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2017": 15.75,
      "Пролетни 2015": 7.5,
      "Есенни 2014": 16.25
    },
    "competition_grades": {
      "Пролетни 2017": 2.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Мирослав Йорданов Йорданов",
    "grade": 17,
    "school": "ПМГ \"Ат. Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Пролетни 2018": 2.0,
      "Есенни 2016": 19.0
    },
    "competition_grades": {
      "Пролетни 2018": 3.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Мирослав Лъчезаров Маринов",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2018": 8.0
    },
    "competition_grades": {
      "Пролетни 2018": 3.0
    }
  },
  {
    "name": "Руслан Красимиров Найденов",
    "grade": 17,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2018": 1.0,
      "Есенни 2017": 3.5,
      "Пролетни 2017": 10.25
    },
    "competition_grades": {
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Цветомир Кирилов Кирилов",
    "grade": 17,
    "school": "ГПЧЕ \"Ромен Ролан\"",
    "city": "Стара Загора",
    "competitions": {
      "Олимпиада 2017": 13.4
    },
    "competition_grades": {
      "Олимпиада 2017": 2.0
    }
  },
  {
    "name": "Александър Димов Хътов",
    "grade": 17,
    "school": "Първа ЕГ",
    "city": "Варна",
    "competitions": {
      "Пролетни 2018": 3.0,
      "Есенни 2017": 5.0
    },
    "competition_grades": {
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0
    }
  },
  {
    "name": "Елица Миленова Илиева",
    "grade": 17,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2018": 3.3,
      "Пролетни 2015": 5.0,
      "Есенни 2014": 2.85
    },
    "competition_grades": {
      "Есенни 2018": 4.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Лилия Петрова Вигенина",
    "grade": 17,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2017": 13.25,
      "Есенни 2014": 11.5
    },
    "competition_grades": {
      "Пролетни 2017": 2.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Никола Миленов Димитров",
    "grade": 17,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2017": 14.5
    },
    "competition_grades": {
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Десислава Николаева Георгиева",
    "grade": 17,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2017": 5.25,
      "Есенни 2016": 9.0,
      "Пролетни 2015": 9.5,
      "Есенни 2014": 5.85
    },
    "competition_grades": {
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Спас Николаев Николов",
    "grade": 17,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2018": 4.0,
      "Есенни 2017": 2.5
    },
    "competition_grades": {
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0
    }
  },
  {
    "name": "Георги Йорданов Георгиев",
    "grade": 17,
    "school": "ПМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2016": 10.25,
      "Есенни 2015": 20.5,
      "Пролетни 2014": 14.0,
      "Есенни 2013": 21.25
    },
    "competition_grades": {
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Александър Бисеров Манев",
    "grade": 17,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2018": 5.5
    },
    "competition_grades": {
      "Пролетни 2018": 3.0
    }
  },
  {
    "name": "Асен Валентинов Пешев",
    "grade": 17,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2016": 16.0
    },
    "competition_grades": {
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Константин Пламенов Мъцински",
    "grade": 17,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Пролетни 2017": 12.0
    },
    "competition_grades": {
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Слав Ивайлов Иванов",
    "grade": 17,
    "school": "91 НЕГ",
    "city": "София",
    "competitions": {
      "Пролетни 2018": 1.0,
      "Пролетни 2017": 9.5
    },
    "competition_grades": {
      "Пролетни 2018": 3.0,
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Мартин Атанасов Димитров",
    "grade": 17,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2016": 15.75
    },
    "competition_grades": {
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Йована Бориславова Аврамова",
    "grade": 17,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2017": 11.25
    },
    "competition_grades": {
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Ния Велинова Вичева",
    "grade": 17,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Пролетни 2017": 10.75
    },
    "competition_grades": {
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Стиляна Стефанова Бозова",
    "grade": 17,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2018": 4.5
    },
    "competition_grades": {
      "Пролетни 2018": 3.0
    }
  },
  {
    "name": "Михаела Николаева Бечева",
    "grade": 17,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2018": 1.5,
      "Пролетни 2017": 6.75
    },
    "competition_grades": {
      "Пролетни 2018": 3.0,
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Ивайла Николаева Минчева",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2017": 6.5,
      "Есенни 2016": 5.0
    },
    "competition_grades": {
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Траян Ангелов Райковски",
    "grade": 17,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Есенни 2017": 5.75
    },
    "competition_grades": {
      "Есенни 2017": 3.0
    }
  },
  {
    "name": "Иванина Дечева Минкова",
    "grade": 17,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2017": 9.75
    },
    "competition_grades": {
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Виктор Петров Петров",
    "grade": 17,
    "school": "Първа ЕГ",
    "city": "Варна",
    "competitions": {
      "Пролетни 2017": 9.5
    },
    "competition_grades": {
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Атанас Иванов Джурков",
    "grade": 17,
    "school": "73. СУ \" Вл. Граматик\"",
    "city": "София",
    "competitions": {
      "Пролетни 2018": 4.0
    },
    "competition_grades": {
      "Пролетни 2018": 3.0
    }
  },
  {
    "name": "Георги Апостолов Хърлев",
    "grade": 17,
    "school": "ППМГ",
    "city": "Ловеч",
    "competitions": {
      "Пролетни 2018": 4.0
    },
    "competition_grades": {
      "Пролетни 2018": 3.0
    }
  },
  {
    "name": "Тихомир Тихомиров Тодоров",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Олимпиада 2015": 10.0,
      "Пролетни 2015": 23.5,
      "Есенни 2014": 21.5
    },
    "competition_grades": {
      "Олимпиада 2015": 1.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Мартин Ивелинов Попов",
    "grade": 17,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Есенни 2017": 5.0
    },
    "competition_grades": {
      "Есенни 2017": 3.0
    }
  },
  {
    "name": "Гергана Тихомирова Тодорова",
    "grade": 17,
    "school": "ОМГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Олимпиада 2015": 9.25,
      "Пролетни 2015": 20.0,
      "Есенни 2014": 21.25
    },
    "competition_grades": {
      "Олимпиада 2015": 1.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Васил Десиславов Мераков",
    "grade": 17,
    "school": "91 НЕГ",
    "city": "София",
    "competitions": {
      "Пролетни 2018": 3.5
    },
    "competition_grades": {
      "Пролетни 2018": 3.0
    }
  },
  {
    "name": "Никита Владиславович Степанов",
    "grade": 17,
    "school": "ПМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2017": 6.75,
      "Есенни 2016": 2.0
    },
    "competition_grades": {
      "Пролетни 2017": 2.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Йоана Жейнова Йовчева",
    "grade": 17,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетни 2018": 1.5,
      "Есенни 2017": 2.5
    },
    "competition_grades": {
      "Пролетни 2018": 3.0,
      "Есенни 2017": 3.0
    }
  },
  {
    "name": "Фани Христова Петрова",
    "grade": 17,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2016": 6.5,
      "Пролетни 2015": 11.75,
      "Есенни 2014": 6.75
    },
    "competition_grades": {
      "Есенни 2016": 2.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Ивана Димитрова Воденичарова",
    "grade": 17,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2017": 1.0,
      "Пролетни 2017": 6.0
    },
    "competition_grades": {
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Антонио Николаев Петков",
    "grade": 17,
    "school": "НПГПТО \"М.В.Ломоносов\"",
    "city": "София",
    "competitions": {
      "Есенни 2017": 1.5,
      "Есенни 2016": 6.5
    },
    "competition_grades": {
      "Есенни 2017": 3.0,
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Георги Бисеров Добрев",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2016": 5.75,
      "Пролетни 2015": 9.5,
      "Есенни 2014": 10.5
    },
    "competition_grades": {
      "Есенни 2016": 2.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Любомир Васков Петров",
    "grade": 17,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетни 2017": 4.5,
      "Пролетни 2015": 13.0
    },
    "competition_grades": {
      "Пролетни 2017": 2.0,
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Веселин Николаев Обретенов",
    "grade": 17,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетни 2017": 3.75,
      "Пролетни 2015": 14.0
    },
    "competition_grades": {
      "Пролетни 2017": 2.0,
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Борислава Атанасова Колева",
    "grade": 17,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Есенни 2016": 8.25
    },
    "competition_grades": {
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Жанет Владимирова Ангелова",
    "grade": 17,
    "school": "ПГПАЕ\"Гео Милев\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2017": 1.0,
      "Пролетни 2017": 4.25
    },
    "competition_grades": {
      "Есенни 2017": 3.0,
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Йоанна Красимирова Кръстева",
    "grade": 17,
    "school": "ПМГ \"Ат. Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Пролетни 2018": 2.5
    },
    "competition_grades": {
      "Пролетни 2018": 3.0
    }
  },
  {
    "name": "Любомира Петкова Димитрова",
    "grade": 17,
    "school": "СОУ \"НиколайКатранов\"",
    "city": "Свищов",
    "competitions": {
      "Пролетни 2015": 17.0,
      "Есенни 2014": 21.25
    },
    "competition_grades": {
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Виктория Валериева Цветкова",
    "grade": 17,
    "school": "104 ОУ",
    "city": "София",
    "competitions": {
      "Пролетни 2015": 18.0,
      "Есенни 2014": 19.0
    },
    "competition_grades": {
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Димитър Димитров Крачунов",
    "grade": 17,
    "school": "104 ОУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2015": 9.0,
      "Пролетни 2015": 12.5,
      "Есенни 2014": 9.9
    },
    "competition_grades": {
      "Олимпиада 2015": 1.0,
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Мария Николаева Мерджанова",
    "grade": 17,
    "school": "ПМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2016": 7.5
    },
    "competition_grades": {
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Магдалена Владимирова Томова",
    "grade": 17,
    "school": "ОУ \"Св. П. Евтимий\"",
    "city": "Велико Търново",
    "competitions": {
      "Олимпиада 2015": 7.0,
      "Пролетни 2015": 21.75
    },
    "competition_grades": {
      "Олимпиада 2015": 1.0,
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Марина Филипова Зайкова",
    "grade": 17,
    "school": "ЕГ \"Пловдив\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2016": 7.25
    },
    "competition_grades": {
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Десислава Петрова Петрова",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2015": 15.0,
      "Есенни 2014": 16.25
    },
    "competition_grades": {
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Калина Йорданова Йорданова",
    "grade": 17,
    "school": "Първа ЕГ",
    "city": "Варна",
    "competitions": {
      "Пролетни 2017": 4.5
    },
    "competition_grades": {
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Йоана Атанасова Шомова",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2015": 13.5,
      "Есенни 2014": 13.5
    },
    "competition_grades": {
      "Пролетни 2015": 1.0,
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Димитър Венцеславов Вълков",
    "grade": 17,
    "school": "ППМГ \"Гео Милев\"",
    "city": "Стара Загора",
    "competitions": {
      "Пролетни 2018": 1.75
    },
    "competition_grades": {
      "Пролетни 2018": 3.0
    }
  },
  {
    "name": "Юлия Радославова Горанова",
    "grade": 17,
    "school": "ОУ \"Св. П. Евтимий\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2015": 22.5
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Александрина Свиленова Стоянова",
    "grade": 17,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2017": 2.25
    },
    "competition_grades": {
      "Есенни 2017": 3.0
    }
  },
  {
    "name": "Елизабет Великова Колева",
    "grade": 17,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Есенни 2017": 2.25
    },
    "competition_grades": {
      "Есенни 2017": 3.0
    }
  },
  {
    "name": "Румен Георгиев Азманов",
    "grade": 17,
    "school": "СОУ \"Георги Ал. Каравелов\"",
    "city": "Шивачево",
    "competitions": {
      "Олимпиада 2015": 16.75
    },
    "competition_grades": {
      "Олимпиада 2015": 1.0
    }
  },
  {
    "name": "Деница Георгиева Узунова",
    "grade": 17,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Есенни 2016": 5.25
    },
    "competition_grades": {
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Яна Калоянова Желязкова",
    "grade": 17,
    "school": "Първа ЕГ",
    "city": "Варна",
    "competitions": {
      "Есенни 2016": 5.25
    },
    "competition_grades": {
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Румен Атанасова Ангов",
    "grade": 17,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Есенни 2016": 5.0
    },
    "competition_grades": {
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Мария Апостолова Кукова",
    "grade": 17,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетни 2017": 3.5
    },
    "competition_grades": {
      "Пролетни 2017": 2.0
    }
  },
  {
    "name": "Николай Николов Пановски",
    "grade": 17,
    "school": "Прогимназия \"Св. Кл. Охридски\"",
    "city": "Бяла Слатина",
    "competitions": {
      "Олимпиада 2015": 14.0
    },
    "competition_grades": {
      "Олимпиада 2015": 1.0
    }
  },
  {
    "name": "Ивета Галинова Христова",
    "grade": 17,
    "school": "СОУ \"М. Райкович\"",
    "city": "Дряново",
    "competitions": {
      "Пролетни 2015": 18.0
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Катерина Росенова Василева",
    "grade": 17,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Олимпиада 2015": 13.0
    },
    "competition_grades": {
      "Олимпиада 2015": 1.0
    }
  },
  {
    "name": "Виктория Стоянова Спасова",
    "grade": 17,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2015": 17.0
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Аветис Давит Миконян",
    "grade": 17,
    "school": "НПГПТО \"М.В.Ломоносов\"",
    "city": "София",
    "competitions": {
      "Есенни 2016": 4.0
    },
    "competition_grades": {
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Рая Радославова Герганова",
    "grade": 17,
    "school": "ПМГ \"Н.Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетни 2015": 15.5
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Стефан Петков Василев",
    "grade": 17,
    "school": "ОУ \"П.Р.Славейков\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2015": 15.5
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Ваня Иванова Иванова",
    "grade": 17,
    "school": "СОУ \"Димитър Благоев\"",
    "city": "Свищов",
    "competitions": {
      "Олимпиада 2015": 11.5
    },
    "competition_grades": {
      "Олимпиада 2015": 1.0
    }
  },
  {
    "name": "Даниел Милчев Бумбалов",
    "grade": 17,
    "school": "СОУ \"Св. Кл. Охридски\"",
    "city": "Ямбол",
    "competitions": {
      "Олимпиада 2015": 11.25
    },
    "competition_grades": {
      "Олимпиада 2015": 1.0
    }
  },
  {
    "name": "Николета Ванева Иванова",
    "grade": 17,
    "school": "НПГПТО \"М.В.Ломоносов\"",
    "city": "София",
    "competitions": {
      "Есенни 2016": 3.5
    },
    "competition_grades": {
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Петко Цветомиров Цоков",
    "grade": 17,
    "school": "НПГПТО \"М.В.Ломоносов\"",
    "city": "София",
    "competitions": {
      "Есенни 2016": 3.5
    },
    "competition_grades": {
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Димитър Кръстинов Ангелов",
    "grade": 17,
    "school": "125 СУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2015": 10.75
    },
    "competition_grades": {
      "Олимпиада 2015": 1.0
    }
  },
  {
    "name": "Мартин Ивов Димитров",
    "grade": 17,
    "school": "ПМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетни 2015": 13.5
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Атанас Йорданов Кавазов",
    "grade": 17,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2018": 1.0
    },
    "competition_grades": {
      "Пролетни 2018": 3.0
    }
  },
  {
    "name": "Мария Тенева Минчева",
    "grade": 17,
    "school": "ППМГ \"Гео Милев\"",
    "city": "Стара Загора",
    "competitions": {
      "Пролетни 2018": 1.0
    },
    "competition_grades": {
      "Пролетни 2018": 3.0
    }
  },
  {
    "name": "Георги Георгиев Недялков",
    "grade": 17,
    "school": "НПГПТО \"М.В.Ломоносов\"",
    "city": "София",
    "competitions": {
      "Есенни 2016": 3.0
    },
    "competition_grades": {
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Ивет Стефанова Раданова",
    "grade": 17,
    "school": "ОУ \"П.Р.Славейков\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2015": 12.5
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Нети Добринова Крълева",
    "grade": 17,
    "school": "ОМГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2015": 12.5
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Димитър Павлов Пенев",
    "grade": 17,
    "school": "ПМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Пролетни 2015": 12.0
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Ния Владимирова Младенова",
    "grade": 17,
    "school": "СОУ \"Св. Патриарх Евтимий\"",
    "city": "Пловдив",
    "competitions": {
      "Олимпиада 2015": 8.75
    },
    "competition_grades": {
      "Олимпиада 2015": 1.0
    }
  },
  {
    "name": "Симеон Тодоров Тодоров",
    "grade": 17,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Есенни 2016": 2.75
    },
    "competition_grades": {
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Виктория Ралева Гарджева",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2014": 15.35
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Йоан Кръстев Кръстев",
    "grade": 17,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2015": 11.5
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Христина Бориславова Йовева",
    "grade": 17,
    "school": "НПГПТО \"М.В.Ломоносов\"",
    "city": "София",
    "competitions": {
      "Есенни 2016": 2.5
    },
    "competition_grades": {
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Александър Гоцев Костадинов",
    "grade": 17,
    "school": "104 ОУ",
    "city": "София",
    "competitions": {
      "Пролетни 2015": 10.5
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Михаил Християнов Христов",
    "grade": 17,
    "school": "ПМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Пролетни 2015": 10.5
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Моника Иванова Иванова",
    "grade": 17,
    "school": "ПМГ \"Н.Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетни 2015": 10.5
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Петър Станомиров Колев",
    "grade": 17,
    "school": "ОУ \"П.Р.Славейков\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2015": 10.5
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Рая – Мария Пламенова Минчева",
    "grade": 17,
    "school": "ОУ \"П.Р.Славейков\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2015": 10.0
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Бисер Тодоров Ангелов",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 1.0
    },
    "competition_grades": {
      "Есенни 2017": 3.0
    }
  },
  {
    "name": "Катерина Саматовна Бахтигалиева",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 1.0
    },
    "competition_grades": {
      "Есенни 2017": 3.0
    }
  },
  {
    "name": "Александър Миленов Манев",
    "grade": 17,
    "school": "ПМГ \"Иван Вазов\"",
    "city": "Добрич",
    "competitions": {
      "Пролетни 2015": 9.5
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Виктория Йорданова Пенева",
    "grade": 17,
    "school": "ПМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Пролетни 2015": 9.5
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Ина Веселинова Георгиева",
    "grade": 17,
    "school": "ОУ \"Св. П. Евтимий\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2015": 9.5
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Мартина Йорданова Христова",
    "grade": 17,
    "school": "ОУ \"НиколайПетрини\"",
    "city": "Ямбол",
    "competitions": {
      "Пролетни 2015": 9.5
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Веселин Мирославов Денчев",
    "grade": 17,
    "school": "СОУ \"М. Райкович\"",
    "city": "Дряново",
    "competitions": {
      "Пролетни 2015": 9.0
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Мария Василева Георгиева",
    "grade": 17,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2014": 11.5
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Габриела Петрова Петрова",
    "grade": 17,
    "school": "ПМГ \"Н.Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетни 2015": 8.5
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Денис Динчеров Къров",
    "grade": 17,
    "school": "ОУ\"В.Левски\"",
    "city": "Разград",
    "competitions": {
      "Пролетни 2015": 8.5
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Петър Тодоров Петров",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2015": 8.5
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Дорина Добрева Люцова",
    "grade": 17,
    "school": "СОУ \"М. Райкович\"",
    "city": "Дряново",
    "competitions": {
      "Пролетни 2015": 8.0
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Даниел Руменов Досев",
    "grade": 17,
    "school": "ОУ\"В.Левски\"",
    "city": "Разград",
    "competitions": {
      "Пролетни 2015": 7.5
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Тони Владимиров Иванов",
    "grade": 17,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 10.0
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Иван Димитров Драголов",
    "grade": 17,
    "school": "ПМГ \"Н.Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетни 2015": 7.25
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Светозар Тодоров Тодоров",
    "grade": 17,
    "school": "ОУ \"Отец Паисий\"",
    "city": "Силистра",
    "competitions": {
      "Олимпиада 2015": 5.0
    },
    "competition_grades": {
      "Олимпиада 2015": 1.0
    }
  },
  {
    "name": "Павла Милославова Манова",
    "grade": 17,
    "school": "СОУ „Иван Вазов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 8.85
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Цветин Кръстев Кръстев",
    "grade": 17,
    "school": "ОУ \"Бачо Киро\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2015": 6.25
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Найден Божидаров Такев",
    "grade": 17,
    "school": "ГПЧЕ",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 7.5
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Анна Каренинна Ованнисян",
    "grade": 17,
    "school": "СОУ „Иван Вазов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 7.45
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Маргарита Тодорова Петрова",
    "grade": 17,
    "school": "СОУ \"Хр. Смирненски\"",
    "city": "Гулянци",
    "competitions": {
      "Есенни 2014": 7.25
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Георги Любомиров Петров",
    "grade": 17,
    "school": "ОУ \"Св. Иван Рилски\"",
    "city": "Перник",
    "competitions": {
      "Есенни 2014": 7.1
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Павел Якимов Павлов",
    "grade": 17,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2014": 7.0
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Мария Красимирова Николова",
    "grade": 17,
    "school": "ГПЧЕ",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 6.9
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Алекса Валентинова Кирова",
    "grade": 17,
    "school": "ПГПАЕ\"Гео Милев\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2017": 0.5
    },
    "competition_grades": {
      "Есенни 2017": 3.0
    }
  },
  {
    "name": "Антон Цветанов Цеков",
    "grade": 17,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 0.5
    },
    "competition_grades": {
      "Есенни 2017": 3.0
    }
  },
  {
    "name": "Огняна Тонева Габровска",
    "grade": 17,
    "school": "СОУ „Иван Вазов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 6.2
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Христо Христов Минев",
    "grade": 17,
    "school": "СОУ „Иван Вазов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 5.9
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Марио Станиславов Йорданов",
    "grade": 17,
    "school": "ОУ \"Св. Иван Рилски\"",
    "city": "Перник",
    "competitions": {
      "Есенни 2014": 5.75
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Даяна Ивайлова Димитрова",
    "grade": 17,
    "school": "СОУ „Иван Вазов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 5.6
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Ирен Калин Костова",
    "grade": 17,
    "school": "СОУ „Иван Вазов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 5.6
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Георги Бориславов Игнатов",
    "grade": 17,
    "school": "СОУ „Иван Вазов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 5.5
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Дилиан Каменов Пенков",
    "grade": 17,
    "school": "ПМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2014": 5.45
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Есма Кудрет Яшарова",
    "grade": 17,
    "school": "СОУ „Иван Вазов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 5.45
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Анатоли Яворов Димов",
    "grade": 17,
    "school": "ПМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Пролетни 2015": 4.0
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Александър Николаев Василев",
    "grade": 17,
    "school": "104 ОУ",
    "city": "София",
    "competitions": {
      "Есенни 2014": 5.25
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Николай Антонов Славчев",
    "grade": 17,
    "school": "ОУ \"Христо Ботев\"",
    "city": "Дунавци",
    "competitions": {
      "Есенни 2014": 5.25
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Антоан Димитров Петров",
    "grade": 17,
    "school": "ПМГ \"Проф. Ем. Иванов\"",
    "city": "Кюстендил",
    "competitions": {
      "Есенни 2014": 5.2
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Камелия Петрова Григорова",
    "grade": 17,
    "school": "СОУ „Иван Вазов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 5.1
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Гергана Светлинова Пелова",
    "grade": 17,
    "school": "СОУ „Стоян Заимов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 4.95
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Мария Александрова Петкова",
    "grade": 17,
    "school": "СОУ „Стоян Заимов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 4.7
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Дариела Росенова Спасова",
    "grade": 17,
    "school": "ОУ \"Св. Иван Рилски\"",
    "city": "Перник",
    "competitions": {
      "Есенни 2014": 4.15
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Галин Иванов Георгиев",
    "grade": 17,
    "school": "СОУ „Иван Вазов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 4.0
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Тодор Асенов Качков",
    "grade": 17,
    "school": "ОУ \"Христо Ботев\"",
    "city": "Дунавци",
    "competitions": {
      "Есенни 2014": 3.75
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Зорница Данаилова Борисова",
    "grade": 17,
    "school": "ПМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Пролетни 2015": 2.5
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Аника Атанасова Димитрова",
    "grade": 17,
    "school": "ГПЧЕ",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 2.85
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Диана Сергеева Александрова",
    "grade": 17,
    "school": "ОУ \"Св. Иван Рилски\"",
    "city": "Перник",
    "competitions": {
      "Есенни 2014": 2.85
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Стефан Стефанов Попов",
    "grade": 17,
    "school": "104 ОУ",
    "city": "София",
    "competitions": {
      "Пролетни 2015": 1.75
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Деница Емилова Иванова",
    "grade": 17,
    "school": "СОУ „Иван Вазов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 2.25
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Иван Марио Христов",
    "grade": 17,
    "school": "СОУ „Иван Вазов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 2.2
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Явор Бориславов Георгиев",
    "grade": 17,
    "school": "СОУ \"Хр. Смирненски\"",
    "city": "Гулянци",
    "competitions": {
      "Есенни 2014": 2.1
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Теодора Детелинова Димитрова",
    "grade": 17,
    "school": "СОУ \"Св. Кл. Охридски\"",
    "city": "Троян",
    "competitions": {
      "Есенни 2014": 1.85
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Дениса Николаева Танкова",
    "grade": 17,
    "school": "СОУ \"Св. Кл. Охридски\"",
    "city": "Троян",
    "competitions": {
      "Есенни 2014": 1.75
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Десислава Димитрова Илиева",
    "grade": 17,
    "school": "СОУ „Иван Вазов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 1.75
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Ана Георгиева Апостолова",
    "grade": 17,
    "school": "СОУ „Иван Вазов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 1.65
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Мария Денисова Бохотлиева",
    "grade": 17,
    "school": "СОУ „Иван Вазов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 1.5
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Йоан Красимиров Вълов",
    "grade": 17,
    "school": "СОУ „Иван Вазов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 1.25
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Мария Петева Нанковска",
    "grade": 17,
    "school": "СОУ \"Анастасия Димитрова\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 1.2
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Християн Владиславов Тенев",
    "grade": 17,
    "school": "СОУ „Иван Вазов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 1.2
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Пламен Мирославов Светославов",
    "grade": 17,
    "school": "СОУ \"Хр. Смирненски\"",
    "city": "Гулянци",
    "competitions": {
      "Есенни 2014": 1.0
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Славина Василева Славкова",
    "grade": 17,
    "school": "СОУ \"Хр. Смирненски\"",
    "city": "Гулянци",
    "competitions": {
      "Есенни 2014": 1.0
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Благовеста Нивалинова Маркова",
    "grade": 17,
    "school": "СОУ „Иван Вазов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 0.75
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Надя Красимирова Георгиева",
    "grade": 17,
    "school": "СОУ \"Хр. Смирненски\"",
    "city": "Гулянци",
    "competitions": {
      "Есенни 2014": 0.75
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Снежана Кунчева Антонова",
    "grade": 17,
    "school": "СОУ „Иван Вазов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 0.75
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Борис Димов Димитров",
    "grade": 17,
    "school": "ОУ\"В.Левски\"",
    "city": "Разград",
    "competitions": {
      "Пролетни 2015": 0.5
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Марио Людмилов Василев",
    "grade": 17,
    "school": "СОУ \"Хр. Смирненски\"",
    "city": "Гулянци",
    "competitions": {
      "Есенни 2014": 0.6
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Ралица Руменова Атанасова",
    "grade": 17,
    "school": "СОУ „Иван Вазов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 0.5
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Детелина Николова Николова",
    "grade": 17,
    "school": "СОУ \"Хр. Смирненски\"",
    "city": "Гулянци",
    "competitions": {
      "Есенни 2014": 0.25
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Дарина Христова Славова",
    "grade": 17,
    "school": "ОУ \"НиколайПетрини\"",
    "city": "Ямбол",
    "competitions": {
      "Пролетни 2015": 0.0
    },
    "competition_grades": {
      "Пролетни 2015": 1.0
    }
  },
  {
    "name": "Женя Теодорова Панова",
    "grade": 17,
    "school": "СОУ \"Анастасия Димитрова\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 0.0
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Илонка Георгиева Георгиева",
    "grade": 17,
    "school": "НПГПТО \"М.В.Ломоносов\"",
    "city": "София",
    "competitions": {
      "Есенни 2016": 0.0
    },
    "competition_grades": {
      "Есенни 2016": 2.0
    }
  },
  {
    "name": "Лора Бисерова Иванова",
    "grade": 17,
    "school": "СОУ \"Хр. Смирненски\"",
    "city": "Гулянци",
    "competitions": {
      "Есенни 2014": 0.0
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Никол Руменова Стоянова",
    "grade": 17,
    "school": "СОУ „Иван Вазов“",
    "city": "Плевен",
    "competitions": {
      "Есенни 2014": 0.0
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Радослав Руменов Дойчинов",
    "grade": 17,
    "school": "НПГПТО \"М.В.Ломоносов\"",
    "city": "София",
    "competitions": {
      "Есенни 2017": 0.0
    },
    "competition_grades": {
      "Есенни 2017": 4.0
    }
  },
  {
    "name": "Румяна Виолинова Димова",
    "grade": 17,
    "school": "СОУ \"Хр. Смирненски\"",
    "city": "Гулянци",
    "competitions": {
      "Есенни 2014": 0.0
    },
    "competition_grades": {
      "Есенни 2014": 1.0
    }
  },
  {
    "name": "Георги Мирославов Александров",
    "grade": 18,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2019": 90.0,
      "Пролетни 2019": 26.0,
      "Есенни 2018": 25.5,
      "Олимпиада 2018": 83.5,
      "Пролетни 2018": 24.0,
      "Есенни 2017": 22.8,
      "Олимпиада 2017": 65.35,
      "Пролетни 2017": 18.4,
      "Есенни 2016": 24.5,
      "Олимпиада 2016": 27.5,
      "Пролетни 2016": 27.5,
      "Есенни 2015": 25.25,
      "Олимпиада 2014": 25.5,
      "Пролетни 2014": 20.0,
      "Есенни 2013": 23.25
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 6.0,
      "Есенни 2018": 6.0,
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 6.0,
      "Есенни 2017": 6.0,
      "Олимпиада 2017": 4.0,
      "Пролетни 2017": 6.0,
      "Есенни 2016": 6.0,
      "Олимпиада 2016": 2.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Олимпиада 2014": 1.0,
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Владимира Пламенова Иринчева",
    "grade": 18,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2019": 79.75,
      "Пролетни 2019": 14.8,
      "Есенни 2018": 28.5,
      "Олимпиада 2018": 71.5,
      "Пролетни 2018": 12.5,
      "Есенни 2017": 11.5,
      "Олимпиада 2017": 29.0,
      "Пролетни 2017": 26.8,
      "Есенни 2016": 29.0,
      "Олимпиада 2016": 16.75,
      "Пролетни 2016": 23.5,
      "Есенни 2015": 30.0,
      "Пролетни 2014": 18.5,
      "Есенни 2013": 26.5
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 6.0,
      "Есенни 2018": 6.0,
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 6.0,
      "Есенни 2017": 6.0,
      "Олимпиада 2017": 3.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Олимпиада 2016": 2.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Стефан Тодоров Иванов",
    "grade": 18,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2019": 72.2,
      "Пролетни 2019": 21.0,
      "Есенни 2018": 28.0,
      "Олимпиада 2018": 79.0,
      "Пролетни 2018": 26.0,
      "Олимпиада 2017": 25.8,
      "Пролетни 2017": 23.4,
      "Есенни 2016": 18.5,
      "Олимпиада 2016": 15.0,
      "Пролетни 2016": 27.0,
      "Есенни 2015": 26.5,
      "Олимпиада 2014": 23.5,
      "Пролетни 2014": 25.25,
      "Есенни 2013": 21.0
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 6.0,
      "Есенни 2018": 6.0,
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 6.0,
      "Олимпиада 2017": 4.0,
      "Пролетни 2017": 6.0,
      "Есенни 2016": 6.0,
      "Олимпиада 2016": 2.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Олимпиада 2014": 1.0,
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Александър Тонев Кръстев",
    "grade": 18,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Олимпиада 2019": 82.6,
      "Пролетни 2019": 16.5,
      "Есенни 2018": 24.5,
      "Олимпиада 2018": 64.0,
      "Пролетни 2018": 26.5,
      "Есенни 2017": 19.0,
      "Олимпиада 2017": 27.0
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 6.0,
      "Есенни 2018": 6.0,
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Олимпиада 2017": 3.0
    }
  },
  {
    "name": "Калоян Боянов Ботев",
    "grade": 18,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Олимпиада 2019": 63.4,
      "Пролетни 2019": 22.5,
      "Есенни 2018": 15.0,
      "Олимпиада 2018": 59.5,
      "Пролетни 2018": 23.0,
      "Есенни 2017": 26.5,
      "Олимпиада 2017": 30.0,
      "Пролетни 2017": 27.0,
      "Есенни 2016": 28.0,
      "Олимпиада 2016": 17.5,
      "Пролетни 2016": 23.5,
      "Есенни 2015": 29.0,
      "Олимпиада 2014": 18.0,
      "Пролетни 2014": 20.0,
      "Есенни 2013": 12.75
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 6.0,
      "Есенни 2018": 6.0,
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Олимпиада 2017": 3.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Олимпиада 2016": 2.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Олимпиада 2014": 1.0,
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Любомир Бойков Шойлев",
    "grade": 18,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2019": 72.6,
      "Пролетни 2019": 14.6,
      "Есенни 2018": 20.0,
      "Олимпиада 2018": 32.0,
      "Пролетни 2018": 18.5,
      "Есенни 2017": 27.25,
      "Олимпиада 2017": 29.0,
      "Пролетни 2017": 24.8,
      "Есенни 2016": 24.75,
      "Олимпиада 2016": 14.0,
      "Пролетни 2016": 18.0,
      "Есенни 2015": 28.75,
      "Олимпиада 2014": 20.75,
      "Пролетни 2014": 19.25
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 6.0,
      "Есенни 2018": 6.0,
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 6.0,
      "Есенни 2017": 4.0,
      "Олимпиада 2017": 3.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Олимпиада 2016": 2.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Олимпиада 2014": 1.0,
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Николай Дамянов Колев",
    "grade": 18,
    "school": "АЕГ \"Гео Милев\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2019": 70.5,
      "Пролетни 2019": 23.0,
      "Есенни 2018": 20.5,
      "Олимпиада 2018": 34.5,
      "Пролетни 2018": 16.0,
      "Есенни 2017": 10.4,
      "Олимпиада 2017": 24.9,
      "Пролетни 2017": 23.55,
      "Есенни 2016": 29.75,
      "Пролетни 2015": 25.0
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 5.0,
      "Есенни 2018": 5.0,
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 6.0,
      "Есенни 2017": 6.0,
      "Олимпиада 2017": 3.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2015": 2.0
    }
  },
  {
    "name": "Никола Иванов Янакиев",
    "grade": 18,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2019": 69.1,
      "Пролетни 2019": 18.5,
      "Есенни 2018": 22.0,
      "Олимпиада 2018": 33.5,
      "Пролетни 2018": 21.5,
      "Есенни 2017": 21.25
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 6.0,
      "Есенни 2018": 6.0,
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 5.0
    }
  },
  {
    "name": "Силви Мартинова Койчева",
    "grade": 18,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Олимпиада 2019": 49.6,
      "Пролетни 2019": 11.0,
      "Есенни 2018": 29.0,
      "Олимпиада 2018": 33.5,
      "Пролетни 2018": 25.75,
      "Есенни 2017": 4.8,
      "Олимпиада 2017": 17.7,
      "Пролетни 2017": 24.0,
      "Есенни 2016": 24.5,
      "Олимпиада 2016": 29.5,
      "Пролетни 2016": 27.0,
      "Есенни 2015": 27.0,
      "Олимпиада 2014": 22.8,
      "Пролетни 2014": 20.75,
      "Есенни 2013": 27.5
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 5.0,
      "Есенни 2018": 5.0,
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 5.0,
      "Есенни 2017": 6.0,
      "Олимпиада 2017": 4.0,
      "Пролетни 2017": 4.0,
      "Есенни 2016": 4.0,
      "Олимпиада 2016": 3.0,
      "Пролетни 2016": 3.0,
      "Есенни 2015": 3.0,
      "Олимпиада 2014": 1.0,
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Нина Росенова Димова",
    "grade": 18,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2019": 63.05,
      "Пролетни 2019": 8.0,
      "Есенни 2018": 13.5,
      "Олимпиада 2018": 25.0,
      "Пролетни 2018": 18.5,
      "Есенни 2017": 19.75,
      "Олимпиада 2017": 21.9,
      "Пролетни 2017": 19.8,
      "Есенни 2016": 18.0,
      "Пролетни 2016": 16.0,
      "Есенни 2015": 22.25
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 6.0,
      "Есенни 2018": 6.0,
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Олимпиада 2017": 3.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Денислав Георгиев Георгиев",
    "grade": 18,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2019": 61.75,
      "Пролетни 2019": 5.4,
      "Есенни 2018": 15.0,
      "Олимпиада 2018": 26.5,
      "Пролетни 2018": 23.25,
      "Есенни 2017": 18.25,
      "Олимпиада 2017": 24.1
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 6.0,
      "Есенни 2018": 6.0,
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 5.0,
      "Есенни 2017": 5.0,
      "Олимпиада 2017": 3.0
    }
  },
  {
    "name": "Кристиян Матеев Попов",
    "grade": 18,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2019": 40.2,
      "Пролетни 2019": 8.6,
      "Есенни 2018": 29.5,
      "Олимпиада 2018": 31.0,
      "Пролетни 2018": 18.0,
      "Пролетни 2017": 19.75,
      "Есенни 2016": 23.5,
      "Пролетни 2016": 15.5
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 5.0,
      "Есенни 2018": 5.0,
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0
    }
  },
  {
    "name": "Теодора Здравкова Серафимова",
    "grade": 18,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2019": 52.0,
      "Пролетни 2019": 1.5,
      "Есенни 2018": 19.5,
      "Олимпиада 2018": 11.0,
      "Пролетни 2018": 7.5,
      "Есенни 2017": 22.0,
      "Олимпиада 2017": 23.3,
      "Пролетни 2017": 12.05,
      "Есенни 2016": 20.5,
      "Пролетни 2016": 15.0,
      "Есенни 2015": 18.25
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 6.0,
      "Есенни 2018": 5.0,
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Олимпиада 2017": 3.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Петър Димитров Димитров",
    "grade": 18,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2019": 25.3,
      "Есенни 2018": 29.5,
      "Олимпиада 2018": 53.75,
      "Пролетни 2018": 16.5,
      "Олимпиада 2017": 29.4,
      "Пролетни 2017": 28.5,
      "Есенни 2016": 27.25,
      "Олимпиада 2016": 24.0,
      "Пролетни 2016": 23.5,
      "Есенни 2015": 27.0
    },
    "competition_grades": {
      "Пролетни 2019": 6.0,
      "Есенни 2018": 6.0,
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 6.0,
      "Олимпиада 2017": 3.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Олимпиада 2016": 2.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Михаела Николова Димитрова",
    "grade": 18,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Олимпиада 2019": 22.5,
      "Пролетни 2019": 13.85,
      "Есенни 2018": 9.5,
      "Олимпиада 2018": 33.5,
      "Пролетни 2018": 25.25,
      "Есенни 2017": 21.5,
      "Олимпиада 2017": 26.0,
      "Пролетни 2017": 19.5,
      "Есенни 2016": 23.0,
      "Олимпиада 2016": 15.5,
      "Пролетни 2016": 24.0,
      "Есенни 2015": 17.75,
      "Олимпиада 2014": 21.5
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 5.0,
      "Есенни 2018": 6.0,
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Олимпиада 2017": 3.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Олимпиада 2016": 2.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Олимпиада 2014": 1.0
    }
  },
  {
    "name": "Пламен Тодоров Иванов",
    "grade": 18,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2019": 2.2,
      "Есенни 2018": 20.0,
      "Олимпиада 2018": 62.5,
      "Пролетни 2018": 26.0,
      "Есенни 2017": 28.0,
      "Олимпиада 2017": 29.1,
      "Пролетни 2017": 22.55,
      "Есенни 2016": 25.0,
      "Олимпиада 2016": 20.5,
      "Пролетни 2016": 22.0,
      "Есенни 2015": 29.75,
      "Олимпиада 2014": 28.75,
      "Пролетни 2014": 20.0,
      "Есенни 2013": 25.0
    },
    "competition_grades": {
      "Пролетни 2019": 6.0,
      "Есенни 2018": 6.0,
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Олимпиада 2017": 3.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Олимпиада 2016": 2.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Олимпиада 2014": 1.0,
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Йоана Николаева Николова",
    "grade": 18,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2019": 17.5,
      "Есенни 2018": 30.0,
      "Олимпиада 2018": 26.5,
      "Пролетни 2018": 22.75,
      "Есенни 2017": 24.5,
      "Олимпиада 2017": 29.7,
      "Пролетни 2017": 21.05,
      "Есенни 2016": 24.5,
      "Олимпиада 2016": 16.5,
      "Пролетни 2016": 13.0,
      "Есенни 2015": 27.5,
      "Олимпиада 2014": 27.05,
      "Есенни 2013": 26.0
    },
    "competition_grades": {
      "Пролетни 2019": 5.0,
      "Есенни 2018": 5.0,
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Олимпиада 2017": 3.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Олимпиада 2016": 2.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Олимпиада 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Иво Томас Зерков",
    "grade": 18,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2018": 57.75,
      "Пролетни 2018": 28.0,
      "Есенни 2017": 6.0,
      "Олимпиада 2017": 40.5,
      "Пролетни 2017": 28.3,
      "Есенни 2016": 25.0
    },
    "competition_grades": {
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 5.0,
      "Есенни 2017": 6.0,
      "Олимпиада 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0
    }
  },
  {
    "name": "Николай Николаев Миладинов",
    "grade": 18,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2019": 13.5,
      "Есенни 2018": 25.5,
      "Олимпиада 2018": 22.5,
      "Есенни 2017": 17.5,
      "Пролетни 2017": 4.5,
      "Есенни 2016": 22.5,
      "Пролетни 2016": 12.0
    },
    "competition_grades": {
      "Пролетни 2019": 5.0,
      "Есенни 2018": 5.0,
      "Олимпиада 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0
    }
  },
  {
    "name": "Владимир Николаев Тошев",
    "grade": 18,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2019": 35.45,
      "Пролетни 2018": 14.0,
      "Олимпиада 2016": 11.5,
      "Олимпиада 2014": 10.75,
      "Пролетни 2014": 14.25
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0,
      "Пролетни 2018": 4.0,
      "Олимпиада 2016": 2.0,
      "Олимпиада 2014": 1.0,
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Георги Георгиев Йоков",
    "grade": 18,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Есенни 2018": 18.0,
      "Олимпиада 2018": 29.5,
      "Есенни 2017": 21.25,
      "Олимпиада 2017": 24.6,
      "Пролетни 2017": 20.55,
      "Есенни 2016": 20.0,
      "Пролетни 2016": 15.0,
      "Есенни 2015": 21.75
    },
    "competition_grades": {
      "Есенни 2018": 6.0,
      "Олимпиада 2018": 4.0,
      "Есенни 2017": 4.0,
      "Олимпиада 2017": 3.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Симеон Деянов Василев",
    "grade": 18,
    "school": "91 НЕГ",
    "city": "София",
    "competitions": {
      "Пролетни 2019": 4.4,
      "Олимпиада 2018": 34.5,
      "Пролетни 2018": 14.0,
      "Есенни 2017": 19.5,
      "Олимпиада 2017": 28.5,
      "Пролетни 2017": 17.25,
      "Есенни 2016": 23.5
    },
    "competition_grades": {
      "Пролетни 2019": 6.0,
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Олимпиада 2017": 3.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0
    }
  },
  {
    "name": "Климент Дианов Костов",
    "grade": 18,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Олимпиада 2018": 31.5,
      "Пролетни 2018": 20.5,
      "Есенни 2017": 18.5,
      "Олимпиада 2017": 26.5,
      "Есенни 2016": 24.25,
      "Олимпиада 2016": 27.0,
      "Пролетни 2016": 25.0,
      "Есенни 2015": 23.5,
      "Олимпиада 2014": 24.05,
      "Пролетни 2014": 21.0,
      "Есенни 2013": 21.75
    },
    "competition_grades": {
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 5.0,
      "Есенни 2017": 4.0,
      "Олимпиада 2017": 4.0,
      "Есенни 2016": 3.0,
      "Олимпиада 2016": 3.0,
      "Пролетни 2016": 3.0,
      "Есенни 2015": 2.0,
      "Олимпиада 2014": 1.0,
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Христо Иванов Георгиев",
    "grade": 18,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Олимпиада 2019": 6.6,
      "Пролетни 2019": 2.7,
      "Есенни 2018": 18.0,
      "Пролетни 2018": 8.0,
      "Есенни 2017": 19.0,
      "Олимпиада 2017": 21.5,
      "Пролетни 2017": 23.55,
      "Есенни 2016": 20.75,
      "Пролетни 2016": 14.25
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 5.0,
      "Есенни 2018": 5.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Олимпиада 2017": 3.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0
    }
  },
  {
    "name": "Никола Стефанов Колев",
    "grade": 18,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Олимпиада 2019": 15.7,
      "Пролетни 2019": 5.4,
      "Есенни 2018": 14.0,
      "Пролетни 2018": 6.5,
      "Есенни 2017": 12.0,
      "Пролетни 2017": 8.75,
      "Есенни 2016": 11.5,
      "Пролетни 2016": 6.25,
      "Есенни 2015": 7.25
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0,
      "Пролетни 2019": 5.0,
      "Есенни 2018": 5.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Асен Николаев Рачев",
    "grade": 18,
    "school": "Първа ЕГ",
    "city": "Варна",
    "competitions": {
      "Олимпиада 2019": 13.7,
      "Есенни 2018": 19.0,
      "Пролетни 2018": 12.5,
      "Есенни 2017": 9.75,
      "Пролетни 2017": 9.5,
      "Есенни 2016": 14.0,
      "Пролетни 2016": 9.0,
      "Олимпиада 2014": 18.65
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0,
      "Есенни 2018": 5.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Олимпиада 2014": 1.0
    }
  },
  {
    "name": "Георги Мирославов Вичев",
    "grade": 18,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2019": 14.85,
      "Есенни 2018": 17.5,
      "Пролетни 2018": 12.75,
      "Есенни 2017": 13.5
    },
    "competition_grades": {
      "Пролетни 2019": 5.0,
      "Есенни 2018": 5.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0
    }
  },
  {
    "name": "Мартин Методиев Цветков",
    "grade": 18,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2018": 21.0,
      "Пролетни 2018": 24.25,
      "Есенни 2017": 14.25,
      "Олимпиада 2017": 24.4,
      "Пролетни 2017": 13.55,
      "Есенни 2016": 20.0
    },
    "competition_grades": {
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Олимпиада 2017": 3.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0
    }
  },
  {
    "name": "Маргарита Стефанова Моллова",
    "grade": 18,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Пролетни 2019": 2.95,
      "Есенни 2018": 24.0,
      "Пролетни 2018": 10.0,
      "Есенни 2017": 9.0,
      "Пролетни 2017": 12.05,
      "Есенни 2016": 18.0,
      "Олимпиада 2016": 13.0,
      "Пролетни 2016": 15.5,
      "Есенни 2015": 24.0,
      "Пролетни 2014": 16.0
    },
    "competition_grades": {
      "Пролетни 2019": 5.0,
      "Есенни 2018": 5.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Олимпиада 2016": 2.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Бойко Красимиров Борисов",
    "grade": 18,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2017": 78.8,
      "Пролетни 2017": 20.5,
      "Есенни 2016": 25.3,
      "Олимпиада 2016": 28.0,
      "Пролетни 2016": 30.0,
      "Есенни 2015": 28.5
    },
    "competition_grades": {
      "Олимпиада 2017": 4.0,
      "Пролетни 2017": 6.0,
      "Есенни 2016": 6.0,
      "Олимпиада 2016": 2.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Александър Георгиев Георгиев 00",
    "grade": 18,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Есенни 2018": 15.0,
      "Олимпиада 2018": 9.0,
      "Пролетни 2018": 9.75,
      "Есенни 2017": 10.75,
      "Олимпиада 2017": 11.9,
      "Пролетни 2017": 10.75,
      "Есенни 2016": 13.75,
      "Пролетни 2016": 11.0,
      "Есенни 2015": 13.75
    },
    "competition_grades": {
      "Есенни 2018": 5.0,
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Олимпиада 2017": 3.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Мартина Мартин Георгиева",
    "grade": 18,
    "school": "ПМГ \"Акад. Ив. Гюзелев\"",
    "city": "Габрово",
    "competitions": {
      "Пролетни 2019": 3.2,
      "Есенни 2018": 12.0,
      "Олимпиада 2018": 9.5,
      "Пролетни 2018": 10.25,
      "Есенни 2017": 5.75,
      "Пролетни 2017": 13.0,
      "Есенни 2016": 12.5,
      "Олимпиада 2016": 12.0,
      "Пролетни 2016": 12.5,
      "Есенни 2015": 22.75,
      "Олимпиада 2014": 17.2,
      "Пролетни 2014": 20.75
    },
    "competition_grades": {
      "Пролетни 2019": 5.0,
      "Есенни 2018": 5.0,
      "Олимпиада 2018": 4.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Олимпиада 2016": 2.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Олимпиада 2014": 1.0,
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Драгни Драгнев Драгнев",
    "grade": 18,
    "school": "91 НЕГ",
    "city": "София",
    "competitions": {
      "Пролетни 2019": 9.75,
      "Есенни 2018": 14.5,
      "Пролетни 2018": 9.75,
      "Есенни 2017": 14.75,
      "Пролетни 2017": 7.8
    },
    "competition_grades": {
      "Пролетни 2019": 5.0,
      "Есенни 2018": 5.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0
    }
  },
  {
    "name": "Инна Петкова Петкова",
    "grade": 18,
    "school": "1 АЕГ",
    "city": "София",
    "competitions": {
      "Пролетни 2018": 15.25,
      "Есенни 2017": 19.75,
      "Олимпиада 2017": 28.5,
      "Пролетни 2017": 20.05,
      "Есенни 2016": 25.25,
      "Пролетни 2016": 15.25,
      "Есенни 2015": 22.0
    },
    "competition_grades": {
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Олимпиада 2017": 3.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Татяна Данаилова Борисова",
    "grade": 18,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетни 2019": 3.3,
      "Есенни 2018": 23.0,
      "Пролетни 2018": 4.5,
      "Есенни 2017": 5.5,
      "Пролетни 2017": 10.25,
      "Есенни 2016": 9.75
    },
    "competition_grades": {
      "Пролетни 2019": 5.0,
      "Есенни 2018": 5.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0
    }
  },
  {
    "name": "Мария Бориславова Петкова",
    "grade": 18,
    "school": "1 АЕГ",
    "city": "София",
    "competitions": {
      "Пролетни 2018": 17.0,
      "Есенни 2017": 17.5,
      "Олимпиада 2017": 27.0,
      "Пролетни 2017": 18.0,
      "Есенни 2016": 16.5,
      "Пролетни 2016": 15.25,
      "Есенни 2015": 25.0
    },
    "competition_grades": {
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Олимпиада 2017": 3.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Борис Евгениев Велковски",
    "grade": 18,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2018": 16.5,
      "Пролетни 2018": 8.0,
      "Есенни 2017": 11.0,
      "Пролетни 2017": 5.3,
      "Есенни 2016": 15.0,
      "Пролетни 2016": 9.25,
      "Есенни 2015": 23.5,
      "Пролетни 2014": 12.25
    },
    "competition_grades": {
      "Есенни 2018": 5.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Илко Светозаров Симеонов",
    "grade": 18,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2018": 15.0,
      "Есенни 2017": 16.0,
      "Пролетни 2017": 18.2,
      "Есенни 2016": 22.25,
      "Олимпиада 2016": 16.0,
      "Пролетни 2016": 19.0,
      "Есенни 2015": 27.5,
      "Пролетни 2014": 17.5,
      "Есенни 2013": 23.0
    },
    "competition_grades": {
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Олимпиада 2016": 2.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Нури Нурай Хасан",
    "grade": 18,
    "school": "ПМГ \"Акад. Боян Петканчин\"",
    "city": "Хасково",
    "competitions": {
      "Олимпиада 2019": 11.7,
      "Пролетни 2018": 7.0,
      "Пролетни 2017": 12.3
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0,
      "Пролетни 2018": 4.0,
      "Пролетни 2017": 3.0
    }
  },
  {
    "name": "Симона Даниелова Барокова",
    "grade": 18,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2019": 5.0,
      "Пролетни 2018": 13.5,
      "Есенни 2017": 14.5,
      "Пролетни 2017": 9.25,
      "Есенни 2016": 20.0,
      "Пролетни 2016": 10.25,
      "Есенни 2013": 25.75
    },
    "competition_grades": {
      "Пролетни 2019": 5.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Владислав Бранимиров Шабански",
    "grade": 18,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2019": 5.9,
      "Есенни 2018": 12.0,
      "Пролетни 2018": 5.75,
      "Есенни 2017": 3.75,
      "Пролетни 2017": 2.5
    },
    "competition_grades": {
      "Пролетни 2019": 5.0,
      "Есенни 2018": 5.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0
    }
  },
  {
    "name": "Ноел Николаев Томов",
    "grade": 18,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2019": 3.15,
      "Есенни 2018": 6.0,
      "Пролетни 2018": 9.5,
      "Есенни 2017": 10.25,
      "Пролетни 2017": 9.0,
      "Есенни 2016": 9.0,
      "Пролетни 2016": 15.5
    },
    "competition_grades": {
      "Пролетни 2019": 5.0,
      "Есенни 2018": 5.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0
    }
  },
  {
    "name": "Панайота Димитрова Вангелова",
    "grade": 18,
    "school": "СУ \"Васил Левски\"",
    "city": "Карлово",
    "competitions": {
      "Олимпиада 2019": 14.0
    },
    "competition_grades": {
      "Олимпиада 2019": 4.0
    }
  },
  {
    "name": "Катерина Петрова Костова",
    "grade": 18,
    "school": "91 НЕГ",
    "city": "София",
    "competitions": {
      "Пролетни 2019": 7.25,
      "Пролетни 2018": 16.5,
      "Есенни 2017": 9.0
    },
    "competition_grades": {
      "Пролетни 2019": 5.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0
    }
  },
  {
    "name": "Йоана Алексеева Зелова",
    "grade": 18,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2018": 21.0,
      "Олимпиада 2018": 2.0
    },
    "competition_grades": {
      "Есенни 2018": 5.0,
      "Олимпиада 2018": 4.0
    }
  },
  {
    "name": "Ангел Константинов Попов",
    "grade": 18,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2018": 16.5,
      "Пролетни 2017": 14.0,
      "Есенни 2016": 23.25,
      "Пролетни 2016": 18.25,
      "Есенни 2015": 22.5,
      "Пролетни 2014": 22.75,
      "Есенни 2013": 23.25
    },
    "competition_grades": {
      "Пролетни 2018": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Атанас Василев Атанасов",
    "grade": 18,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2018": 13.5,
      "Есенни 2017": 12.0,
      "Пролетни 2017": 9.75,
      "Есенни 2016": 21.75
    },
    "competition_grades": {
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0
    }
  },
  {
    "name": "Валентин Христов Генов",
    "grade": 18,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2019": 3.75,
      "Есенни 2018": 4.0,
      "Пролетни 2018": 2.0,
      "Есенни 2017": 7.5,
      "Пролетни 2017": 5.3,
      "Есенни 2016": 8.5,
      "Пролетни 2016": 6.25,
      "Есенни 2015": 12.0
    },
    "competition_grades": {
      "Пролетни 2019": 5.0,
      "Есенни 2018": 5.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Йоанна Стефанова Сърмаджиева",
    "grade": 18,
    "school": "1 АЕГ",
    "city": "София",
    "competitions": {
      "Пролетни 2018": 9.5,
      "Есенни 2017": 13.5,
      "Пролетни 2017": 10.5,
      "Есенни 2016": 12.5,
      "Пролетни 2016": 6.5,
      "Есенни 2015": 14.0
    },
    "competition_grades": {
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Константин Живков Мъгев",
    "grade": 18,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетни 2018": 5.5,
      "Есенни 2017": 8.0,
      "Пролетни 2017": 8.0,
      "Есенни 2016": 12.75,
      "Олимпиада 2016": 11.5,
      "Пролетни 2016": 17.5,
      "Есенни 2015": 25.0
    },
    "competition_grades": {
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Олимпиада 2016": 2.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Ива Иванова Попова",
    "grade": 18,
    "school": "91 НЕГ",
    "city": "София",
    "competitions": {
      "Пролетни 2019": 3.05,
      "Пролетни 2018": 14.5,
      "Есенни 2017": 7.5
    },
    "competition_grades": {
      "Пролетни 2019": 5.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0
    }
  },
  {
    "name": "Йоан Георгиев Саламбашев",
    "grade": 18,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2018": 8.5,
      "Есенни 2017": 3.5,
      "Пролетни 2017": 19.5,
      "Есенни 2016": 16.0,
      "Есенни 2015": 14.75,
      "Пролетни 2014": 5.0,
      "Есенни 2013": 17.25
    },
    "competition_grades": {
      "Пролетни 2018": 6.0,
      "Есенни 2017": 6.0,
      "Пролетни 2017": 4.0,
      "Есенни 2016": 4.0,
      "Есенни 2015": 3.0,
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Орлин Николаев Кучумбов",
    "grade": 18,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2017": 18.75,
      "Есенни 2016": 20.5,
      "Олимпиада 2016": 11.5,
      "Пролетни 2016": 13.25,
      "Есенни 2015": 29.0,
      "Олимпиада 2014": 29.25,
      "Пролетни 2014": 21.5,
      "Есенни 2013": 25.0
    },
    "competition_grades": {
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Олимпиада 2016": 2.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Олимпиада 2014": 1.0,
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Ивайло Георгиев Белчев",
    "grade": 18,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2018": 7.25,
      "Есенни 2017": 10.25,
      "Пролетни 2017": 5.25,
      "Есенни 2016": 12.0,
      "Пролетни 2016": 10.75,
      "Есенни 2015": 13.25
    },
    "competition_grades": {
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Лилия Асенова Пачалова",
    "grade": 18,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2017": 10.0,
      "Пролетни 2017": 11.05,
      "Есенни 2016": 20.75,
      "Пролетни 2016": 12.75,
      "Есенни 2015": 23.0
    },
    "competition_grades": {
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Петър Емилов Борисов",
    "grade": 18,
    "school": "ПМГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2018": 5.0,
      "Есенни 2017": 5.5,
      "Пролетни 2017": 7.25,
      "Есенни 2016": 15.25,
      "Пролетни 2016": 14.25,
      "Есенни 2015": 23.0
    },
    "competition_grades": {
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Ивалин Любенов Чобанов",
    "grade": 18,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2019": 4.5,
      "Пролетни 2018": 11.25
    },
    "competition_grades": {
      "Пролетни 2019": 5.0,
      "Пролетни 2018": 4.0
    }
  },
  {
    "name": "Герман Стоянов Стоянов",
    "grade": 18,
    "school": "ППМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Пролетни 2017": 13.75,
      "Есенни 2016": 22.25,
      "Пролетни 2016": 16.5,
      "Есенни 2015": 23.5,
      "Есенни 2013": 14.0
    },
    "competition_grades": {
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Правдомир Димитров Костов",
    "grade": 18,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2019": 1.7,
      "Есенни 2018": 2.5,
      "Пролетни 2018": 5.5,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.5
    },
    "competition_grades": {
      "Пролетни 2019": 5.0,
      "Есенни 2018": 5.0,
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0
    }
  },
  {
    "name": "Ангел Валентинов Щупалов",
    "grade": 18,
    "school": "1 АЕГ",
    "city": "София",
    "competitions": {
      "Пролетни 2018": 10.0,
      "Есенни 2017": 6.0,
      "Пролетни 2017": 7.5
    },
    "competition_grades": {
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0
    }
  },
  {
    "name": "Александър Атанасов Стоилов",
    "grade": 18,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2017": 12.5,
      "Есенни 2016": 19.75,
      "Пролетни 2016": 15.25,
      "Есенни 2015": 24.25
    },
    "competition_grades": {
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Калоян Бисеров Канев",
    "grade": 18,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2018": 2.5,
      "Есенни 2017": 16.0,
      "Пролетни 2017": 6.25
    },
    "competition_grades": {
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0
    }
  },
  {
    "name": "Николай Ананиев Жлебинков",
    "grade": 18,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Есенни 2017": 9.0,
      "Пролетни 2017": 5.75,
      "Есенни 2016": 16.25,
      "Пролетни 2016": 14.75
    },
    "competition_grades": {
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0
    }
  },
  {
    "name": "Ирина Михайлова Радева",
    "grade": 18,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 4.75,
      "Пролетни 2017": 18.55,
      "Пролетни 2016": 11.75,
      "Есенни 2015": 25.25
    },
    "competition_grades": {
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Димитър Николаев Колев",
    "grade": 18,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2018": 7.5,
      "Есенни 2017": 1.5,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 8.5,
      "Пролетни 2016": 9.5,
      "Есенни 2015": 13.5,
      "Пролетни 2014": 2.75,
      "Есенни 2013": 9.75
    },
    "competition_grades": {
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Антонио Николаев Жиланов",
    "grade": 18,
    "school": "1 АЕГ",
    "city": "София",
    "competitions": {
      "Есенни 2017": 7.5,
      "Пролетни 2017": 5.75,
      "Есенни 2016": 12.5,
      "Пролетни 2016": 7.5,
      "Есенни 2015": 16.5
    },
    "competition_grades": {
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Златомир Георгиев Папазов",
    "grade": 18,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2017": 12.75,
      "Есенни 2016": 12.75,
      "Пролетни 2016": 13.75,
      "Есенни 2015": 24.5
    },
    "competition_grades": {
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Иван Александров Дурев",
    "grade": 18,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2017": 14.0,
      "Олимпиада 2016": 11.25,
      "Пролетни 2016": 11.0
    },
    "competition_grades": {
      "Есенни 2017": 4.0,
      "Олимпиада 2016": 2.0,
      "Пролетни 2016": 2.0
    }
  },
  {
    "name": "Йоан Деянов Иванов",
    "grade": 18,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Есенни 2017": 3.5,
      "Пролетни 2017": 6.5,
      "Есенни 2016": 17.75,
      "Пролетни 2016": 9.25,
      "Есенни 2015": 16.0,
      "Пролетни 2014": 5.5
    },
    "competition_grades": {
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Калоян Иванов Колев",
    "grade": 18,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2018": 12.0,
      "Есенни 2015": 19.0
    },
    "competition_grades": {
      "Пролетни 2018": 4.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Петър Сашев Дженев",
    "grade": 18,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2019": 0.7,
      "Есенни 2018": 5.5,
      "Пролетни 2018": 2.75
    },
    "competition_grades": {
      "Пролетни 2019": 5.0,
      "Есенни 2018": 5.0,
      "Пролетни 2018": 4.0
    }
  },
  {
    "name": "Николай Пеев Шиваров",
    "grade": 18,
    "school": "ППМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2017": 7.25,
      "Есенни 2016": 15.25,
      "Пролетни 2016": 9.0,
      "Есенни 2015": 21.5,
      "Олимпиада 2014": 16.8,
      "Пролетни 2014": 15.5,
      "Есенни 2013": 19.25
    },
    "competition_grades": {
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Олимпиада 2014": 1.0,
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Рахат Бахитоглу Турганбек",
    "grade": 18,
    "school": "ПМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Олимпиада 2016": 18.5,
      "Пролетни 2016": 18.5,
      "Есенни 2015": 25.0,
      "Есенни 2014": 21.75,
      "Пролетни 2014": 10.5
    },
    "competition_grades": {
      "Олимпиада 2016": 2.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Есенни 2014": 2.0,
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Таня Атанасова Сейкова",
    "grade": 18,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2017": 2.75,
      "Пролетни 2017": 1.75,
      "Есенни 2016": 17.75,
      "Пролетни 2016": 9.5,
      "Есенни 2015": 18.0
    },
    "competition_grades": {
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Калоян Стайков Стайков",
    "grade": 18,
    "school": "91 НЕГ",
    "city": "София",
    "competitions": {
      "Пролетни 2017": 18.75,
      "Есенни 2016": 14.25
    },
    "competition_grades": {
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0
    }
  },
  {
    "name": "Денис Пламенов Петров",
    "grade": 18,
    "school": "ПМГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенни 2016": 11.5,
      "Пролетни 2016": 18.5,
      "Есенни 2015": 24.25,
      "Олимпиада 2014": 26.0,
      "Пролетни 2014": 16.75,
      "Есенни 2013": 25.75
    },
    "competition_grades": {
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Олимпиада 2014": 1.0,
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Мария Георгиева Милушева",
    "grade": 18,
    "school": "91 НЕГ",
    "city": "София",
    "competitions": {
      "Пролетни 2018": 2.0,
      "Есенни 2017": 10.0,
      "Пролетни 2017": 6.75
    },
    "competition_grades": {
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0,
      "Пролетни 2017": 3.0
    }
  },
  {
    "name": "Нели Николаева Маркович",
    "grade": 18,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2017": 12.25,
      "Пролетни 2016": 14.75,
      "Есенни 2015": 21.5,
      "Олимпиада 2014": 13.0,
      "Пролетни 2014": 19.75
    },
    "competition_grades": {
      "Пролетни 2017": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Олимпиада 2014": 1.0,
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Антоан Добри Матеин",
    "grade": 18,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2016": 19.75,
      "Пролетни 2016": 12.25,
      "Есенни 2015": 24.5
    },
    "competition_grades": {
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Кирил Иванов Иванов",
    "grade": 18,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетни 2017": 10.0,
      "Есенни 2016": 12.25,
      "Есенни 2015": 23.75,
      "Есенни 2013": 11.25
    },
    "competition_grades": {
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Есенни 2015": 2.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Виктор Божидаров Младенов",
    "grade": 18,
    "school": "91 НЕГ",
    "city": "София",
    "competitions": {
      "Пролетни 2018": 7.0,
      "Есенни 2017": 6.0
    },
    "competition_grades": {
      "Пролетни 2018": 4.0,
      "Есенни 2017": 5.0
    }
  },
  {
    "name": "Иван-Александър Веселинов Мавров",
    "grade": 18,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2016": 23.5,
      "Есенни 2015": 29.25,
      "Олимпиада 2014": 30.0,
      "Пролетни 2014": 22.0,
      "Есенни 2013": 24.75
    },
    "competition_grades": {
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Олимпиада 2014": 1.0,
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Атанас Константинов Стефанов",
    "grade": 18,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2017": 3.2,
      "Есенни 2016": 10.5,
      "Пролетни 2016": 17.25
    },
    "competition_grades": {
      "Есенни 2017": 6.0,
      "Есенни 2016": 4.0,
      "Пролетни 2016": 3.0
    }
  },
  {
    "name": "Ерика Стефанова Лишковска",
    "grade": 18,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2017": 10.0,
      "Есенни 2016": 5.0,
      "Пролетни 2016": 6.5,
      "Есенни 2015": 9.75
    },
    "competition_grades": {
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Надежда Пламенова Китипова",
    "grade": 18,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2016": 19.0,
      "Есенни 2015": 22.0,
      "Пролетни 2014": 24.75,
      "Есенни 2013": 25.5
    },
    "competition_grades": {
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Марко Василев Иванов",
    "grade": 18,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2016": 19.0,
      "Есенни 2015": 29.5
    },
    "competition_grades": {
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Цветомир Мирославов Гълъбов",
    "grade": 18,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2016": 9.0,
      "Пролетни 2016": 12.25,
      "Есенни 2015": 13.5
    },
    "competition_grades": {
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Михаил Бойков Спасов",
    "grade": 18,
    "school": "ПМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2016": 11.5,
      "Есенни 2015": 20.0,
      "Олимпиада 2014": 24.0,
      "Пролетни 2014": 14.0,
      "Есенни 2013": 18.5
    },
    "competition_grades": {
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Олимпиада 2014": 1.0,
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Боряна Валентинова Томова",
    "grade": 18,
    "school": "ПМГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Пролетни 2017": 3.5,
      "Есенни 2016": 8.5,
      "Есенни 2015": 15.75,
      "Есенни 2013": 12.25
    },
    "competition_grades": {
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0,
      "Есенни 2015": 2.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Ивана Свиленова Петкова",
    "grade": 18,
    "school": "91 НЕГ",
    "city": "София",
    "competitions": {
      "Пролетни 2018": 2.75,
      "Есенни 2016": 11.5
    },
    "competition_grades": {
      "Пролетни 2018": 5.0,
      "Есенни 2016": 4.0
    }
  },
  {
    "name": "Кристиян Владимиров Василев",
    "grade": 18,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2016": 15.75,
      "Есенни 2015": 25.75
    },
    "competition_grades": {
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Йосиф Ахмад Ал-Сейфи",
    "grade": 18,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Есенни 2016": 10.75,
      "Есенни 2015": 17.0,
      "Пролетни 2014": 10.25
    },
    "competition_grades": {
      "Есенни 2016": 3.0,
      "Есенни 2015": 2.0,
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Виктор Емилов Райчев",
    "grade": 18,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2017": 4.0,
      "Пролетни 2016": 12.25,
      "Пролетни 2014": 20.25
    },
    "competition_grades": {
      "Есенни 2017": 4.0,
      "Пролетни 2016": 2.0,
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Мариета Петрова Петрова",
    "grade": 18,
    "school": "ПМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2016": 11.75,
      "Есенни 2015": 24.5,
      "Есенни 2013": 18.0
    },
    "competition_grades": {
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Габриела Петрова Стефанова",
    "grade": 18,
    "school": "СУ \"Иван Вазов\"",
    "city": "Вършец",
    "competitions": {
      "Пролетни 2019": 1.9,
      "Пролетни 2017": 2.5
    },
    "competition_grades": {
      "Пролетни 2019": 5.0,
      "Пролетни 2017": 3.0
    }
  },
  {
    "name": "Мартин Веселинов Стоичков",
    "grade": 18,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Пролетни 2018": 5.0
    },
    "competition_grades": {
      "Пролетни 2018": 5.0
    }
  },
  {
    "name": "Калин Красимиров Димитров",
    "grade": 18,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2019": 1.25,
      "Пролетни 2018": 2.0
    },
    "competition_grades": {
      "Пролетни 2019": 5.0,
      "Пролетни 2018": 4.0
    }
  },
  {
    "name": "Васил Пламенов Начев",
    "grade": 18,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2016": 9.75,
      "Пролетни 2016": 9.5
    },
    "competition_grades": {
      "Есенни 2016": 3.0,
      "Пролетни 2016": 2.0
    }
  },
  {
    "name": "Анна-Мария Василева Петрова",
    "grade": 18,
    "school": "1 АЕГ",
    "city": "София",
    "competitions": {
      "Пролетни 2016": 10.5,
      "Есенни 2015": 21.75
    },
    "competition_grades": {
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Жаклин Димитрова Проданова",
    "grade": 18,
    "school": "ПМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2016": 7.25,
      "Есенни 2015": 20.0,
      "Есенни 2013": 22.25
    },
    "competition_grades": {
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Мартин Соколов Николов",
    "grade": 18,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Есенни 2015": 28.5,
      "Пролетни 2014": 18.25
    },
    "competition_grades": {
      "Есенни 2015": 2.0,
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Александър Александров Лимонов",
    "grade": 18,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2017": 3.0,
      "Есенни 2016": 6.5
    },
    "competition_grades": {
      "Есенни 2017": 4.0,
      "Есенни 2016": 3.0
    }
  },
  {
    "name": "Владимир Александров Николов",
    "grade": 18,
    "school": "ПМГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенни 2016": 4.25,
      "Есенни 2015": 18.25,
      "Есенни 2013": 19.25
    },
    "competition_grades": {
      "Есенни 2016": 3.0,
      "Есенни 2015": 2.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Петър Иванов Иванов",
    "grade": 18,
    "school": "1 АЕГ",
    "city": "София",
    "competitions": {
      "Пролетни 2016": 9.5,
      "Есенни 2015": 19.0
    },
    "competition_grades": {
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Кристиан Красимир Деянов",
    "grade": 18,
    "school": "ПМГ \"Ат. Радев\"",
    "city": "Ямбол",
    "competitions": {
      "Есенни 2016": 13.25
    },
    "competition_grades": {
      "Есенни 2016": 3.0
    }
  },
  {
    "name": "Стефан Димитров Георгиев",
    "grade": 18,
    "school": "ГПЧЕ \"Йоан Екзарх\"",
    "city": "Варна",
    "competitions": {
      "Олимпиада 2018": 3.0
    },
    "competition_grades": {
      "Олимпиада 2018": 4.0
    }
  },
  {
    "name": "Мария Николаева Илиева",
    "grade": 18,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетни 2018": 2.25,
      "Есенни 2017": 2.0
    },
    "competition_grades": {
      "Пролетни 2018": 4.0,
      "Есенни 2017": 4.0
    }
  },
  {
    "name": "Симеон Светославов Стефанов",
    "grade": 18,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Есенни 2015": 20.0,
      "Пролетни 2014": 13.0,
      "Есенни 2013": 25.75
    },
    "competition_grades": {
      "Есенни 2015": 2.0,
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Мерилийн Асенова Иванова",
    "grade": 18,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Пролетни 2017": 4.75,
      "Есенни 2016": 5.25
    },
    "competition_grades": {
      "Пролетни 2017": 3.0,
      "Есенни 2016": 3.0
    }
  },
  {
    "name": "Диляна Цветелинова Цвяткова",
    "grade": 18,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенни 2015": 20.5,
      "Есенни 2013": 20.0
    },
    "competition_grades": {
      "Есенни 2015": 2.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Димитър Димитров Цонев",
    "grade": 18,
    "school": "ППМГ \"Н. Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетни 2017": 2.5,
      "Есенни 2015": 13.0,
      "Пролетни 2014": 5.0,
      "Есенни 2013": 10.25
    },
    "competition_grades": {
      "Пролетни 2017": 3.0,
      "Есенни 2015": 2.0,
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Изабел Славова Лангурова",
    "grade": 18,
    "school": "ПМГ \"Н.Обрешков\"",
    "city": "Казанлък",
    "competitions": {
      "Пролетни 2017": 4.5,
      "Есенни 2015": 8.75
    },
    "competition_grades": {
      "Пролетни 2017": 3.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Елица Светославова Попова",
    "grade": 18,
    "school": "ГПЧЕ \"Йоан Екзарх\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2017": 7.25
    },
    "competition_grades": {
      "Пролетни 2017": 3.0
    }
  },
  {
    "name": "Денислав Николаев Караиванов",
    "grade": 18,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2016": 6.5,
      "Есенни 2015": 14.0
    },
    "competition_grades": {
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Борислав Христов Драганджиков",
    "grade": 18,
    "school": "1 АЕГ",
    "city": "София",
    "competitions": {
      "Есенни 2017": 4.0
    },
    "competition_grades": {
      "Есенни 2017": 4.0
    }
  },
  {
    "name": "Димитър Пламенов Иванов",
    "grade": 18,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2016": 6.0,
      "Есенни 2015": 14.0
    },
    "competition_grades": {
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Тодор Николов Ранчев",
    "grade": 18,
    "school": "1 АЕГ",
    "city": "София",
    "competitions": {
      "Есенни 2015": 20.75
    },
    "competition_grades": {
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Калин Ваклинов Върбанов",
    "grade": 18,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2015": 20.5
    },
    "competition_grades": {
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Димитър Пеев Янков",
    "grade": 18,
    "school": "ОМГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2016": 5.5,
      "Есенни 2015": 13.0
    },
    "competition_grades": {
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Мина Росенова Бонева",
    "grade": 18,
    "school": "91 НЕГ",
    "city": "София",
    "competitions": {
      "Есенни 2016": 8.5
    },
    "competition_grades": {
      "Есенни 2016": 3.0
    }
  },
  {
    "name": "Яна Георгиева Начева",
    "grade": 18,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Есенни 2017": 3.5
    },
    "competition_grades": {
      "Есенни 2017": 4.0
    }
  },
  {
    "name": "Рафаела Николаева Иванова",
    "grade": 18,
    "school": "Американски колеж",
    "city": "София",
    "competitions": {
      "Есенни 2015": 19.0
    },
    "competition_grades": {
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Божидар Томиславов Русев",
    "grade": 18,
    "school": "1 АЕГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2016": 10.5
    },
    "competition_grades": {
      "Олимпиада 2016": 2.0
    }
  },
  {
    "name": "Филип Александров Александров",
    "grade": 18,
    "school": "73 СОУ",
    "city": "София",
    "competitions": {
      "Есенни 2015": 18.0
    },
    "competition_grades": {
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Мартин Тихомиров Тодоров",
    "grade": 18,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2016": 3.25,
      "Есенни 2015": 13.5
    },
    "competition_grades": {
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Десислава Николова Вълчева",
    "grade": 18,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетни 2016": 4.75,
      "Есенни 2015": 11.0
    },
    "competition_grades": {
      "Пролетни 2016": 2.0,
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Григор Божидаров Димитров",
    "grade": 18,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Есенни 2015": 16.0
    },
    "competition_grades": {
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Виктория Лъчезарова Трайкова",
    "grade": 18,
    "school": "1 АЕГ",
    "city": "София",
    "competitions": {
      "Есенни 2015": 15.75
    },
    "competition_grades": {
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Калоян Цветелинов Спиров",
    "grade": 18,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенни 2015": 11.0,
      "Пролетни 2014": 20.0
    },
    "competition_grades": {
      "Есенни 2015": 2.0,
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Елица Павлова Богданова",
    "grade": 18,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2016": 11.75
    },
    "competition_grades": {
      "Пролетни 2016": 2.0
    }
  },
  {
    "name": "Валентин Атанасов Бенов",
    "grade": 18,
    "school": "МГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2017": 4.75
    },
    "competition_grades": {
      "Пролетни 2017": 3.0
    }
  },
  {
    "name": "Мирослав Мирославов Миланов",
    "grade": 18,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2016": 11.25
    },
    "competition_grades": {
      "Пролетни 2016": 2.0
    }
  },
  {
    "name": "Радослав Стоянов Димитров",
    "grade": 18,
    "school": "ОМГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Олимпиада 2014": 23.35,
      "Пролетни 2014": 16.5,
      "Есенни 2013": 20.75
    },
    "competition_grades": {
      "Олимпиада 2014": 1.0,
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Виктор Георгиев Върбанов",
    "grade": 18,
    "school": "ПМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Пролетни 2016": 11.0
    },
    "competition_grades": {
      "Пролетни 2016": 2.0
    }
  },
  {
    "name": "Александър Миленов Георгиев",
    "grade": 18,
    "school": "МГ \"Баба Тонка\"",
    "city": "Русе",
    "competitions": {
      "Есенни 2015": 13.75
    },
    "competition_grades": {
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Христо Тодоров Христов",
    "grade": 18,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2015": 13.75
    },
    "competition_grades": {
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Виолета Панчева Чаталбашева",
    "grade": 18,
    "school": "ПМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2016": 9.75
    },
    "competition_grades": {
      "Пролетни 2016": 2.0
    }
  },
  {
    "name": "Мая Мартинова Стоянова",
    "grade": 18,
    "school": "ГПНЕ \"Гьоте\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2016": 9.0
    },
    "competition_grades": {
      "Пролетни 2016": 2.0
    }
  },
  {
    "name": "Преслава Валентинова Стоянова",
    "grade": 18,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Есенни 2015": 11.5
    },
    "competition_grades": {
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Александър Ивов Моравски",
    "grade": 18,
    "school": "НПМГ",
    "city": "София",
    "competitions": {
      "Пролетни 2016": 8.5
    },
    "competition_grades": {
      "Пролетни 2016": 2.0
    }
  },
  {
    "name": "Йоана-Кристин Станиславова Станева",
    "grade": 18,
    "school": "ЕГ \"Гео Милев\"",
    "city": "Добрич",
    "competitions": {
      "Пролетни 2016": 8.5
    },
    "competition_grades": {
      "Пролетни 2016": 2.0
    }
  },
  {
    "name": "Натали Иванова Иванова",
    "grade": 18,
    "school": "ПМГ \"Акад. С. Корольов\"",
    "city": "Благоевград",
    "competitions": {
      "Есенни 2016": 4.75
    },
    "competition_grades": {
      "Есенни 2016": 3.0
    }
  },
  {
    "name": "Ния Кирилова Василева",
    "grade": 18,
    "school": "ППМГ \"Акад. Иван Ценов\"",
    "city": "Враца",
    "competitions": {
      "Есенни 2017": 2.0
    },
    "competition_grades": {
      "Есенни 2017": 4.0
    }
  },
  {
    "name": "Михаил Савин",
    "grade": 18,
    "school": "ЧПГпоИТОК\"Екзюпери\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2015": 10.75
    },
    "competition_grades": {
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Бинас Бинаминова Кьойбашиева",
    "grade": 18,
    "school": "СУ \"Св .Кл. Охридски\"",
    "city": "с. Слащен",
    "competitions": {
      "Есенни 2016": 4.5
    },
    "competition_grades": {
      "Есенни 2016": 3.0
    }
  },
  {
    "name": "Анна Радославова Славева",
    "grade": 18,
    "school": "ПМГ \"Проф. Ем. Иванов\"",
    "city": "Кюстендил",
    "competitions": {
      "Пролетни 2016": 7.5
    },
    "competition_grades": {
      "Пролетни 2016": 2.0
    }
  },
  {
    "name": "Асен Георгиев Георгиев",
    "grade": 18,
    "school": "ЕГ \"Акад. Л.Стоянов\"",
    "city": "Благоевград",
    "competitions": {
      "Олимпиада 2018": 1.0
    },
    "competition_grades": {
      "Олимпиада 2018": 4.0
    }
  },
  {
    "name": "Златина Тодорова Милева",
    "grade": 18,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2014": 20.0,
      "Есенни 2013": 29.0
    },
    "competition_grades": {
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Стефани Стефанова Милчева",
    "grade": 18,
    "school": "1 АЕГ",
    "city": "София",
    "competitions": {
      "Есенни 2015": 9.75
    },
    "competition_grades": {
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Александър Велизар Чернев",
    "grade": 18,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Олимпиада 2014": 20.75,
      "Пролетни 2014": 10.5
    },
    "competition_grades": {
      "Олимпиада 2014": 1.0,
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Габриела Стефанова Палаузова",
    "grade": 18,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2015": 8.75
    },
    "competition_grades": {
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Веселин Петев Петков",
    "grade": 18,
    "school": "ГПЧЕ \"Йоан Екзарх\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2017": 2.75
    },
    "competition_grades": {
      "Пролетни 2017": 3.0
    }
  },
  {
    "name": "Иван Александров Караколев",
    "grade": 18,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2015": 8.5
    },
    "competition_grades": {
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Алекс Данаилов Данаилов",
    "grade": 18,
    "school": "18 СОУ",
    "city": "София",
    "competitions": {
      "Олимпиада 2014": 25.1
    },
    "competition_grades": {
      "Олимпиада 2014": 1.0
    }
  },
  {
    "name": "Чавдар Цветанов Лалов",
    "grade": 18,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2014": 17.0,
      "Есенни 2013": 21.5
    },
    "competition_grades": {
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Емили Георгиева Вецева",
    "grade": 18,
    "school": "ОМГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2014": 15.0,
      "Есенни 2013": 24.0
    },
    "competition_grades": {
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Васко Василев Милчов",
    "grade": 18,
    "school": "ПМГ \"Проф. Ем. Иванов\"",
    "city": "Кюстендил",
    "competitions": {
      "Есенни 2015": 7.75
    },
    "competition_grades": {
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Дженифър Станимирова Илиева",
    "grade": 18,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2016": 5.5
    },
    "competition_grades": {
      "Пролетни 2016": 2.0
    }
  },
  {
    "name": "Джейлян Хасанова Садъкова",
    "grade": 18,
    "school": "СУ \"Васил Левски\"",
    "city": "Велинград",
    "competitions": {
      "Есенни 2016": 3.0
    },
    "competition_grades": {
      "Есенни 2016": 3.0
    }
  },
  {
    "name": "Алекс Миленов Тонев",
    "grade": 18,
    "school": "ПЧАГ",
    "city": "София",
    "competitions": {
      "Есенни 2017": 1.25
    },
    "competition_grades": {
      "Есенни 2017": 4.0
    }
  },
  {
    "name": "Милена Миленова Петкова",
    "grade": 18,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2016": 5.0
    },
    "competition_grades": {
      "Пролетни 2016": 2.0
    }
  },
  {
    "name": "Пламенна Викторова Петрова",
    "grade": 18,
    "school": "ОУ \"Св. П. Евтимий\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2014": 15.25,
      "Есенни 2013": 16.75
    },
    "competition_grades": {
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Ати Цанкова Кафеджиева",
    "grade": 18,
    "school": "СУ \"Васил Левски\"",
    "city": "Велинград",
    "competitions": {
      "Есенни 2016": 2.75
    },
    "competition_grades": {
      "Есенни 2016": 3.0
    }
  },
  {
    "name": "Димо Георгиев Иванов",
    "grade": 18,
    "school": "ЕГ \"Проф. д-р Асен Златаров\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2015": 6.5
    },
    "competition_grades": {
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Даниел Ивайлов Николов",
    "grade": 18,
    "school": "ПМГ \"Акад. Н. Обрешков\"",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2014": 11.75,
      "Есенни 2013": 20.25
    },
    "competition_grades": {
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Галина Цанкова Станева",
    "grade": 18,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2014": 14.0,
      "Есенни 2013": 17.25
    },
    "competition_grades": {
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Ивайло Пламенов Петков",
    "grade": 18,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2015": 6.0
    },
    "competition_grades": {
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Йоана Пламенова Петрова",
    "grade": 18,
    "school": "ЕГ \"Проф. д-р Асен Златаров\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2015": 6.0
    },
    "competition_grades": {
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Габриела Ангелова Ангелова",
    "grade": 18,
    "school": "СУ \"Ал.Иванов-Чапай\"",
    "city": "Белово",
    "competitions": {
      "Есенни 2016": 2.5
    },
    "competition_grades": {
      "Есенни 2016": 3.0
    }
  },
  {
    "name": "Ванеса Борисова Искилиева",
    "grade": 18,
    "school": "ОМГ \"Акад. К. Попов\"",
    "city": "Пловдив",
    "competitions": {
      "Пролетни 2014": 13.5,
      "Есенни 2013": 14.75
    },
    "competition_grades": {
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Никол Мартинова Гилева",
    "grade": 18,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Пролетни 2014": 6.75,
      "Есенни 2013": 23.75
    },
    "competition_grades": {
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Деян Генадиев Емилов",
    "grade": 18,
    "school": "ПМГ \"Екзарх Антим I\"",
    "city": "Видин",
    "competitions": {
      "Олимпиада 2014": 17.5
    },
    "competition_grades": {
      "Олимпиада 2014": 1.0
    }
  },
  {
    "name": "Никол Светославова Стоянова",
    "grade": 18,
    "school": "ОУ\"В. Левски\"",
    "city": "Разград",
    "competitions": {
      "Пролетни 2014": 8.25,
      "Есенни 2013": 19.5
    },
    "competition_grades": {
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Мартин Йорданов Пенев",
    "grade": 18,
    "school": "ОУ\"В. Левски\"",
    "city": "Разград",
    "competitions": {
      "Пролетни 2014": 5.75,
      "Есенни 2013": 20.75
    },
    "competition_grades": {
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Десислава Мусова Хаджиасанова",
    "grade": 18,
    "school": "СУ \"Васил Левски\"",
    "city": "Велинград",
    "competitions": {
      "Есенни 2016": 2.0
    },
    "competition_grades": {
      "Есенни 2016": 3.0
    }
  },
  {
    "name": "Ива Миткова Митева",
    "grade": 18,
    "school": "СОУ \"Васил Левски\"",
    "city": "Крумовград",
    "competitions": {
      "Олимпиада 2014": 11.25,
      "Пролетни 2014": 3.75
    },
    "competition_grades": {
      "Олимпиада 2014": 1.0,
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Атанас Кирилов Коларски",
    "grade": 18,
    "school": "104 ОУ",
    "city": "София",
    "competitions": {
      "Пролетни 2014": 4.25,
      "Есенни 2013": 18.75
    },
    "competition_grades": {
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Аристот Кахолу Кайонгу",
    "grade": 18,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2014": 7.5,
      "Есенни 2013": 13.75
    },
    "competition_grades": {
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Йоана Росенова Урумова",
    "grade": 18,
    "school": "МГ \"Д-р П. Берон\"",
    "city": "Варна",
    "competitions": {
      "Есенни 2013": 23.5
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Филип Красимиров Стоянов",
    "grade": 18,
    "school": "СМГ",
    "city": "София",
    "competitions": {
      "Есенни 2013": 23.5
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Адриан Сохейлов Мотахар",
    "grade": 18,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2015": 4.0
    },
    "competition_grades": {
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Владислав Емилов Манолов",
    "grade": 18,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2015": 4.0
    },
    "competition_grades": {
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Ивета Дилянова Дамянова",
    "grade": 18,
    "school": "ОУ \"Иван Вазов\"",
    "city": "Видин",
    "competitions": {
      "Олимпиада 2014": 12.05
    },
    "competition_grades": {
      "Олимпиада 2014": 1.0
    }
  },
  {
    "name": "Елица Иванова Бонева",
    "grade": 18,
    "school": "ОУ \"Св. П. Евтимий\"",
    "city": "Велико Търново",
    "competitions": {
      "Пролетни 2014": 16.0
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Тина-Мария Димитрова Бурова",
    "grade": 18,
    "school": "ОУ \"Д-р И. Селимински\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2013": 21.0
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Николай Милков Петровски",
    "grade": 18,
    "school": "ОУ \"Св. П. Евтимий\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2013": 20.25
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Габриел Сашев Бетов",
    "grade": 18,
    "school": "МГ \"Гео Милев\"",
    "city": "Плевен",
    "competitions": {
      "Пролетни 2014": 6.25,
      "Есенни 2013": 11.5
    },
    "competition_grades": {
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Калоян Радославов Кутийски",
    "grade": 18,
    "school": "ПМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2013": 19.25
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Васил Атанасов Раев",
    "grade": 18,
    "school": "СОУ \"Васил Левски\"",
    "city": "Крумовград",
    "competitions": {
      "Пролетни 2014": 3.0,
      "Есенни 2013": 14.75
    },
    "competition_grades": {
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Деница Красимирова Стефанова",
    "grade": 18,
    "school": "ОУ \"П. Хитов\"",
    "city": "Сливен",
    "competitions": {
      "Пролетни 2014": 5.0,
      "Есенни 2013": 10.25
    },
    "competition_grades": {
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Никола Красимиров Димитров",
    "grade": 18,
    "school": "ПМГ \"Проф. Ем. Иванов\"",
    "city": "Кюстендил",
    "competitions": {
      "Есенни 2013": 16.75
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Пенка Иванова Радева",
    "grade": 18,
    "school": "СОУ \"К. Константинов\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2013": 16.75
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Преслав Иванов Петров",
    "grade": 18,
    "school": "1 АЕГ",
    "city": "София",
    "competitions": {
      "Есенни 2017": 0.5
    },
    "competition_grades": {
      "Есенни 2017": 4.0
    }
  },
  {
    "name": "Георги Димитров Друмев",
    "grade": 18,
    "school": "ПМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2013": 15.25
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Гергана Павлова Николова",
    "grade": 18,
    "school": "СОУ \"Св. Св. Кирил и Методий\"",
    "city": "Смолян",
    "competitions": {
      "Пролетни 2014": 10.75
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Христо Петров Цветков",
    "grade": 18,
    "school": "ПМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Пролетни 2014": 10.75
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Андриан Георгиев Серафимов",
    "grade": 18,
    "school": "ЕГ \"Проф. д-р Асен Златаров\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2015": 2.5
    },
    "competition_grades": {
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Георги Илиев Мартев",
    "grade": 18,
    "school": "ПЧМГ",
    "city": "София",
    "competitions": {
      "Есенни 2013": 14.0
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Мария Стелиянова Тодорова",
    "grade": 18,
    "school": "ПМГ \"Проф. Ем. Иванов\"",
    "city": "Кюстендил",
    "competitions": {
      "Пролетни 2014": 9.75
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Моника Светозарова Ламбева",
    "grade": 18,
    "school": "СОУ \"М. Райкович\"",
    "city": "Дряново",
    "competitions": {
      "Пролетни 2014": 9.75
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Жулиета Светлинова Немцова",
    "grade": 18,
    "school": "ОУ \"П. Хитов\"",
    "city": "Сливен",
    "competitions": {
      "Пролетни 2014": 2.0,
      "Есенни 2013": 10.0
    },
    "competition_grades": {
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Петър Георгиев Паричков",
    "grade": 18,
    "school": "СОУ \"Св. Св. Кирил и Методий\"",
    "city": "Смолян",
    "competitions": {
      "Пролетни 2014": 9.5
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Симеон Александров Кьосев",
    "grade": 18,
    "school": "ОУ \"Св. св. Кирил и Методий\"",
    "city": "Кърджали",
    "competitions": {
      "Есенни 2013": 12.25
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Теодора Живкова Божева",
    "grade": 18,
    "school": "ПМГ \"Иван Вазов\"",
    "city": "Димитровград",
    "competitions": {
      "Есенни 2013": 12.25
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Радослава Лазарова Гаджева",
    "grade": 18,
    "school": "СОУ \"Хр. Ботев\"",
    "city": "Септември",
    "competitions": {
      "Пролетни 2014": 9.0
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Иван Владимиров Тосков",
    "grade": 18,
    "school": "СОУ \"Васил Левски\"",
    "city": "Крумовград",
    "competitions": {
      "Пролетни 2014": 2.0,
      "Есенни 2013": 9.0
    },
    "competition_grades": {
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Константин Неломилов Иванов",
    "grade": 18,
    "school": "ОУ\"В. Левски\"",
    "city": "Разград",
    "competitions": {
      "Пролетни 2014": 1.0,
      "Есенни 2013": 10.25
    },
    "competition_grades": {
      "Пролетни 2014": 1.0,
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Божидара Павлова Николова",
    "grade": 18,
    "school": "СОУ \"Св. Св. Кирил и Методий\"",
    "city": "Смолян",
    "competitions": {
      "Пролетни 2014": 8.5
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Маргарита Ивайлова Стоянова",
    "grade": 18,
    "school": "4 ОУ \"Св. Св. Козма и Дамян\"",
    "city": "Сандански",
    "competitions": {
      "Пролетни 2014": 8.5
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Снежана Миткова Митева",
    "grade": 18,
    "school": "ОУ \"Хр. Ботев\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2013": 10.75
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Красимир Севдалинов Калоянов",
    "grade": 18,
    "school": "ПМГ \"Нанчо Попович\"",
    "city": "Шумен",
    "competitions": {
      "Пролетни 2014": 8.0
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Мина Иванова Бъчварова",
    "grade": 18,
    "school": "107 ОУ \"Хан Крум\"",
    "city": "София",
    "competitions": {
      "Пролетни 2014": 8.0
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Виктория Богомилова Маринова",
    "grade": 18,
    "school": "СОУ \"Христо Ботев\"",
    "city": "Кубрат",
    "competitions": {
      "Есенни 2013": 10.5
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Жоржина Георгиева Иванова",
    "grade": 18,
    "school": "ОУ \"Е. Багряна\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2013": 10.0
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Костадин Огнянов Тошев",
    "grade": 18,
    "school": "ПМГ \"Д. Чинтулов\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2013": 10.0
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Мария Николаева Ганева",
    "grade": 18,
    "school": "СОУ \"М. Райкович\"",
    "city": "Дряново",
    "competitions": {
      "Пролетни 2014": 7.5
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Бисер Пламенов Атанасов",
    "grade": 18,
    "school": "ОУ \"Д-р И. Селимински\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2013": 9.75
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Адина Фарук Пушкаревич",
    "grade": 18,
    "school": "СОУ \"Св. Св. Кирил и Методий\"",
    "city": "Смолян",
    "competitions": {
      "Пролетни 2014": 7.25
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Елизабет Стоянова Вардина",
    "grade": 18,
    "school": "СОУ \"Хр. Ботев\"",
    "city": "Септември",
    "competitions": {
      "Пролетни 2014": 7.25
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Азизе Исмаил Арнауд",
    "grade": 18,
    "school": "СОУ \"Св. Св. Кирил и Методий\"",
    "city": "с. Сатовча",
    "competitions": {
      "Пролетни 2014": 7.0
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Георги Тонев Ангелов",
    "grade": 18,
    "school": "ОУ \"Е. Багряна\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2013": 9.25
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Дони Ванев Иванов",
    "grade": 18,
    "school": "ОУ \"Д-р И. Селимински\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2013": 8.5
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Теодора Красимирова Борилова",
    "grade": 18,
    "school": "104 ОУ",
    "city": "София",
    "competitions": {
      "Есенни 2013": 8.5
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Ива Илиева Груева",
    "grade": 18,
    "school": "4 ОУ \"Св. Св. Козма и Дамян\"",
    "city": "Сандански",
    "competitions": {
      "Пролетни 2014": 6.25
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Кристияна Красимирова Коева",
    "grade": 18,
    "school": "СОУ \"К. Константинов\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2013": 8.25
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Величка Живкова Воденичарова",
    "grade": 18,
    "school": "2 ОУ \"Христо Смирненски\"",
    "city": "Сандански",
    "competitions": {
      "Пролетни 2014": 6.0
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Ирина Николаева Стоева",
    "grade": 18,
    "school": "1 ОУ \"Св. Кл. Охридски\"",
    "city": "Сандански",
    "competitions": {
      "Пролетни 2014": 6.0
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Георги Ангелов Ангелов",
    "grade": 18,
    "school": "1 ОУ \"Св. Кл. Охридски\"",
    "city": "Сандански",
    "competitions": {
      "Пролетни 2014": 5.75
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Добромир Здравков Петров",
    "grade": 18,
    "school": "ОУ \"Е. Багряна\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2013": 7.5
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Дебора Георгиева Обретенова",
    "grade": 18,
    "school": "ГПАЕ",
    "city": "Бургас",
    "competitions": {
      "Пролетни 2016": 1.0
    },
    "competition_grades": {
      "Пролетни 2016": 2.0
    }
  },
  {
    "name": "Дамян Атанасов Атанасов",
    "grade": 18,
    "school": "СОУ \"Христо Ботев\"",
    "city": "Русе",
    "competitions": {
      "Есенни 2013": 7.25
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Цветомир Цветомиров Пенчев",
    "grade": 18,
    "school": "ПМГ \"Васил Друмев\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2015": 1.25
    },
    "competition_grades": {
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Кристина Николаева Толева",
    "grade": 18,
    "school": "ОУ \"Е. Багряна\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2013": 6.75
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Мартин Станиславов Банов",
    "grade": 18,
    "school": "ОУ \"Св. св. Кирил и Методий\"",
    "city": "Ботевград",
    "competitions": {
      "Пролетни 2014": 5.0
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Даниел Радостинов Пейчев",
    "grade": 18,
    "school": "ОУ \"П. Хитов\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2013": 6.25
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Берна Метин Сали",
    "grade": 18,
    "school": "СОУ \"Христо Ботев\"",
    "city": "Чорбаджийско",
    "competitions": {
      "Есенни 2013": 6.0
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Димитър Илиев Стоев",
    "grade": 18,
    "school": "2 ОУ \"Христо Смирненски\"",
    "city": "Сандански",
    "competitions": {
      "Пролетни 2014": 4.5
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Гергана Христова Георгиева",
    "grade": 18,
    "school": "ОУ \"Св. св. Кирил и Методий\"",
    "city": "Ботевград",
    "competitions": {
      "Пролетни 2014": 4.25
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Катрин Каменова Сабелова",
    "grade": 18,
    "school": "ЕГ \"Проф. д-р Асен Златаров\"",
    "city": "Велико Търново",
    "competitions": {
      "Есенни 2015": 1.0
    },
    "competition_grades": {
      "Есенни 2015": 2.0
    }
  },
  {
    "name": "Пламена Георгиева Кенарева",
    "grade": 18,
    "school": "ОУ \"Е. Багряна\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2013": 5.25
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Валентин Валериев Заимов",
    "grade": 18,
    "school": "СОУ \"Св. Св. Кирил и Методий\"",
    "city": "с. Сатовча",
    "competitions": {
      "Пролетни 2014": 3.75
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Любомир Георгиев Иванов",
    "grade": 18,
    "school": "2 ОУ \"Христо Смирненски\"",
    "city": "Сандански",
    "competitions": {
      "Пролетни 2014": 3.5
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Вяра Тенчева Йорданова",
    "grade": 18,
    "school": "СОУ \"К. Константинов\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2013": 4.25
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Марин Николаев Нинов",
    "grade": 18,
    "school": "ОУ \"Св. св. Кирил и Методий\"",
    "city": "Кърджали",
    "competitions": {
      "Есенни 2013": 3.75
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Аделина Георгиева Георгиева",
    "grade": 18,
    "school": "2 ОУ \"Христо Смирненски\"",
    "city": "Сандански",
    "competitions": {
      "Пролетни 2014": 2.75
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Надя Жекова Желева",
    "grade": 18,
    "school": "ОУ \"П. Хитов\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2013": 3.0
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Джулия Ясенова Чолакова",
    "grade": 18,
    "school": "СОУ \"Христо Ботев\"",
    "city": "Чорбаджийско",
    "competitions": {
      "Есенни 2013": 2.5
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Даниел Николов Николов",
    "grade": 18,
    "school": "104 ОУ",
    "city": "София",
    "competitions": {
      "Пролетни 2014": 1.0
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Иван Станиславов Илиев",
    "grade": 18,
    "school": "104 ОУ",
    "city": "София",
    "competitions": {
      "Пролетни 2014": 1.0
    },
    "competition_grades": {
      "Пролетни 2014": 1.0
    }
  },
  {
    "name": "Васил Павлинов Костов",
    "grade": 18,
    "school": "ОУ \"П. Хитов\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2013": 1.25
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Деница Павлинова Йорданова",
    "grade": 18,
    "school": "ОУ \"Е. Багряна\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2013": 1.25
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Диян Мариев Димитров",
    "grade": 18,
    "school": "ОУ \"П. Хитов\"",
    "city": "Сливен",
    "competitions": {
      "Есенни 2013": 0.25
    },
    "competition_grades": {
      "Есенни 2013": 1.0
    }
  },
  {
    "name": "Максим Лъчезаров Николов",
    "grade": 18,
    "school": "НПГПТО \"М.В.Ломоносов\"",
    "city": "София",
    "competitions": {
      "Есенни 2017": 0.0
    },
    "competition_grades": {
      "Есенни 2017": 4.0
    }
  }
]